[
  {
    "helpfulCount": 7,
    "helpfulScore": 2,
    "date": "2003-04-02T00:00:00.000Z",
    "score": 9.6,
    "comments": "\nstarcraft is not just a good game. it is one of the classic games that people will keep playing forever. its one of does game that doesnt continue a trend, it starts one. even thought this game is about 5 years old (i th... ",
    "gameID": 1,
    "author": "homeskillet305"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2003-10-27T00:00:00.000Z",
    "score": 9.7,
    "comments": "\nwow all i can say is wow this is defintely the greates strategy game ever made great story good voice acting but just ok graphics but who cares about graphics when you are playing such a great game each race is very powe... ",
    "gameID": 1,
    "author": "cyberzero-x"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 1,
    "date": "2003-11-14T00:00:00.000Z",
    "score": 9.9,
    "comments": "\nStarcraft is the most-played game ever for me. Over 4 years I\u0027ve probably spent at least 500, 600 hours playing the game. Definitely the best RTS game ever in my opinion, beating Blizzard\u0027s Warcrafts and the Command an... ",
    "gameID": 1,
    "author": "Stevorino"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2004-03-15T00:00:00.000Z",
    "score": 9.6,
    "comments": "\nThis is a fantastic RTS without doubt, better in some ways than the new WAR3. (which i have played extensively) You should know that the bad reviews come from people who never expericenced what this game has to offer. Mo... ",
    "gameID": 1,
    "author": "mop88"
  },
  {
    "helpfulCount": 14,
    "helpfulScore": 8,
    "date": "2004-05-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "\nStarcraft is from the makers of some of the best RTS in the world, Blizzard! Starcrat takes place in a futuristic world, and this game is very addictive. First, i palyed lots of LAN games, and i wasted many hours playi... ",
    "gameID": 1,
    "author": "-HighStakes-"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2004-06-22T00:00:00.000Z",
    "score": 9.7,
    "comments": "\nWOW this game is amazing...it is my favorite pc stradegy game of all time. Now you may think \"man he must not have played very many but believe this when i say it i have played at least 20 different stradegy games, but ... ",
    "gameID": 1,
    "author": "covenant130"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 5,
    "date": "2004-07-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "\nAll I can say is, what an awesome game that is, perfect storyline, perfect view from all sides, the races are awesome, the missions are fun, the units are cool and combat is crazy and fast paced. Great musical score too,... ",
    "gameID": 1,
    "author": "agentzed"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2004-08-29T00:00:00.000Z",
    "score": 9.9,
    "comments": "This game is one of the best I have ever played in ever way. This is the game that got me into gaming.\nGameplay- The gameplay in Starcraft is fairly similar to other strategy games. You climb a tech tree and build units. But that\u0027s just the start of it. The most amazing thing is how Blizzard was able to perfectly balance ... ",
    "gameID": 1,
    "author": "assassin23"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2004-09-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Maby the best expantion ever for a strategy pc game! It features new units that brings a perfect balance to the game...\nThe units completely changes the game, in a very good game that is. It brings a new dimention to the strategy part. It is really great! The new medics makes the Terran much better. And the other races also gets a grea... ",
    "gameID": 1,
    "author": "Badfellah"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2004-09-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "great game for the pc and you hsould definately get this game\nStarcraft is a great game for the PC. I usually don\u0027t even play games on the PC, but when my friend let me play it at his house i was hooked on it in no time. At first it\u0027s complicated, but after about 30 min to an hour.... ",
    "gameID": 1,
    "author": "jojabulldawgs91"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 5,
    "date": "2004-09-16T00:00:00.000Z",
    "score": 9.6,
    "comments": "Excellent expansion for the original.\nIn this expansion there are new units: Terran \u003d Medic, Valkyrie. Zerg \u003d Lurker, Devourer. Protoss \u003d Dark Templar, Dark Archon, Corsair. This is an excellent expansion, and is a nice add on to the original storyline... ",
    "gameID": 1,
    "author": "ShadoDragon56"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2004-09-16T00:00:00.000Z",
    "score": 9.6,
    "comments": "The first \"real\" PC game I ever played.\nThis is the first \"Real\" PC game that I ever played. My cousin introduced PC games to me for the first time in 1999, when i was 9. It became the base to my new found love for gaming. It is still one of the most played ga... ",
    "gameID": 1,
    "author": "ShadoDragon56"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2004-09-24T00:00:00.000Z",
    "score": 9.0,
    "comments": "Blizzard\u0027s classic RTS hit will be remembered for a lot of unit micro-management and three perfectly different races.\nAs old a game as 1998\u0027s Starcraft deserves a mention for a very simple reason: it is still being played today. The low system requirements and timeless gameplay given to the original by the expansion pack Brood War make ... ",
    "gameID": 1,
    "author": "martlume"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2004-09-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "Simply amazing.\nThis game is utterly amazing. Starcraft was the game that got me hooked on RTS way back in the day. In its time, starcraft had good graphics coupled with amazing sounds and solid gameplay. The three factions in the game,... ",
    "gameID": 1,
    "author": "Skull_kid2000"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2004-10-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Simply a classic. Great for cheap, and a good title if you have an older computer.\nThis is my favorite real time strategy (RTS) EVER! I guess Blizzard\u0027s own Warcraft series is credited with starting the genre, but StarCraft is still my favorite. I still have a fond memory of being introduced to thi... ",
    "gameID": 1,
    "author": "Srinivassa"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2004-10-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "Amazing, not much else to say. This game will leave you addicted for life.\nSo, if you like RTS games, then this game will be entertaining forever. By far this game has the premiere founding basis for all RTS games. All the elements including the character voices and mini-animations are exciting... ",
    "gameID": 1,
    "author": "Shadowcaster_98"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2004-10-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "By far the best RTS ever created!!!\nSo, if you like RTS games, then this game will be entertaining forever. By far this game has the premiere founding basis for all RTS games. All the elements including the character voices and mini-animations are exciting... ",
    "gameID": 1,
    "author": "Shadowcaster_98"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2004-11-18T00:00:00.000Z",
    "score": 9.7,
    "comments": "Starcraft offers an awesome experience for every gamer.\nStarcraft is very possibly the best Real Time Strategy game ever made. It offers an intriguing single player campaign, as well as AMAZING multiplayer. The multiplayer options on Battle.net MUST be stressed, as I have y... ",
    "gameID": 1,
    "author": "jstarzyk"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2004-11-23T00:00:00.000Z",
    "score": 9.4,
    "comments": "Oldies but goodies\nThis game has been one of that which remains active after many years of its launch. The Brrodwar expansion gave to Starcraft the elements necessary to level out the different civilizations of the three species. Broodw... ",
    "gameID": 1,
    "author": "adgal98"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 3,
    "date": "2004-11-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "Once upon a time, an already moderately famous company called Blizzard created a gem of a game, called Starcraft.\nOnce upon a time, an already moderately famous company called Blizzard created a gem of a game, called Starcraft. The best RTS ever, and easily the best game ever period, Starcraft rose in rank on the popularity chart un... ",
    "gameID": 1,
    "author": "Ioden"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2004-12-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "Where to start...\nWell, this certainly one of the best games Blizzard has ever created. This RTS game is so freakin awesome, it blew my socks off. In fact, I think it blew 20 pairs of my socks off. It\u0027s that amazing. Starcraft is argua... ",
    "gameID": 1,
    "author": "Warp_2567"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2004-12-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "I don\u0027t give out 10\u0027s easily, but this game is the best in its genre.\nStarcraft: Brood War is the best RTS of all time. No other RTS will ever be as good as Starcraft. Gameplay: Where to begin? Starcraft is a classic RTS. You build miners, gather resources, upgrade technologies, build ... ",
    "gameID": 1,
    "author": "randar23rhenn"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2004-12-19T00:00:00.000Z",
    "score": 9.4,
    "comments": "Very well done, balanced perfect, and multiplayer has enough options to keep you playing for a very long time.\nThis game let\u0027s you know for sure why Blizzard rules the PC market with an iron fist, immersive detail, memorable charicters, replayability out the wazoo, and the subtle humor and little joke that make this game an insta... ",
    "gameID": 1,
    "author": "UnknownSurvivor"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-01-01T00:00:00.000Z",
    "score": 9.3,
    "comments": "Starcraft is worth picking up.\nWhen Starcraft was released 1998, no one could forsee this being one of the worlds,most popular games to date.The game campaign had you choosing from Terran (humans) Protoss (looks like predators) and Zerg (alien like c... ",
    "gameID": 1,
    "author": "Cesiao"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-02-01T00:00:00.000Z",
    "score": 9.6,
    "comments": "Impressive, even against our newest RTS games.\nEvery once in a while, there is a game in each genre that shouts out, a game that somewhat mutates the everyday formula, causing a gaming evolution (I am writing this review for game and expansion). Although used by pre... ",
    "gameID": 1,
    "author": "Entih"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-02-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "Play Starcraft.\nI can\u0027t say much about Starcraft that you haven\u0027t heard if you\u0027re into computer games. It is a legend in its own field, the standard by which other realtime strategy games are judged. I can only reinforce that. ... ",
    "gameID": 1,
    "author": "Nealok"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-02-07T00:00:00.000Z",
    "score": 9.5,
    "comments": "Buy it. Use it as the barometer by which you gauge all other RTS games.\nOpinions about Brood War are divided for some reason. The only people who don\u0027t prefer Brood War over Starcraft, I have observed, are people who are afraid to change and as a result haven\u0027t spent enough time with the ex... ",
    "gameID": 1,
    "author": "Nealok"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-02-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is it... This is THE game...\nTHE game that i still play now on february 8 2005...THE game that i got a good 5 years ago... THE game that is so amazing and so much fun... if you don\u0027t get the point yet...im saying that this is one of the all time gre... ",
    "gameID": 1,
    "author": "DarkGnome55"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2005-02-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "The one that started it all. Starcraft, simply put, is my favorite game - all time.\nWhat a masterpiece this game is. Produced in 1998, could you have expected any more? And still, we have over 100,000 people online most of the time. All I have to say is wow. The graphics, amazing for when this gam... ",
    "gameID": 1,
    "author": "sCraftZeAlOt"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-02-17T00:00:00.000Z",
    "score": 9.0,
    "comments": "Unlike the majority of strategy games I\u0027ve played, Starcraft has an endearing and wonderful storyline...\nThis is such an incredibly entertaining game that I really don\u0027t know where to start. Unlike the majority of strategy games I\u0027ve played, Starcraft has an endearing and wonderful storyline; the game features some truly o... ",
    "gameID": 1,
    "author": "suzabbe"
  },
  {
    "helpfulCount": 18,
    "helpfulScore": 7,
    "date": "2005-02-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best game ever\nBlizzard after releasing Warcraft II and Diablo II came out with a new RTS. Very similar to Warcraft, Starcraft was amazing with the best gameplay and stunning graphics. Warcraft and Warcraft II had a choice of being 2 r... ",
    "gameID": 1,
    "author": "chAzN93"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 4,
    "date": "2005-02-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best expansion ever. A must buy.\nBlizzard came out with Starcraft, one of the most successful games and my personal favorite. Broodwar the expansion to the game of the year comes out with new features to the game. They bring in 2 units to each race (Ter... ",
    "gameID": 1,
    "author": "chAzN93"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2005-02-20T00:00:00.000Z",
    "score": 9.7,
    "comments": "This is a game that has every need in a game of it\u0027s genre. In it\u0027s genre this game would be considered perfect.\nThis is one of the best expansion packs I have ever seen added to any game. Brood War offers many new maps, levels, and men. If this game had come out later in date, I would have to say it would be a perfect 10. I do ... ",
    "gameID": 1,
    "author": "The_Only_Spitz"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-02-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Strategy Games do not, and can not get much better than this!\nThere\u0027s really not much to say about Brood War. It is probably the Greatest RTS game ever. WIth it\u0027s incredible single player and even better multiplayer one might think this game is great. THat\u0027s not including the campa... ",
    "gameID": 1,
    "author": "theheavydrinker"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-02-25T00:00:00.000Z",
    "score": 9.5,
    "comments": "best rts ever!\ngameplay: i say that starcraft\u0027s gameplay is perfect. even with all the bugs. the game has 3 races to use... that means people get good at it easy. And the way you play fastest is all about cordination and skill. 10 ... ",
    "gameID": 1,
    "author": "KenTa_613"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2005-03-13T00:00:00.000Z",
    "score": 8.9,
    "comments": "After all these years Starcraft is still one of the best RTS games out there.\nSome games hold very special places in our hearts and Starcraft is one of them. It\u0027s gameplay is simply flawless with its amazing balance of the races. Its so fun with using the different styles of each race and units. ... ",
    "gameID": 1,
    "author": "dadafeig"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-03-15T00:00:00.000Z",
    "score": 9.8,
    "comments": "Best expansion pack to the best RTS ever! Must have!\nStarCraft is the best RTS, and this is the icing on the cake! Brood War adds a lot to StarCraft, while not changing it too much to hurt the experience! The expansion pack adds a whole new single player experience, whole ... ",
    "gameID": 1,
    "author": "xboxpimp18"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-03-15T00:00:00.000Z",
    "score": 9.8,
    "comments": "Best RTS EVER! Period.\nAlright, StarCraft is THE best RTS game ever made. Everything about it is perfect! The soundtrack is pretty good, while it does loop alot, the sound effects are AMAZING! All the voices for the characters are done well, a... ",
    "gameID": 1,
    "author": "xboxpimp18"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-03-18T00:00:00.000Z",
    "score": 9.5,
    "comments": "Starcraft isnt just a strategy game. Its a strategy game that all other RTS games should look up to. A great game indeed\nStarcraft is a great game, it is for the PC and in a RTS or a strategy game (thats what I call them). This game is an amazing accomplishment for Blizzard and will keep players playing well after they have beaten the main... ",
    "gameID": 1,
    "author": "andch17"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-03-20T00:00:00.000Z",
    "score": 9.9,
    "comments": "The defining game of the RTS genre!!!\nWhere do I begin when reviewing a game like this. Starcraft began as a successor to Blizzard\u0027s immensely popular Warcraft series. However, the original production of Starcraft looked clumsy and uninspired and was often j... ",
    "gameID": 1,
    "author": "awoeonip"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-04-13T00:00:00.000Z",
    "score": 9.9,
    "comments": "Everything an expansion should be\nExpansion packs for games are in many ways analogous to movie sequals. Every once in a while, there is one that can truely do justice to the original, but in most cases, they are sad, half-hearted, money-milking iteratio... ",
    "gameID": 1,
    "author": "awoeonip"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-04-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "The greatest game ever created, absolutely perfect. Play this game to become speechless in awe of the best game ever!!!!\nStarcraft: Brood War Years after the game is released I still get giddy when I go to play it. It is just, literally, the best game ever created. The gameplay is perfect, the tech aspects are fantastic, and the fun you ... ",
    "gameID": 1,
    "author": "mynameisdumb"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-04-22T00:00:00.000Z",
    "score": 9.9,
    "comments": "Have you ever played a game that was so addective, that no matter how hard you try you cant stop playing it?\nThere has only been 3 games in my entire life, that have kept my attention for longer then a year let alone 7 and StarCraft is one of them. Granted I dont play it as much now as I did back when it first came out, but it... ",
    "gameID": 1,
    "author": "plague32390"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-04-26T00:00:00.000Z",
    "score": 9.7,
    "comments": "Even today, in 2005, the game is still played.\nStarcraft will never die until starcraft 2 comes out. Who knows when that will ever happen though. I simply cannot wait for starcraft 2 though, damn. If you\u0027ve never played starcraft, you have to buy it. It will run ... ",
    "gameID": 1,
    "author": "SabotageClock"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-04-27T00:00:00.000Z",
    "score": 9.1,
    "comments": "StarCraft Online\nBest Online Game Takes Many Days/Months/Years To Master The Game Online I have been playing for 2 years and i am very good at the game it is realy fun custum match games dont build much skill so if u want to get good ju... ",
    "gameID": 1,
    "author": "Purpl3Haz3Masta"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 4,
    "date": "2005-04-30T00:00:00.000Z",
    "score": 9.5,
    "comments": "Quite possibly the best RTS game ever created!\nStarcraft is a game similar to Warcraft but takes place in space, but what really makes Starcraft different is that it\u0027s a game that has a unique feel to RTS games. Normally in RTS games you have different teams or sides... ",
    "gameID": 1,
    "author": "Devouring_One"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-05-07T00:00:00.000Z",
    "score": 9.3,
    "comments": "This expansion pack packs the same great gameplay as Starcraft 1 and adds a few more excellent features.\nStarcraft was probably one of the best games released in the 90\u0027s as far as PC games go. Now the expansion pack is released, Starcraft Brood War, it is pracitcally the exact same game as before but thats not pratically a... ",
    "gameID": 1,
    "author": "andch17"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-05-11T00:00:00.000Z",
    "score": 9.8,
    "comments": "An all time classic, another jewel in Blizzard\u0027s crown!\nMasterpiece is a word rarely bestowed upon games. Very few will ever receive such a rating, but the few that do are something special indeed. Starcraft is one these phenomenal games. Save Warcraft 3, I don\u0027t think the... ",
    "gameID": 1,
    "author": "043030"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-05-12T00:00:00.000Z",
    "score": 9.5,
    "comments": "From the first fiew games, you know this one is good.\nA while back my dad picked up a demo of a game called StarCraft made by the people that made my favorite game at the time, WarCraft 2. I was excited to try out the game and since we were out of town I had to resort to p... ",
    "gameID": 1,
    "author": "warcraftguy321"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-05-15T00:00:00.000Z",
    "score": 9.3,
    "comments": "Pixel hater? No problem.....well.....maybe....\nWhy am I such a fool? Why must I love this game so much. The answer only lies in myself. I don\u0027t know why I like this so much. Here is is 2005 with graphics like Half-Life 2. And I am loving this game so much. It is... ",
    "gameID": 1,
    "author": "AustinOnline"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-05-20T00:00:00.000Z",
    "score": 9.2,
    "comments": "Adds much depth and value to the original, don\u0027t miss Brood War!\nThe original Starcraft was a RTS masterpiece, ground-breaking and addictive. Brood War adds lots of content and value, improving nearly all aspects of Starcraft. Brood War has a new campaign for each species, with sev... ",
    "gameID": 1,
    "author": "043030"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-06-02T00:00:00.000Z",
    "score": 9.5,
    "comments": "Great RTS Game, Maybe the best out there, A must have in any PC games Collection\nStarcraft is a RTS game like AoE The difference is that here the battles take place all over the galaxy. You can choose from 3 different races in the game. The Terran, The Zerg and The Protoss. Each race has differ... ",
    "gameID": 1,
    "author": "Rage_Of_Crow"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-06-09T00:00:00.000Z",
    "score": 9.6,
    "comments": "Almost five years later...\nAnd I am still playing this game. It is one that seems to never get old for me with the online play. There are so many ways you can play this game. The game gives you option of 3 races, all with there own strengths and w... ",
    "gameID": 1,
    "author": "cougarwsu"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-06-26T00:00:00.000Z",
    "score": 9.4,
    "comments": "I won\u0027t forget this game.\nAnother game that show the power of Blizzard Entertainment. Well maked in all the aspect, this game is gonna give you a lot of hour of play. This game have been a big part of my childhood and I will never forget this gam... ",
    "gameID": 1,
    "author": "Fascolik"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-07-13T00:00:00.000Z",
    "score": 9.5,
    "comments": "Benchmark for the RTS genre.\nStarcraft on pc is the best example of an RTS period. Ever since it released people have been playing on battle.net its great multiplayer set up. The graphics were good when it came out but look a lot out-dated. Starcraf... ",
    "gameID": 1,
    "author": "Nunamaker"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-07-31T00:00:00.000Z",
    "score": 9.6,
    "comments": "Still the best!\nSome people may think that this review is crazy... not exactly. Graphics 9/10 You have to realize that this is a real time strategy game not World of Warcraft. It has great graphics for any game. The main reason i... ",
    "gameID": 1,
    "author": "Sirian808"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 4,
    "date": "2005-09-12T00:00:00.000Z",
    "score": 8.0,
    "comments": "What else can be said about a great game this old\nStarcraft: Brood war is without a question the best real-time strategy there is. This game has the major components of what makes a rts standout from the rest of pack. So lets get down to what those are. The obvious s... ",
    "gameID": 1,
    "author": "i_like_toast"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-10-10T00:00:00.000Z",
    "score": 9.5,
    "comments": "Still the best RTS\nI have to say this is the most balanced rts I\u0027ve ever played. It has 3 completely different races that completely equal to each other. Remember Warcraft II and how the orcs and humans were basically the same race? Well n... ",
    "gameID": 1,
    "author": "TelNasu"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-10-12T00:00:00.000Z",
    "score": 9.0,
    "comments": "Brood War just makes SC x2 better\nBrood war adds some new features to oringal SC. There are now 4 races, the Zerg, Protss, Terrans, and the Counter Terrans. The counter terrans have some great new units like the Marine, Ghost Marine, Fire Marine, Water M... ",
    "gameID": 1,
    "author": "SaMuRaI_Slice"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-10-16T00:00:00.000Z",
    "score": 8.6,
    "comments": "A great game indeed\nStarcraft is one the best computer games you can possibly play. It\u0027s just another RTS game on the surface, but there are so many extras, playing it for only a few minutes is guarenteed to get you hooked. There are 3 p... ",
    "gameID": 1,
    "author": "Drake_Clawfang"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-10-19T00:00:00.000Z",
    "score": 9.6,
    "comments": "Still the best RTS to date....\nNothing really has come close. StarCraft, with its expansion Brood War, is the premiere RTS game -- and still is, 7 years after it was released. It is the bar by which all other RTS games are measured. Its short le... ",
    "gameID": 1,
    "author": "andystark"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-10-22T00:00:00.000Z",
    "score": 9.3,
    "comments": "The deepest strategy game of our time.\nStarcraft is the most amazing game ive ever played. Its great. The multiplayer is the highlight of the game. Starcraft utilizes battle net , blizzards form of gamespy, to hook up people from diffrent areas in battle. The... ",
    "gameID": 1,
    "author": "warrenton"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 0,
    "date": "2005-10-22T00:00:00.000Z",
    "score": 8.0,
    "comments": "starcraft is a secent game for somebody with a taste for repeated missions and okay graphics... overall good game to buy\nStarcraft is a very simpl3e gasme but you still have to have common sense.. missions get a bit dreary at times and get a little hard to do and control from certain camera views, but if you are looking for a non performan... ",
    "gameID": 1,
    "author": "whynotdairy"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-10-23T00:00:00.000Z",
    "score": 9.8,
    "comments": "its the best rtc so far\nI have to say this is the most balanced rts I\u0027ve ever played. It has 3 completely different races that completely equal to each other. Remember Warcraft II and how the orcs and humans were basically the same race? Well n... ",
    "gameID": 1,
    "author": "kcv"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-10-26T00:00:00.000Z",
    "score": 9.1,
    "comments": "Starcraft is the best game out there when added with the expansion pack. It comes with hours of fun and great stratagy.\nStarcraft is the best game out there when added with the expansion pack. It comes with hours of fun and great stratagy. One of the best parts is the Campaign Editor program that comes with it. It makes the multiplayer g... ",
    "gameID": 1,
    "author": "JimmysFire"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-10-29T00:00:00.000Z",
    "score": 9.3,
    "comments": "One of my first games to buy, it has become an old-school favorite of mine.\nStarcraft is a very classy and well put together game. It has all of the elements of a good game (storyline, graphics, yadda yadda) Each race (Terran, Protoss, and Zerg) each has unique units that can counter balance eac... ",
    "gameID": 1,
    "author": "kevcompman"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-10-31T00:00:00.000Z",
    "score": 9.8,
    "comments": "Its as good as it gets\nKeeping in mind that this game was released in 1998 I have to say this game is the best Real Time Strategy game I’ve played. The graphics are good, and the sound is well chosen. But the game play on it is what makes a ... ",
    "gameID": 1,
    "author": "kroloth"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-10-31T00:00:00.000Z",
    "score": 9.6,
    "comments": "Amazing: A MUST for any strategy fan\nKeeping in mind that this game was released in 1998 I have to say this game is the best Real Time Strategy game I’ve played. The graphics are good, and the sound is well chosen. But the game play on it is what makes a ... ",
    "gameID": 1,
    "author": "kroloth"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2005-11-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "This Is One Of The Best Games For The PC I Have Ever Played! You Will See That It Is The Best If You Read On! So Read!!!\nStarcraft: Brood War Is One Of The Best Games For PC That I Have Ever Played! I Will Explain To You Why If You Read On. I Will First Tell You The Basics To The Game! Well, There Are 3 Different Races That You can Fight W... ",
    "gameID": 1,
    "author": "Vegeta010"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-11-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Fantastic, I realize this is an old game and...\nI know that anyone who hasn\u0027t got the game by now, probally knows what it is about, well to say the least this game is amazing. Replay Value: Through the roof, this game has the best replay value of any game I have eve... ",
    "gameID": 1,
    "author": "dodgethiss007"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-11-02T00:00:00.000Z",
    "score": 9.8,
    "comments": "The greatest stratagy game ever to be created!\nStarcraft is the best strategy game EVER! It has everything; good graphics, fantastic game play, great story line and mint characters. only problem is I can not think of any real problems with the game. It could be impro... ",
    "gameID": 1,
    "author": "19liam86"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-11-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "amazing...\nseriously does an expansion get any better? NOT ONLY does it add a few more characters but it adds a whole new campaign, how many games do that. But the campaign isnt the thing that brings it over the edge its the char... ",
    "gameID": 1,
    "author": "chaoscougar1"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-11-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "wow\nThis game is absolutely amazinf, the first game i ever bought and the last game i will ever sell (if ever). This game is unbelievable i have been playing it for 6 years and still havent gotten tired of it. The gameplay... ",
    "gameID": 1,
    "author": "chaoscougar1"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-11-05T00:00:00.000Z",
    "score": 9.9,
    "comments": "The best strategy game ever\nThe word masterpiece best describes this game, it is still a legend that lives and will continue to live. when star craft released, there weren\u0027t any strategy games close to star craft and even now it\u0027s hard to find stra... ",
    "gameID": 1,
    "author": "slickr"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-06T00:00:00.000Z",
    "score": 9.8,
    "comments": "A good game best i ever have played if you want hints continue\nOk i know some basic terran, prottos, zerg like the terran if you want good defence make binkers with guys with seige tanks there too and misslie turrents it will be a good defence the zergs zerglings are awsome when all... ",
    "gameID": 1,
    "author": "camerjoe"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-07T00:00:00.000Z",
    "score": 9.2,
    "comments": "Down right old-school.\nThis game is what got me started in gaming. Without it I do not think i would have gotten into the gaming world as I have now. It is a very simple game, with only three civilizations, and 2 resource types, you do not n... ",
    "gameID": 1,
    "author": "fougera"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2005-11-07T00:00:00.000Z",
    "score": 9.5,
    "comments": "Ah Starcraft. How do I love thee? Let me count the ways...\nI discovered Starcraft when I was but a pimple covered teenager. I had never seen anything like it, had never played a real-time strategy game, and I believe it was my first non-Mortal Kombat M-rated game. Even after all... ",
    "gameID": 1,
    "author": "magicianky"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-11-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "the most best blizzard game ever no stalls.\nThe gameplay is very good because you can creat and army attack retreat patrol build bases make maps,chage the units names vs alot of comps its a great game.and the graphics for its age thats preety old but still on the... ",
    "gameID": 1,
    "author": "darklink67"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-10T00:00:00.000Z",
    "score": 9.3,
    "comments": "Amazing game, must buy, an awsome expansion pack to add on to your starcraft origional.\nLets start things off with the new units in starcraft brood war Terran\u0027s new units are Medic, Valkyrie. Zerg is Lurker, Devour. Protoss Darktemplar, Dark Archon, and Corsair. An excellent expansion to add on starcraft... ",
    "gameID": 1,
    "author": "G_homes"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-11T00:00:00.000Z",
    "score": 8.4,
    "comments": "It\u0027s Still there amongst the favorites....why is that?\nOkay, this game is still on the pooter and it\u0027s not been removed yet... Well, its got a charm about it...the graphics are still good, the individual units have their own voices...you can build, upgrade get new stuff .... ",
    "gameID": 1,
    "author": "Invisiblejim"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-12T00:00:00.000Z",
    "score": 9.6,
    "comments": "This game is still the best stratedgy game I played for the history.\nSo far for all the stratedgy games that came out in 1999-2005, this is the best stratedgy game I played. The gameplay is very simple for beginners, you can play 3 different teams and each of those teams have specials. Th... ",
    "gameID": 1,
    "author": "00chaos8"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-14T00:00:00.000Z",
    "score": 9.4,
    "comments": "I played this game for many years and I\u0027ve never foudna game more addicting.\nStarcraft is the game that I can give the most credit for bringing me into the strategy game genre, or even computer games as a whole. The gameplay is immersive, well balanced, and extremely addictive. All three races ... ",
    "gameID": 1,
    "author": "Atelus_Broken"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-16T00:00:00.000Z",
    "score": 9.6,
    "comments": "Online not for beginners, but still A GREAT GAME!!!! BUY IT NOW!!!! ONLY TWENTY BUCKS!!!!!!\nI recently saw this game at a store bundled with the expansion \"Brood War\" for twenty us dollars and remembered that I spent like fifty bucks on them when they where released. By all means BUY THIS GAME! It is not only a... ",
    "gameID": 1,
    "author": "ZlayerX"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-11-17T00:00:00.000Z",
    "score": 9.3,
    "comments": "Command and Conquer was fun, Warcraft 2 was better. But this sh1t is for REAL!\nBlizzards first and only entry so far in this series. Still one of the most played RTS games. AMazing when you think about how flooded that genre of PC games in how well blizzard stands up to the competition. WC3 (which ... ",
    "gameID": 1,
    "author": "colinjennison"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "Fast action, Easy gameplay, Easy Multiplayer acess, Simple interface. AMAZING GAME!\nEven almost ten years later this game still stands the test of time. It has a simple yet sophisticated interface. Great balance between the races. Awsome graphics, EVEN NOW. good sounds. A great fanbase. And a fun single... ",
    "gameID": 1,
    "author": "J0nGalt"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-19T00:00:00.000Z",
    "score": 9.6,
    "comments": "Great life to it\nI\u0027ve owned this game for coming up on 8 years and I still try to get in a multiplayer game every week. It has an engrossing story, and though the replay value in single player may be a bit boring after a while, the multi... ",
    "gameID": 1,
    "author": "Ragman_basic"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Simply Revolutionary\nConsidering the time when it hit the game market, I would rather say it\u0027s even way ahead of many strategy games of today. It\u0027s very difficult to find appropriate adjectives for this one. It\u0027s almost perfect in every res... ",
    "gameID": 1,
    "author": "junaidasm"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-20T00:00:00.000Z",
    "score": 9.8,
    "comments": "This game is for people who love to conquer,win,or just meet new people on battle net\nStarcraft is a game based on three races,Terran,Zerg,and Protoss.They are all figthing for survival.Thats where regular one player comes in.You do all the missions and see which is the ultimate race.The real reason you s... ",
    "gameID": 1,
    "author": "sithlord300"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-21T00:00:00.000Z",
    "score": 9.6,
    "comments": "One of Blizzard\u0027s shining moments\nThis game was amazing for its time as a pc stategy game. The story mode was well worth the money it was kinda cheesy but it was long and gave you plenty of challenge. I played it at least 20 hours but being a bit ADD gav... ",
    "gameID": 1,
    "author": "Ds_Bloodlust"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-22T00:00:00.000Z",
    "score": 8.7,
    "comments": "The best game of its time.\nwhen i first bought this game i thought it would suck some major rear-end, boy was I wrong! this game was probibly the best game of its time. with 3 bifferent storys to follow it has that WOW effect like Halo2 has. the s... ",
    "gameID": 1,
    "author": "chimpool999"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-11-23T00:00:00.000Z",
    "score": 9.0,
    "comments": "Starcraft is most likely the greatest RTS games ever\nStarcraft is most likely the greatest RTS game I have ever played. It is better than Command and Conquer any day of the week . I was in love with Tiberian Sun and then i played Starcraft again and completley forgot ab... ",
    "gameID": 1,
    "author": "yoyomaster25"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is, by far, the single most Incredible game I\u0027ve ever played.\nFirst, I would like to state that this is my first review, and I must say I am very exctied about expressing my opinion. But aside from that Starcraft Brood Wars (SCBW) is a game that is beyond great, in my eyes, it\u0027s... ",
    "gameID": 1,
    "author": "incabobcrane"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 4,
    "date": "2005-11-25T00:00:00.000Z",
    "score": 9.3,
    "comments": "Starcraft: Broodwar is a sequel to the awesome original game, \"Starcraft\".\nIf you\u0027re looking for a real time strategy game with plenty of variety, this is your game. Starting off, Starcraft: Broodwar has been packed in with a whole new campaign for the three races: protoss, zerg, and terran. Ea... ",
    "gameID": 1,
    "author": "taiwanesealn"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-11-26T00:00:00.000Z",
    "score": 9.1,
    "comments": "Still play it today.\nCame out in 1998, still playing in 2005. Starcraft provides a space version of the Warcraft series that includes three races and three completely different sets of weapons, vehicles, and buildings. The single player mo... ",
    "gameID": 1,
    "author": "fenix1022"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2005-11-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best RTS game ever made. No talk about it...\nI must make a review now about the best RTS game how ever had come to our planet. I remember, I was 12 years old (now I\u0027m 20) I was with my mother, sister and her boyfriend and was on shopping. We walked into a videoshop... ",
    "gameID": 1,
    "author": "delete-zux2000"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-12-01T00:00:00.000Z",
    "score": 8.3,
    "comments": "Very good RTS\nThis was a cool RTS it only cost me five pounds for this and the exspansion. When i got it i wasnt exspecting much i was just exspecting another RTS.. But when i installed this and played it it was soooo awsome. At fi... ",
    "gameID": 1,
    "author": "Tron6691"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-03T00:00:00.000Z",
    "score": 9.6,
    "comments": "Starcraft - The Pinnacle of Strategy Gamming\nStarcraft has been around along time now, yet this game is still going strong in my collection. Infact it was my first pc game. I have been playing this since 2000 and i still cannot get enough of this game. While the gr... ",
    "gameID": 1,
    "author": "Masters1989"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-03T00:00:00.000Z",
    "score": 9.8,
    "comments": "Addictive, RTS perfection and art at its highest.\n(coming soon)(coming soon)(coming soon)(coming soon)(coming soon)(coming soon)(coming soon)(coming soon)(coming soon)(coming soon)(coming soon)(coming soon)(coming soon)(coming soon)(coming soon)(coming soon)(coming soon... ",
    "gameID": 1,
    "author": "yosevuk"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-12-04T00:00:00.000Z",
    "score": 9.0,
    "comments": "great game!!\nstarcraft is my favourite from blizzzard because its just so much fun,the graphics arent that good but the gameplay is so good you dont realize that the graphics arent good but the sound can get repitive but it sounds re... ",
    "gameID": 1,
    "author": "ryanzoso"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-04T00:00:00.000Z",
    "score": 9.2,
    "comments": "Great Great Great game a true rts classic\nhonestly one of the best rts\u0027 i have ever played graphics 4 its time r great you get 2 have the perfect amount of units,unlike warcraft great game every rts player should buy it you can get the first and the expansion pa... ",
    "gameID": 1,
    "author": "KumbackKid"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-08T00:00:00.000Z",
    "score": 9.8,
    "comments": "A great addition to any computer gamer\u0027s library. Online capabilities and new units make this game a step above the rest\nBlizzard Entertainment has really done it this time around. With the release of the Brood War Expansion pack, they have made a huge income. The Brood War Expansion introduces many new units, including the Medic (T... ",
    "gameID": 1,
    "author": "Untame_Zerg"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-09T00:00:00.000Z",
    "score": 9.3,
    "comments": "Amazing game- Real-time strategy makes Starcraft a great game to play.\nWith massive multiplayer capabilities, superb single-player missions, and a program which allows you to create your own maps and share them with other players, Starcraft is my all-time favorite PC game to date. The... ",
    "gameID": 1,
    "author": "Untame_Zerg"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2005-12-10T00:00:00.000Z",
    "score": 9.8,
    "comments": "RTS genre have now it´s own king\nBlizzard entertainment created Warcraft series back in 95 and they where superb and fun to play but many people asked themselves how would Blizzard continue to deliver more of RTS genre. When they announced Starcraft and... ",
    "gameID": 1,
    "author": "downloader_feni"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "Perfect.\nStarcraft: Brood War is THE best game I have ever played. It has kept me entertained for a very long time. The single player campaign is great, and the story line is not bad. However the real fun comes from Battle.Net, t... ",
    "gameID": 1,
    "author": "DrowningFish"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2005-12-18T00:00:00.000Z",
    "score": 8.1,
    "comments": "OK for an old game\nWhen i was little, i would allways used to watch my cousin play starcraftm and i wouls just thing it was SOOOO complicated, untill i hit anout 8 years old, and when i started playing, i started thinking that Zerg was to ... ",
    "gameID": 1,
    "author": "Aghost69"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-12-20T00:00:00.000Z",
    "score": 9.8,
    "comments": "excelent game !! very solid trama the three campaigns are fun and special one of the best RTS !\nexcelent game !! very solid trama the three campaigns are fun and special one of the best RTS ! La campaña de los humanos es intesamente adictiva desde la rápida identificación que uno tiene con Jim Raynor, el Mar... ",
    "gameID": 1,
    "author": "sebareyes"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "Pick a Race, build things attack your enemy, gather resources and fight! man this game Is just classic, It\u0027s worth it...\nStarCraft, I remember hating this game so much because I saw someone play it before at a party and when I notice how the screen moves fast and all I thought maybe I would get motion sickness so I tried my best to avoid t... ",
    "gameID": 1,
    "author": "LUBULA"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 2,
    "date": "2005-12-26T00:00:00.000Z",
    "score": 7.0,
    "comments": "What do you want? Yeah I\u0027m going...\nBlizzard attempts to please Starcraft fans and keep the game interesting with this release, but can be summed up as the introduction of a few new units and landscapes, nothing spectacular. The medic was a welcome relief ... ",
    "gameID": 1,
    "author": "differentiation"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 0,
    "date": "2005-12-26T00:00:00.000Z",
    "score": 7.8,
    "comments": "Warcraft in space.\nYes, that\u0027s not far from the truth. Orcs have taken on another form known as the Zerg or Protoss. This is what Blizzard does best, RTS. It was the rave in the late \u002790s, people where reading into this stuff and trying to... ",
    "gameID": 1,
    "author": "differentiation"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-26T00:00:00.000Z",
    "score": 8.4,
    "comments": "The RTS by excellence!\nA reference in the domain of gaming, StarCraft is written in our heart as THE RTS. Gameplay, story, multiplayer, stability... Graphics... (eurk) All is good, except the graphics. This game\u0027s not dead and it will not die ... ",
    "gameID": 1,
    "author": "Darthnaevus"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "Late nights, early mornings\nThis is one of my favorite games i have ever played, i was instantly hooked and mesmerised. Playing it countless hours at end, and i was not know to do that on one game. A thrilling in game experience with three unique r... ",
    "gameID": 1,
    "author": "EliteDForce"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-28T00:00:00.000Z",
    "score": 9.7,
    "comments": "The BEST RTS in our time\nEasy to play, easy to learn, fast paced, great strategies, simple gameplay, clear interface and great story. What else can I say? This game is just what RTS has to be: nothing bloated, nothing too complicated, just strai... ",
    "gameID": 1,
    "author": "SirMango"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "The ONLY game I have ever played so much as to burn out the C-D.\nThere are only a couple games I can count in quality that are better then this game, but none that can surpass the shear number of hours I put into this game. This was a huge addiction to me, as I am sure it was to many ... ",
    "gameID": 1,
    "author": "Assault_Wolf"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-03T00:00:00.000Z",
    "score": 9.8,
    "comments": "BEST GAME EVER!!!!!!\nI started playing Starcraft when I was only 7. Now, I\u0027m 14 and I still love the game. It\u0027s always a challenge. There are hardly any \u0027simple\u0027 missions and mostly, you are at your seat and you feel like you\u0027re really in th... ",
    "gameID": 1,
    "author": "Shadowcloud21"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-03T00:00:00.000Z",
    "score": 9.3,
    "comments": "Fun as heck until mastered\nThis game is great. good sound, gameplay, fun factor and price range. I used to love this game to death. Just for the online because i couldnt touch the single mode without any hacks or cheats. This games multiplayer des... ",
    "gameID": 1,
    "author": "kq167"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-06T00:00:00.000Z",
    "score": 8.6,
    "comments": "If you don\u0027t already own Starcraft your crazy. Go out right now and pick up a battle chest for $19.99.\nIf you don\u0027t already own Starcraft your crazy. Go out right now and pick up a battle chest for $19.99. Every aspect of this game is fun. From the campaign mode to the huge online play. Where this game really shines is on... ",
    "gameID": 1,
    "author": "Vornagar"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2006-01-07T00:00:00.000Z",
    "score": 9.8,
    "comments": "This game kicks major ass!\nAny fans of strategy games will love this game! The best thing about this game is that it is pretty old, and it will run on most computers, even the mac! For its time the graphics are great! Your troops actually listen ... ",
    "gameID": 1,
    "author": "Star67"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-08T00:00:00.000Z",
    "score": 9.6,
    "comments": "Great addition to possibly the best RTS of all time...\nI love Starcraft for this reason. It\u0027s a fast pace RTS unlike other RTS\u0027s where it takes forever to figure out what the hell u are doing. *In the original Starcraft, the game practically walked u through missions ther... ",
    "gameID": 1,
    "author": "Undead-Souls"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-01-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "I started playing it in 1997 or 1998 the day it hit the shelf. I\u0027m still playing it and it\u0027s 2006.\nNo game has kept me playing this long. This game has a descent plot and is loaded with missions to play through. Not that those matter but they are extra. The online experience is what it\u0027s all about. If I have a compute... ",
    "gameID": 1,
    "author": "twizler191"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-01-09T00:00:00.000Z",
    "score": 9.8,
    "comments": "Fun Fun Fun Fun\nas i already said on my other review... this add-on is even better.. better than the first.. same gameplay but more units.. still the same amazing game.. you can\u0027t never get tired of starcraft.. Gampleplay- As i alrea... ",
    "gameID": 1,
    "author": "leafs_ducks"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-01-09T00:00:00.000Z",
    "score": 9.8,
    "comments": "Best game ever made!!\nOMG.. all i have to say is this is the best game i have ever played and might be one of the best game ever made!!! The first time i played this game was at a friends house, after a while.. i got hooked to it.. amazing ga... ",
    "gameID": 1,
    "author": "leafs_ducks"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is one of the best stragity game.compare to battle for middle earth and age of empires 3 is nothing to starcraft!!!\nomfg this is one of the best game ever. the online game is free. unless u dont got internet. fuk this is one of the best game in the fuking world. dotn ever buy age of empires 3. fuking rippppp offffff that fuking cost u... ",
    "gameID": 1,
    "author": "brianthe12"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-01-15T00:00:00.000Z",
    "score": 9.1,
    "comments": "Wow what a great multiplayer campain i didn\u0027t like but the multiplayer is awsome go get it now for 20 dollars do it!!!!\nThe games is an old one but i still keep on playing it the multplayer is awsome with triggers and mods you can basicaly do anything you want with it. the graphics are out dated but its still a great game. didn\u0027t like ha... ",
    "gameID": 1,
    "author": "GameSnake89"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-01-17T00:00:00.000Z",
    "score": 9.8,
    "comments": "what keeps me coming back to this game isn\u0027t graphics, its the unique factions, and interesting story.\nthis is a cool game with decent graphics and sound but the real cool stuff is the sides you can play as. The terran are human (although they look like hicks from farms(haha), but dont get me wrong they are very advanc... ",
    "gameID": 1,
    "author": "hampton2003"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-19T00:00:00.000Z",
    "score": 8.7,
    "comments": "You cannot go wrong with this game...\nOkay, so some people might think just because this game came out in 1998, that does not mean it is not good. The graphics are still quite good, the sound are extrodinary... (wonder how they got all the sound effects for ... ",
    "gameID": 1,
    "author": "DragonKiller17"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-20T00:00:00.000Z",
    "score": 9.8,
    "comments": "The jarl of strategy.\nBefore Starcraft, only Age of Kings and Civilization held the mos mairovm as consuls to the strategy genre. Now comes a third- Starcraft. Most games in the genre were in the past epochs, games that were situated in the f... ",
    "gameID": 1,
    "author": "irulehexen"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-23T00:00:00.000Z",
    "score": 9.8,
    "comments": "Easily the best real-time strategy game ever created.\nThis game deserves every perfect it gets, but unfortunately with the little button criteria it won\u0027t get it from me. Starcraft has to be one of the easiest games to learn because Blizzard has always been great with t... ",
    "gameID": 1,
    "author": "Josh947312"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-23T00:00:00.000Z",
    "score": 9.7,
    "comments": "The jarl of its own citadel................\nGrotesque and chitinous behomeths galore hovering about the skies, beasts with carapace with their frames etched with blood- their eyes crimson and drunk in such stupor of greed and lust, of what such that of the darkest... ",
    "gameID": 1,
    "author": "irulehexen"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-01-26T00:00:00.000Z",
    "score": 9.6,
    "comments": "This is a great one!!!\nI love starcraft games... when I first played it I tought \"This game needs something\". When I bougth the Brood War expansion for the starcraft game I got amazed by the new contents. Not only does it include a whole bunc... ",
    "gameID": 1,
    "author": "Zurielovsko"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-27T00:00:00.000Z",
    "score": 9.4,
    "comments": "My very first game!\nThis game was my very first game that my friend\u0027s father bought me for my birth day. This game is what got me started on playing games. Starcraft is a solid game with lots of mods and multiplayer game types you can make ... ",
    "gameID": 1,
    "author": "Rentago"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-01-28T00:00:00.000Z",
    "score": 9.4,
    "comments": "Furiously paced futuristic RTS: a must own for C\u0026C or AOE fans\nGraphics: 10/10 Amazingly smooth textures, especially on the water. It has outdone EVERY game produced before it\u0027s release. There are animations for fighting, animations for unit production, etc... Sound: 10/10 It s... ",
    "gameID": 1,
    "author": "eternal_dragon0"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-28T00:00:00.000Z",
    "score": 9.4,
    "comments": "Best expansion ever made to a game.\nNew units, more areas, more insanity as the war goes on between the 3. This is a great expansion and its well worth playing. More badass character to play and much more deeper story line than the first but it still has t... ",
    "gameID": 1,
    "author": "Rentago"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2006-01-31T00:00:00.000Z",
    "score": 8.2,
    "comments": "its good but it would be better if you could see in all the dimensions\nvery good it should have were you can play against computers. the multy- player connections are very good. they should make it for a console. but themn again it would have more loading screens. i hope the xbox version w... ",
    "gameID": 1,
    "author": "ffflol"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-03T00:00:00.000Z",
    "score": 8.6,
    "comments": "Starcraft is one of the first RTS games to break the international barrier. This is why...\nGraphics: 9/10 You can\u0027t deny that at its release date, Starcraft had graphics which rivaled those of the best games. The movements are smooth, with only minor glitches which don\u0027t affect the flow of the game overtly m... ",
    "gameID": 1,
    "author": "eternal_dragon0"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-02-09T00:00:00.000Z",
    "score": 9.6,
    "comments": "Quite simply one of the best ever\nThe fact that the game is several years old and you\u0027ve likely junked your computer at least once since this game was released should tell you something. It stands the test of time and nowhere else will you find the c... ",
    "gameID": 1,
    "author": "nmalatestinic"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-02-09T00:00:00.000Z",
    "score": 9.3,
    "comments": "very nice!!!!!!!!!!!!!\nthis game is old, but its a new game for me. (considering that I don\u0027t usually play PC games) and i like it, its like crack. very addictive. once I got into the controls and the \"create, seek, and destroy\" method, It was... ",
    "gameID": 1,
    "author": "tigga24540"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-09T00:00:00.000Z",
    "score": 9.6,
    "comments": "What every sequel should aspire to.\nBlizzard\u0027s done what very few developers have been able to pull off - a sequel that\u0027s every bit as entertaining as the original and leaves you wanting more. Brood War is a great game - only there\u0027s not enough of it. ... ",
    "gameID": 1,
    "author": "nmalatestinic"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-02-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "8 years old RTS which still is the best 2D RTS in history!\nThis game is absolutely the best Real-Time Strategy ever made. There are still many people playing it online through Battle.net or offline - via LANs and completing the single player mode. I don\u0027t know, why it\u0027s so perfe... ",
    "gameID": 1,
    "author": "Dr4goNPL"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-02-10T00:00:00.000Z",
    "score": 9.4,
    "comments": "Often dubbed as Blizzard\u0027s \"other\" franchise, Starcraft has cemented its fate as one of the best games in RTS history.\nMany Warcraft II fans were reluctant to hold Starcraft in the same light as they did with Blizzard\u0027s other masterpiece franchise. Many believed the science-fiction and ultra-reality themes of Starcraft would mar the over... ",
    "gameID": 1,
    "author": "BWRocks"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-02-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Terran, Zerg, Protoss; the three kingdoms in space wars! get this game or else... best game ever made for your PC!!!!!!!\nStrategetic, smart, amazing, awesome, fun, cool, best, are just some of the words that describe this game. this game is a must need for your pc! it has awesome graphics, probably the best story line i\u0027ve ever heard and p... ",
    "gameID": 1,
    "author": "gamefreak10605"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-02-12T00:00:00.000Z",
    "score": 9.6,
    "comments": "Starcraft is easily the best RTS ever made. 8 yeats after it was realesed, it is still one of the best PC games, EVER!!!\nStarcraft is a great game. If you have ever played an RTS before, then SC was one of them. With three races to choose from, you have a lot of variey. There about 30+ units per race, and they are all inventive. The campai... ",
    "gameID": 1,
    "author": "NerokuTheMaster"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-02-15T00:00:00.000Z",
    "score": 9.2,
    "comments": "The Best game, no questons asked.\nThis is the best game in the world. This game....... IS THE BEST GAME EVER MADE IN HISTORY OF VIEDO GAMES IN THE HISTORY OF ITSELF. Starcraft changed my life. Starcraft got me stragiht As in my report cards XD. Really i... ",
    "gameID": 1,
    "author": "JINTHEAZN"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2006-02-18T00:00:00.000Z",
    "score": 9.6,
    "comments": "Definately something of a world-wide phenonemon.\nStarCraft is possibly the #1 PC game of all time, according to many loyalists. Those who arn\u0027t, still think that it is one of the best. Blizzard have created something of a masterpiece here. StarCraft, when it was first ... ",
    "gameID": 1,
    "author": "Ryle_Boy"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-18T00:00:00.000Z",
    "score": 9.2,
    "comments": "loved it and addicting\nthis was one of the best and most addicting games i,ve played in a while. not many stack up to it. not the best graphics but for the time it is assume. i loved it even if you play it over and over still fun has a high re... ",
    "gameID": 1,
    "author": "lowen999"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-18T00:00:00.000Z",
    "score": 9.2,
    "comments": "\"Couldn\u0027t stop putting it down!\"\nSome may say there\u0027s not enough of it but Brood War is a great game. All my friends who have tried Brood War and the all-time-classic \"Starcraft\" have been hooked from day 1. We are hoping that Blizzard will continue ... ",
    "gameID": 1,
    "author": "thomasdlooper"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-02-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "THE BEST COMPUTER GAME EVER PERIOD. THIS IS TRULY A MASTER PIECE WORTHY OF BEIGN CALLED STARCRAFT AND IT SAYS A LOT ABOU\nTHIS IS TRULY A MASTER PIECE WORTHY OF BEIGN CALLED STARCRAFT AND IT SAYS A LOT ABOUT THE QUALITY OF THE GAME WHEN 8 YEARS LATER PEOPLE ARE STILL CALLING IT THE BEST PC GAME EVER. EVEN THOUGH THERE HAS BEEN A GREAT ADVAN... ",
    "gameID": 1,
    "author": "sonypsp300"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2006-02-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "I beleive this game continues to hold the top stop for RTS superiority even to this day.\nFirst of all, I give much due respect to Blizzards other more senior RTS series, Warcraft, but after all, Starcraft was the last rendition of the traditional style RTS from blizzard before they went fully 3d with Warcraf... ",
    "gameID": 1,
    "author": "Spincut"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-20T00:00:00.000Z",
    "score": 9.8,
    "comments": "best rts back then it was anyway\nthis game lasted for like like a year and half this to me was the most addicting rts i have ever played the game featured 3 races and all had thier own look and feel to them whether it were the humans with morines the ze... ",
    "gameID": 1,
    "author": "elementkid177"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-20T00:00:00.000Z",
    "score": 9.4,
    "comments": "ALL Time Greatest Game!!!!!!!\nYo this is the best game ever created period. And its name is StarCraft.....This game has it all. The graphics are pretty good, well maybe not as good as the games that come up right now, but remember that this game was ... ",
    "gameID": 1,
    "author": "luis619"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-02-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "If I could give Starcraft: Brood War an 11. There are no words to describe this game\u0027s greatness, IMO best PC game ever.\nStarcraft: Brood War is probably the best PC game out, it has amazing graphics, excellent sound effects, wonderful voice acting, a flawless online server, and a very original and excellent single player campaign mode. ... ",
    "gameID": 1,
    "author": "fft_ramza"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-02-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "starcraft gets a shot in the arm, not necesarily by a full blown sequel, but by an expansion pack\nThis was pretty hefty for an expansion pack, with a significant amount of story as well as unit additions, making it feel closer to a sequel than an expansion. It definitely is a solid continuance of the Starcraft sto... ",
    "gameID": 1,
    "author": "Spincut"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-02-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best RTS ever invented, ive been playing this game forever ever since it was relesed in 1998. i have played it pret\nI have had the starcraft series ever since it was relesed in 1998. and i still love it, after almost 10 years its still fun, how? i dont know, blizzard is good at making there RTS\u0027s . Anyways Graphics: Graphics don... ",
    "gameID": 1,
    "author": "xyber04"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-22T00:00:00.000Z",
    "score": 9.6,
    "comments": "If you are a Starcraft or Real-Time Strategy fan, this game is for you!\nStarcraft: Brood War is great. It\u0027s old and very popular. Most impressive 2D Real-Time Strategy ever known. Brood War extends the story told in Starcraft, beginning with Protoss Dark Templars and ending with Infested Ker... ",
    "gameID": 1,
    "author": "Dr4goNPL"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-02-24T00:00:00.000Z",
    "score": 9.8,
    "comments": "I have been playing Starcraft for about 5 years now...\nI have been playing Starcraft for about 5 years now... and I love it still! The graphics arent too bad for todays games and the gameplay is amazing! Just like all the command and conquer games this game is the best of th... ",
    "gameID": 1,
    "author": "jesusismyhomie"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-02-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is highly addictive, it will make you cry when you leave it.\nThis game is simply the best RTS game ever made. If you are looking for game with excellent Muiltiplayer this is your game. This game is so balanced that it would be diffcult to built a Starcraft 2. Thats why the develop... ",
    "gameID": 1,
    "author": "StarcraftLegend"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "Great game that is worth buying!\nStar craft is an amazing stratergy game that is definatlly worth buying...well there are 3 teams you can choose from and they have their advantages and disadvantages. You can choose the Terren which are the humans and t... ",
    "gameID": 1,
    "author": "gamecubedave000"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-26T00:00:00.000Z",
    "score": 9.8,
    "comments": "Flawless.\nGameplay It has the rts genre down perfectly. The three races in the game are perfectly balanced. Story Good enough story. The intro cutscene is nice but it\u0027s a shame theres so few cutscenes. Graphics Con... ",
    "gameID": 1,
    "author": "Gobythebear"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-03-02T00:00:00.000Z",
    "score": 9.4,
    "comments": "Can I actually put anything in this tagline that hasn\u0027t been said 10,000 times already about Starcraft?\nI first played a demo of Starcraft on an old 486 back in 1998. Instantly, I was hooked as I played the 4 Terran missions available in the demo to death, at the agonizingly slow speed of the 486. Along with the rest of th... ",
    "gameID": 1,
    "author": "grasu"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2006-03-03T00:00:00.000Z",
    "score": 9.0,
    "comments": "Alpha and Omega\nThis game sparked a generation of RTS games, and it should be considered as a \"holy artifact\" of gaming. This gem of a computer game has, possibly, the best storyline, gameplay, not graphics (8 years old,people) but mos... ",
    "gameID": 1,
    "author": "chilihead7"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-03-06T00:00:00.000Z",
    "score": 9.5,
    "comments": "A Fun Old-Skool Game!! Cant Get Tired Of...\nGameplay: Melee was all i played in the begginning...was fun and became pretty good at it...but once i played UMS maps it just made me play SC even more...Made it More FUN Graphics: I think the graphics on this game a... ",
    "gameID": 1,
    "author": "LiLSNiPeY"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2006-03-07T00:00:00.000Z",
    "score": 9.8,
    "comments": "This is the best game i have ever played and i cant stop...ever!! well of course once starcraft ghost comes out in q2 06\nthis game cannot be beaton by Wow or anything like that this game is just too good!!! welll done blizzard on your greatest game to date and probably ever!! (hopefully Ghost will be amazing too) it is march 7 2006 and iam... ",
    "gameID": 1,
    "author": "0diablo0"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-03-09T00:00:00.000Z",
    "score": 9.4,
    "comments": "Best RTS Multiplayer in the World.\nStarcraft: Broodwar actually takes strategy. The more you practice at this one the better you become. The gameplay is smooth. You can set up a LAN with Broodwar and devote a summer to it\u0027s competetive gameplay. The gra... ",
    "gameID": 1,
    "author": "forthelight"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-03-10T00:00:00.000Z",
    "score": 8.9,
    "comments": "A tactical strategy war game which will leave the gamer drooling for more\nStarcraft is a beautifully designed war space game which creates a mood to the player making the game much more enjoyable. Extensive requirements for each different building make the game more challenging and more compet... ",
    "gameID": 1,
    "author": "HHH_The_Game00"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Just amazing. Get it as fast as you can. Even if it means searching on eBay!\nThis is game quite easy to get started playing. If you want to learn easily I suggest playing on Single Player. If you think you can take on anyone go on USAEast where all the good people are on. The sound is pretty good... ",
    "gameID": 1,
    "author": "simonguyen"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is great\nThis game is still a lot of fun even though it is old. Before Starcraft I had never played and RTS but now I can\u0027t get enough of this game. Right now the game is kind of hard to find but it\u0027s only 20 bucks so what are ... ",
    "gameID": 1,
    "author": "Bladerunner89"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-03-14T00:00:00.000Z",
    "score": 9.8,
    "comments": "Hell Yeah!!! This **** s gooooood!!!\nMan this game is really good...tough its quite hard, but a game whitout challenge is boring. I like the missions but a custom campaign is just so hard, I mean they killed me in like 5 min. Tough it is very old the gra... ",
    "gameID": 1,
    "author": "L0L0"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-03-17T00:00:00.000Z",
    "score": 9.8,
    "comments": "The best RTS ever.\nEverything that was said eight years ago is still true. You´re saying Warcraft 3? You´re crazy? It´s a good game but nowhere the level of this excelence! Why do you think Blizzard never made a sequel? Blizzard must alway... ",
    "gameID": 1,
    "author": "alvarinho"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2006-03-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "This seriously is as good as it gets. If you need one game this is it. Happiness in a round shiny thing with a hole.\nOh where to start. Get ready for the long haul for this one, cos its going to be a long one. Ok. Its 2666 (or something along those lines) and Earth has become vastly overpopulated. So whats the solution? Gather up al... ",
    "gameID": 1,
    "author": "moored41"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-19T00:00:00.000Z",
    "score": 9.3,
    "comments": "Good game but not as good as the first.\nThis is still a great game to get and play but as for me I would rather play the origanal Starcraft . Broodwar is not that different from Stracraft in the fact the only thing that is truly diefferent is that they added ... ",
    "gameID": 1,
    "author": "CrackpotGANJ"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-03-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best RTS ever!!!!!!!!!\nThis game is very addictive exspecially a great multi-player game that youll never want to stop playing even for how old of a game it is. The multi-player aspect of it is very very fun and not only that the campaings we... ",
    "gameID": 1,
    "author": "CrackpotGANJ"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-03-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "I did not know games could be that good for that age of the game\nwhen I first played this game I just wanted to play this game 24/7 because it was so good and the online part of the game made the game even better then the game with out onlinethe game has really good graphics for the ... ",
    "gameID": 1,
    "author": "Hen123"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-20T00:00:00.000Z",
    "score": 9.7,
    "comments": "Ahh Nothing like the smell of napalmed zurglings in the morning...\nScared... you better be Ready... be it or die A Really Big Gun... Mandatory Wheres Our Tanks... The 3 words you never ever wana hear That is a brief summary of the starcraft world, based on a universal conflict bet... ",
    "gameID": 1,
    "author": "Bluespike000"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-20T00:00:00.000Z",
    "score": 9.5,
    "comments": "For a game made in that was created before the year 2000, thumps up.\nThis is really one of the all time greats. The graphics, although not up to the standards of this day are really quite good. The single player campain for each race is quite interesting and keeps your interest. The thin... ",
    "gameID": 1,
    "author": "skumakum"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-03-20T00:00:00.000Z",
    "score": 9.1,
    "comments": "A timeless classic - a must have for any RTS fan.\nCompared to newer strategy games of today, Starcraft is dated in terms of graphics and music quality. However, Starcraft has managed to stick around longer than almost any game in the genre - so much that I can still wal... ",
    "gameID": 1,
    "author": "Myrrinth"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-03-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Everything was said on StarCraft, and even after so many years, I still surprise myself playing this game!!\nStarCraft is a classic, everybody knows that, but I have to add my comments on this game. This game was actually the first one that I played. This game is well balance, easy to get comfortable with and so nice looking ... ",
    "gameID": 1,
    "author": "nixc747er"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Alive And Still Kicking!\nThis game has been out since 98\u0027 if Im correct, and there is still a big community around this game. The best thing is online! One of the best online games ever. There is so much you can do online with people making new ... ",
    "gameID": 1,
    "author": "slipknot-maggot"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "You want a game that never ages, well you\u0027ve come to the right place!!\nI\u0027ve been playing this game from day one and let me tell you something I\u0027ve lost count of how many times I finished it so long ago, but hey, who\u0027s counting. Its fantastic, no other RTS has its versatility, its balance b... ",
    "gameID": 1,
    "author": "Strmcrw"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-21T00:00:00.000Z",
    "score": 9.7,
    "comments": "Welcome to Battle.net!!\nHoo-boy. All those long and delightful hours in computer club back in school were graced predominantly by this wonderful game. After being hooked with my buddies on Warcraft II for so long, Starcraft had a whole lotta\u0027... ",
    "gameID": 1,
    "author": "Kaiser634"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-21T00:00:00.000Z",
    "score": 9.1,
    "comments": "Quite possibly the best if not the best in RTS games ever...\nThis game is a marveled gem. Anyone who has had the pleasure of playing this great RTS game knows what i\u0027m talking about. I remember spending hours upon hours playing this with my friends and how much fun we had. This ga... ",
    "gameID": 1,
    "author": "bojangles454"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-03-21T00:00:00.000Z",
    "score": 9.4,
    "comments": "A must have expansion to a great game...\nEarlier in the year 1998 a astounding game came out in stores, and i was named starcraft. It was a hit. Later that year, this game came out, and obviously, this game was a hit also. With all three races using different b... ",
    "gameID": 1,
    "author": "DragonKiller17"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best Strategy Game ever!\nSimply amazing in every way. Nothing beats it. ALl i am doing is typing one hundred words so i can submit this review. If you have not played this game. You need to. It is the best strategy game of all time. Every strate... ",
    "gameID": 1,
    "author": "Blackstar_311"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of my all time favorites!\nStarcraft, and the BroodWar expansion is STILL the best RTS game around - it\u0027s getting hard to get hold of so don\u0027t hesitate if you see it. I was first introduced to the wonders of Starcraft when I played it round a mate... ",
    "gameID": 1,
    "author": "HugoFromBoss"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-03-22T00:00:00.000Z",
    "score": 9.8,
    "comments": "incredible, amazing, a master piece! as near to perfect as any game could hope to be!\nStarcraft, it\u0027s been 7 years since it was released (1998) but to me it\u0027s still the daddy of all rts games!! No other rts game offers the same madness, excitement and tension you get when playing starcraft. There are 3... ",
    "gameID": 1,
    "author": "leelee_rocks"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2006-03-23T00:00:00.000Z",
    "score": 9.2,
    "comments": "This impresive game will make you ask for even more action\nStarcraft is a fast action paced strategy game, in which takes place in a futuristic era. It combines a good storyline in which the characters fit in quite well, and more action than you can imagine. It includes three sp... ",
    "gameID": 1,
    "author": "killdread"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-25T00:00:00.000Z",
    "score": 9.7,
    "comments": "An excellent RTS!\nGreat graphics; sound effects; and game-play; some cool units; lot\u0027s \u0027o\u0027 upgrades; the races are cool and all are unique yet still balanced; outstanding video clips; great multi-player; great storyline; will run on low e... ",
    "gameID": 1,
    "author": "curtizio"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2006-03-26T00:00:00.000Z",
    "score": 9.5,
    "comments": "My all-time favorite PC / Strategy game!\nSon, I\u0027ve played me a lot of games. There are a few out there that I can continue to go back to and never seem to get tired of. Yes, this is one of those games. If you have never played StarCraft, just go ahead and b... ",
    "gameID": 1,
    "author": "fronttrigger2"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-03-26T00:00:00.000Z",
    "score": 9.3,
    "comments": "A great job by Blizzard Entertainment. A great game that even modern games need to compare to.\nStarCraft to me is a milestone of Electronic Entertainment. Like Total Annihilation it is like a pioneer of Real Time Strategy games. Blizzard introduces a complex story packed with action. Where you can play as 1 of ... ",
    "gameID": 1,
    "author": "GeneralGeorge"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-26T00:00:00.000Z",
    "score": 9.7,
    "comments": "Blizzard have done it again with incredible RTS full of action and without a doubt best story line written.\nremeber when i first saw starcraft on the shelve of some pc store back in 2000 lying there waiting for me to take it home. Couple of days later I came and I bought it for 15$. The best 15$ dollars I have ever spend. S... ",
    "gameID": 1,
    "author": "-daniel-"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2006-03-27T00:00:00.000Z",
    "score": 8.8,
    "comments": "\"Give me something to shoot.\", That\u0027s right, they\u0027re back and ready for action...\nContinueing the story of the last StarCraft game, StarCraft: Brood War introduces a variety of new units. Clearly this is an improvement on the last game, the story is very interesting as well. Each side can be given a n... ",
    "gameID": 1,
    "author": "EchoSae"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 3,
    "date": "2006-03-27T00:00:00.000Z",
    "score": 8.8,
    "comments": "The hit RTS game everyone loves to date...\nStarCraft. The real time strategy game debuted in 1998 with its various races and different stories. It alows players to pick from three races, the Terran, Zerg, and Protoss. The Terran are a species of humen, you could ... ",
    "gameID": 1,
    "author": "EchoSae"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2006-03-27T00:00:00.000Z",
    "score": 8.7,
    "comments": "pretty nice, a few flaws\nThis is a good RTS, like most RTS\u0027s should be. Some missions you win, some you don\u0027t i think its just right. Getting to master the races, learing the units strengths/weaknesses, and setting up proper battle tactics can t... ",
    "gameID": 1,
    "author": "callie789456"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2006-03-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "Greatest Multiplayer!\nThis game I have been hooked on for a very long time. I would play this for years and never get bored of it with all of the custom maps that the players have made. Also, the map maker is incredibly simple even when you... ",
    "gameID": 1,
    "author": "Butters782"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2006-03-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game I just love it!!!\nI love this game and its one of my favorites that I own!The single player and multiplayer are both excellent!The create a campaign is fun and the units are cool looking and a large variety of them and they can get upgrad... ",
    "gameID": 1,
    "author": "gta4ya"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2006-03-31T00:00:00.000Z",
    "score": 9.4,
    "comments": "One of the best strategy games available for PC or any console.\nThis is a very fun game to play! I suggest you have high speed internet if you do get it though because the highlight is th eonlien multiplayer. Even after 7 years after it\u0027s release, Brood War is still a very popular on... ",
    "gameID": 1,
    "author": "ghangiskhan1"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-03-31T00:00:00.000Z",
    "score": 9.8,
    "comments": "brilliant expansion pack to the amazing starcraft if u get the original, u need this expansion!!\nI got this expansion when i bought starcraft so i\u0027v always played brood war when i\u0027v played starcraft but i have played the original and there are a few things brood war has added to the game which makes it even more bri... ",
    "gameID": 1,
    "author": "leelee_rocks"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-04-01T00:00:00.000Z",
    "score": 9.7,
    "comments": "simply Awesome.. Awesome.. Awesome.. And A milestone achieved by BLIZZARD in 20th century.....\nIt is my first game on PC... My experience was awsome... the gameplay.. the sound effects.. the storyline.. and the KILLING machines..... Though it wasn\u0027t 3-D, we have to play it on 2-D mode.... somehow, the Graphics ... ",
    "gameID": 1,
    "author": "mune3b"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2006-04-01T00:00:00.000Z",
    "score": 8.3,
    "comments": "Out of the box one of the best expansion for one of the best games ever made.\nI went into the store looking for something to buy that would provide me with a challenge and some degree of enjoyment. Buying Star Craft Brood War was an exercise in restraint because I broke every speed record known t... ",
    "gameID": 1,
    "author": "Advocate"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2006-04-01T00:00:00.000Z",
    "score": 8.0,
    "comments": "Hands down one of the most amazingly fun games ever made.\nI went into the store looking for something to buy that would provide me with a challenge and some degree of enjoyment. Buying Star Craft was an exercise in restraint because I broke every speed record known to man gett... ",
    "gameID": 1,
    "author": "Advocate"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-04-01T00:00:00.000Z",
    "score": 9.8,
    "comments": "ok singleplayer, but one one of the best multiplayer you can ever find!\nive played the single player but i thought it wasnt that good.but when learnt the game properly and i played it online....it was AWESOME!!!!!50 aircrafts shooting shooting 50 aircrafts is just awsome. the graphics was... ",
    "gameID": 1,
    "author": "yao1994"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-03T00:00:00.000Z",
    "score": 9.4,
    "comments": "you got good rts games you got great rts games you got superb rts games and you got starcraft!\nStarcraft is easily one of the best rts games ever made. Starcraft has everything a good rts game needs. Engaging and exiting single-player. Some very good mp. Three unique races to play. Good graphics (at least for i... ",
    "gameID": 1,
    "author": "nielz_nl"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2006-04-04T00:00:00.000Z",
    "score": 9.3,
    "comments": "Damn the burrowing Zerg!\nYour favorite races are back. The Zerg, Terran, and Protoss are back with new stories that interlock and have twists, turns, and surprises. In addition to updated stories, there are new playable heroes, units, building... ",
    "gameID": 1,
    "author": "fenix1022"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2006-04-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "the best expansion ever to see the daylight\nStarcraft is huge game, only weeks after it´s release it got a lot of feedback of what Blizzard could improve on and it wen on and on. Now the game is getting the expansion pack and it offers a lot for you. The story ... ",
    "gameID": 1,
    "author": "downloader_feni"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-06T00:00:00.000Z",
    "score": 9.3,
    "comments": "First game to get me hooked to RTS\u0027s!! It\u0027s great!\nThis game is like a nice training tool for beginner RTS players. It gives the basics on how each building can upgrade to produce better unit\u0027s. How to maneuvers., etc. The game is definitely easy to play. Yes it is ... ",
    "gameID": 1,
    "author": "wizoforb"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-08T00:00:00.000Z",
    "score": 9.0,
    "comments": "Best strategy game ever!!!!!!!!!!!\nStarcraft is one of the best stategy games i\u0027ve have ever seen in my years. You just can\u0027t stop playing it, from any point of view whether it\u0027s Protoss, Zerg, or the Terrans it is just amazing. I really enjoy t... ",
    "gameID": 1,
    "author": "JI1345"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-04-09T00:00:00.000Z",
    "score": 9.8,
    "comments": "You dont know stretegy games till you played Starcraft and Brood War. Also, my favorite game\nThe best game i have ever played in my life, and well deserved Walk of Game. Forces on the three teams very equal, although very old game, i still play it, even more than Warc 3. No wonder millions in Korea play it. I wo... ",
    "gameID": 1,
    "author": "jebusrocks"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-04-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Wow, if you want a classic and great game, no doubt this is it.\nThis game could quite possibly be the greatest game ever made. It has absolutely everything needed to be a classic. A good story mode and an amazing multiplayer format, courtesy of Battle.net. This game has three cla... ",
    "gameID": 1,
    "author": "Kool_Mo_Dee1"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2006-04-12T00:00:00.000Z",
    "score": 9.8,
    "comments": "This is arguably the high point of the lifespan of blizzard, and it definetly deserves that title\nA game that is played even now, 8 years later, is one of those few games that really prove that graphics are not the dominating aspect in smart game development. Always a classic, Starcraft does not dissapoint Gamepla... ",
    "gameID": 1,
    "author": "Bahamut50"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2006-04-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "a fantastic expansion to an already fantastic game....things can only get better!\nWOW! this game is awesome, i loved sc even without BW but this adds a whole new strategy to the game. the main difference is the addition of several new units including the zereg lurker, able tyopo burrow itslef and sho... ",
    "gameID": 1,
    "author": "marriage0"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-04-14T00:00:00.000Z",
    "score": 9.4,
    "comments": "A great expansion to a classic game.\nGOOD: Great additions; sounds remain good, especially voice acting; even more challenging AI; storyline and characters as memorable as original; engaging and addicting multiplayer BAD: Multiplayer overrun with \"money ma... ",
    "gameID": 1,
    "author": "bob_rulz"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2006-04-15T00:00:00.000Z",
    "score": 9.6,
    "comments": "Greatest.... RTS.... EVER!\nI have spent countless hours playing on BNET for this game, it is by far one of the best games of all time, if not the best game of all time. If Starcraft 2 comes out i will buy it without hesitation. Warcraft 3, althou... ",
    "gameID": 1,
    "author": "abbismonster"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-15T00:00:00.000Z",
    "score": 9.6,
    "comments": "BEST GAME EVER SINCE I GOT IT I HAVENT PLAY WITH MY CONSOLES\nThis game is the best game for pc you may think is stupid at the beginnig but you need to learn after that is youll like it. I remeber I didnt like it but I got online to play an they gave quick game i lost and save the... ",
    "gameID": 1,
    "author": "williegmc"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2006-04-15T00:00:00.000Z",
    "score": 9.8,
    "comments": "Sci-fi RTS games wouldn\u0027t be a blip on the map if it wasn\u0027t for Starcraft...\nStarcraft is a sci-fi RTS from Blizzard, the developer of Warcraft II and Diablo. This is another outstanding game that has a very active fanbase. The game features three playable races: Human, Zerg and Protoss. The Huma... ",
    "gameID": 1,
    "author": "BigC43"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 6,
    "date": "2006-04-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "the best rts in the whole world...wanna know why? read this to find out!\nfirst i must state that this game was made in 1998, if you have played it and compared it to current tgames you will see that the graphics arent cutting edge but for the time, they were awesome and in my opinion, still a... ",
    "gameID": 1,
    "author": "marriage0"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-04-16T00:00:00.000Z",
    "score": 9.6,
    "comments": "Best 10 RTS Ever Made...\nIf you have never played StarCraft, you must buy it because you are missing one of the best games you\u0027ll ever play in your life. Talking about the singleplayer; this game is divided in 3 episodes: Terran, Zerg, Protos... ",
    "gameID": 1,
    "author": "lord_renrow"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-04-19T00:00:00.000Z",
    "score": 9.6,
    "comments": "Brimming to the edge with screeching alien fun\nStarcraft is one of the best games in its class. Blizzard has done an amazing job on this game, and really deserves much praise. Starcraft is a very interesting game with a great story. The way that it was laid out wa... ",
    "gameID": 1,
    "author": "deactivated-5d28e130d39b1"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-04-19T00:00:00.000Z",
    "score": 9.8,
    "comments": "An amazing expansion to an amazing game.\nAn amazing addition to an already amazing game, Broodwar brings new units into the fray and allows for even more customization in the map editor. This game [starcraft] is truly one of the best games ever released for PC,... ",
    "gameID": 1,
    "author": "SyBerWoLff"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-04-19T00:00:00.000Z",
    "score": 9.6,
    "comments": "A Marvelous Masterpiece. The Missing Link of Gaming.\nStarcraft is truly one of the most amazing games ever created, After 8 years, it is still one of the most popular games I know of. The scenario is great, and the multiplayer is amazing. Graphics are amazing for the ti... ",
    "gameID": 1,
    "author": "SyBerWoLff"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2006-04-20T00:00:00.000Z",
    "score": 9.7,
    "comments": "More units + new storyline \u003d winning formula for Brood War.\nStarcraft was superb by itself. With the addition of Brood War, it\u0027s expansion, Starcraft became even better than it already was. A new campaign storyline brought more depth to the people and places you got to know in th... ",
    "gameID": 1,
    "author": "BigC43"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-04-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "si la version normal es excelente esta es espectacular.... el modo de histroia es bueno y la mejora\nen la madida de juegos de estragtegfia, cuando realizn una mejora de uniddades las expectatiovas cambian y eso ocurrio en brood wars, las mejoras realizadas fueron espectaculares, y las unidades, las batallas son de gran... ",
    "gameID": 1,
    "author": "lord_janus_ex"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-04-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "las versiones espaciales y futuristas nos hacen pensar o nos llevan a lugares disyantes y utopicos starcraft es lo mejor\nuna de las mejores versiones hasta ahora en juegos futuristas, como jugador esperaba mas versiones de este juego, lastima nunca aparecieron, pero si difrute mucho los niveles de juegos y los multiplayer en general este j... ",
    "gameID": 1,
    "author": "lord_janus_ex"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-04-21T00:00:00.000Z",
    "score": 9.7,
    "comments": "Scarcraft is one of the best games out there to date.\nStarcraft brood war is amazing makes you think really fast and makes you react to the envirement and what you do in it. There is three main groups in starcraft Terran, Zerg, and Protoss. You get to play all of them in th... ",
    "gameID": 1,
    "author": "firebird024"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-04-22T00:00:00.000Z",
    "score": 9.4,
    "comments": "The most addictive, classic, memorable game ever made.\nGOOD: Unforgettable storyline and characters; fantastic voice acting; three balanced races; engaging multiplayer; awesome array of sounds and music; challenging AI BAD: Game mechanics getting outdated; multiplayer overr... ",
    "gameID": 1,
    "author": "bob_rulz"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-04-26T00:00:00.000Z",
    "score": 9.7,
    "comments": "OMG!\nThis is one of the greatest RTS-games in the world. It\u0027s a very difficult game with a lot of challenges. Grafik: very nice work \u003d) 10 Sound: Good voice characters and music you would like to listen to over and over ag... ",
    "gameID": 1,
    "author": "9JMR1"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-04-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the greatest games of all time...\nI\u0027ve played every single one of Blizzard\u0027s games. I threw most of them in the basement when I first played Starcraft about 4 years ago. I\u0027ve had a Battle.net account for 2 years now, and I can\u0027t stop playing!!! Even thou... ",
    "gameID": 1,
    "author": "Artanis666"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-28T00:00:00.000Z",
    "score": 9.8,
    "comments": "This is one of the best games ever created. A classic! Es uno de los mejores juegos de la historia. Un clasico!\nStarcraft have the most amazing storyboard of all the games I ever played. Is so imaginative and, at the same time, so realistic, that makes you think if the things are gonna be that way in the future of mankind. The bat... ",
    "gameID": 1,
    "author": "jacrx7"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-04-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "nothing better than this.\nThis is the greatest game ever all of its gameplay is fun if u like blizzard games than this is for you.I like this more than warcraft more.it lives up to its award greatest game ever by gamespot and thats very impressiv... ",
    "gameID": 1,
    "author": "KNives89111"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-05-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Why do you say it\u0027s good? It\u0027s not good, it\u0027s great, no superb, no abysmal, I mean perfect!\nThis game is one of the best game I have ever played. It has one of the good graphics, the gameplay is perfec, I also love how there a ghost, I havn\u0027t played this game that much, but still it is one of the best game I pl... ",
    "gameID": 1,
    "author": "dilan94"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-05-02T00:00:00.000Z",
    "score": 9.3,
    "comments": "this is an awsome game\nthis game is just too good just get it if u like rts.brood war improved over one of my favorite games. the feature i like the most is new units. i know its been many years since the game has come out but i just wanted to... ",
    "gameID": 1,
    "author": "rts_gamer"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2006-05-03T00:00:00.000Z",
    "score": 9.8,
    "comments": "Even to this day, it is considered the best RTS by seasoned players.\nStarcraft has quite an interesting story, with 3 different campaigns to play (not to mention another 3 in the expansion pack, Broodwar) With the races: Terran, a human-like race with very advanced mechanical technology. ... ",
    "gameID": 1,
    "author": "Migaru"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2006-05-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "Greatest strategy game ever made.\nThis game is the best strategy game ever made because of it\u0027s unique Battle.net feature which makes the game 10 times greater than the storyline. This game must be bought! The difficulty depends on how you play the game ... ",
    "gameID": 1,
    "author": "Pot_Smoky_Ninja"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-05-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "Starcraft forever!!!\nStarcraft est le meilleur jeu vidéo du type Tactique du réel temp (Real Time Strategy). J\u0027 ai joué au Starcraft dès que sa naissance en 1997 et je pense que je peux jouer au Starcraft jusqu\u0027 au moment où personne ne le ... ",
    "gameID": 1,
    "author": "Grueza"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-05-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "Following one of the best RTS games around how well does it stack up?\nCompared to newer strategy games of today, Starcraft is dated in terms of graphics and music quality. However, Starcraft has managed to stick around longer than almost any game in the genre - so much that I can still wal... ",
    "gameID": 1,
    "author": "AcydRaine"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-05-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best RTS games around\nIf you have never played StarCraft, you must buy it because you are missing one of the best games you\u0027ll ever play in your life. Talking about the singleplayer; this game is divided in 3 episodes: Terran, Zerg, Protos... ",
    "gameID": 1,
    "author": "AcydRaine"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-05-11T00:00:00.000Z",
    "score": 9.6,
    "comments": "Starcraft: Review of My All-Time Favorite Game\nStarcraft is my all-time favorite game, and it is still fun to play today. The game is fairly well balanced. So, it is possible for the better player to win regardless of which race they choose. What makes this game ... ",
    "gameID": 1,
    "author": "razzle100"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-05-11T00:00:00.000Z",
    "score": 9.7,
    "comments": "Expansion worthy of your money..\nBrood war is the expansion of Starcraft and it\u0027s definitely something you want to be picking up. It adds a couple of maps, new guys, and that\u0027s pretty much it. It might at first not sound like it\u0027s worth it but believe ... ",
    "gameID": 1,
    "author": "Wii26"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-05-11T00:00:00.000Z",
    "score": 9.6,
    "comments": "Highly Addictive Strategy Game...\nBlizzard is such a beast at making strategy games as you can see. With warcraft series being so successful and now their starcraft series, it\u0027s just incredible. Away from Blizzard and now focusing on Starcraft, starcraf... ",
    "gameID": 1,
    "author": "Wii26"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2006-05-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "OMG the only game people have enjoyd playing so much theyve died from it\nCOME ON what bad things can u say about a game that is so fun 5 people have died from it and its televised live on some tv channels. starcraft has almost become a way of life with dedicated gamers i am one 2 i dunno how ... ",
    "gameID": 1,
    "author": "deathstrike00"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-05-12T00:00:00.000Z",
    "score": 9.8,
    "comments": "Even years later, this game is still excellent.\nI can\u0027t count how many hours I played Starcraft and it\u0027s expansion pack Broodwar. But I can tell you, it\u0027s a lot and I don\u0027t consider it wasted time, it was just plain fun. Why ? : -3 perfectly balanced races, looki... ",
    "gameID": 1,
    "author": "Etherninty"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-05-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "Amazing\nJust simply amazing. One of if the not the best rts out there. I don\u0027t think I\u0027ve ever played something so well balanced and fun. Fun, incredible, amazing, nothing better for comp, greatest rts of all time, never seems... ",
    "gameID": 1,
    "author": "Joshlindsay"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-05-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "A game that set the standards for years\nYou have to look hard to find a game that has three completely different races so well balanced. Zerg; a genetic engineering failure created by an ancient race, the Zal Naga. Protoss; another race that were created by th... ",
    "gameID": 1,
    "author": "Jameslb85"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-05-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best games ever made.\nIm going to keep this review short and sweet. Okay maybe not, but here it go\u0027s. If you have never played Starcraft and even somewhat enjoy RTS titles. Go buy this game, NOW! I have been playing Starcraft since it cam... ",
    "gameID": 1,
    "author": "godmachine0603"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-05-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best games ever made. Set a high standard for all and the best part is FREE ONLINE\nStarcraft.. starcraft.. starcraft... who hasnt herd or played starcraft? any serious gamer has played it. The graphics are very good for its time the story line is excellent. the online play is amazing. you can make clan... ",
    "gameID": 1,
    "author": "unarmedmaster"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-05-17T00:00:00.000Z",
    "score": 9.6,
    "comments": "Can be played for years!\nWell.. I dont belive anyone is still reading reviews about this good old game... But if anyone should have plans about buying one of these \"Best Seller Editions\" for no money, i\u0027ll say: Go for it! .... I played Starc... ",
    "gameID": 1,
    "author": "Najikill"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-05-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "a great game thats loads of fun with lots of stuff that u dont get in normal rts games. starcraft is an amazing strategy\ni have owned starcraft ever scince it came out and then bought the expansion when thatt came out. and i still play up to thisss very moment. it might be old but it still out beats most rts games in its league. every thin... ",
    "gameID": 1,
    "author": "J-mE_16"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-05-24T00:00:00.000Z",
    "score": 9.4,
    "comments": "Warcraft in Space\nWarcraft in Space. That is how this game was described to me so many years ago. Did it disappoint? Did it win me over? Read on to find out. Graphics- Not the best, but definitely not the worst, I give it a all right s... ",
    "gameID": 1,
    "author": "mr_nyuckles"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-05-28T00:00:00.000Z",
    "score": 9.8,
    "comments": "One of the greatest Strategy games of all time.\nWhat can I say? After 8 years since it came out, people around the world still play it regularly. If you go on Battle.net at any time, there is bound to be somebody on playing a 1 on 1 game or an old-fashioned Use Map ... ",
    "gameID": 1,
    "author": "FrozenVirus"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-05-28T00:00:00.000Z",
    "score": 9.3,
    "comments": "Before I willed myself to play other games, this one was extremely addicting.\nThis is a very hard game to master. Yes, the basics are somewhat easy to learn, and you will probably beat the campaign with not much experience, but to make a different stragety based on your different situations and wi... ",
    "gameID": 1,
    "author": "Mark2099"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-06-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best strategy game ever made!\nthe game is so cool that when i play it a mac freezes! (Proof that macs freeze uo :P ) also it\u0027s vast amount of levels and units is astounding to boot when playing online people have so many game modes it is always new w... ",
    "gameID": 1,
    "author": "bigburito"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-06-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "In a nut shell: StarCraft is the best online game ever made.\nStarCraft is an RTS like no other. Everytime I bring up StarCraft I usualy meet a person who says something like \"StarCraft sucks, C\u0026C is much better.\" But everytime I hear that I harass that person until they have t... ",
    "gameID": 1,
    "author": "g3k0xp"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-06-04T00:00:00.000Z",
    "score": 9.3,
    "comments": "A quality, standard-setting RTS that, in my opinion, ranks as one of the best games ever.\nStarcraft was probably one of the very first games that i properly got into in my younger years. I just remember loving everything about it from day one: the units, the storyline, the great cutscenes, the funny character... ",
    "gameID": 1,
    "author": "hunty91"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-06-07T00:00:00.000Z",
    "score": 9.8,
    "comments": "The best Real-Time Strategy game in History of gaming!\nI think that it is an excelent game. Superb game play due to its equal races. No race has any sort of advantage over the other two. I never get bored playing it, especially with my friends. It\u0027s a good idea to start agai... ",
    "gameID": 1,
    "author": "Yohc_Smmit"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-06-07T00:00:00.000Z",
    "score": 9.5,
    "comments": "Go buy it, i dont care if you allready have it, its worth buying twice.\nBroodwars is a great game, it put 3 completely different fighting styles into one game and made them perfectly balanced. I have been playing Broodwars for at least 6-7 years now and I’m still loving it. Blizzard did a be... ",
    "gameID": 1,
    "author": "alenfishman"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-06-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "Starcraft is a first love\nStarcraft is a first love that every future strategy game will be compared with. The graphics from 1998 may not be as flashy as they once were, but Starcraft continues to produce amazing game play that is simply thr... ",
    "gameID": 1,
    "author": "julmer"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-06-17T00:00:00.000Z",
    "score": 8.9,
    "comments": "Finally, an expansion that actually EXPANDS on the original game! Who would\u0027ve thought to do that?\nNormally, I don\u0027t condone expansion packs, as they often add a few vital parts to a game that was so-so to begin with (making up for past errors), but Brood War doesn\u0027t work that way. Starcraft was an absolutely wild gam... ",
    "gameID": 1,
    "author": "deactivated-591314a8f41d2"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-06-19T00:00:00.000Z",
    "score": 9.8,
    "comments": "This game is the very foundation of All RTS and all successful RTS must have this games Mechanics at Heart.\nWhy am I Just writing a review for this game now? I haven\u0027t been able to stop playing this game since the day it came out. Like Crack for to any Strategy loving gamer this game set the bench mark and simply put that shou... ",
    "gameID": 1,
    "author": "Damain1113ACS"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-06-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Looking for the King of Fast Paced RTS? Look no more... You Found him!\nWhat to say about this game... Its just the best RTS game in history of all time.. 3 Races.. 3 Choices..3 ways to War The aciton is so fast paced, well done and just awesomely fun, that ive been playing this game s... ",
    "gameID": 1,
    "author": "Sw0rDMaN"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-06-20T00:00:00.000Z",
    "score": 9.8,
    "comments": "a genuine classic game this will always be there to play\nGet reaedy to play the game that preaty much is an old game that was way ahead of its days this sci-fi rts is the premium top games for pc in its age if this game hdnbe realesed i dont think rts games would be around sti... ",
    "gameID": 1,
    "author": "prichard745"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-06-25T00:00:00.000Z",
    "score": 9.8,
    "comments": "Awesome. just plain awesome. A nearly perfect RTS.\nThis is one of the best RTS games of it\u0027s time. The graphics and soundtrack are superb although the music can get repetitive if you get as addicted as i was. The campaign is long and presents a challenge that requires yo... ",
    "gameID": 1,
    "author": "leftyspal"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-06-26T00:00:00.000Z",
    "score": 9.5,
    "comments": "Best RTS game ever! This is not Warcraft in space!\nWhat can I say about Starcraft? It\u0027s the first PC game I bought that got me hooked on real time strategy games for years. Yes, it may seem strange to be writing a review for a game that is nearly a decade old, but I\u0027m at... ",
    "gameID": 1,
    "author": "jgon_9"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-06-27T00:00:00.000Z",
    "score": 9.8,
    "comments": "Now that\u0027s what I call a game! Something that pelases the eye and brain...\nNow that\u0027s what I call a game! Something that pelases the eye and brain... my golly, this creation has a potential to lure an enormous audience and certainly plow in much cash to the company who created it! Playing w... ",
    "gameID": 1,
    "author": "Science2000luke"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-06-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is can\u0027t be any better, because it is already good enought and it is one of my favorite PC games ever made.\nThis game is all good and very addictive. Most people will even spend the whole day playing this game. i only play like three hours a day. The game does not take long to learn and later on the game will become mad eas... ",
    "gameID": 1,
    "author": "blazingmp"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-07-04T00:00:00.000Z",
    "score": 9.8,
    "comments": "BUY IT NOW!!!!!!!!!!\nStarcraft is THE best sci-fi rpg in ever hell i still crack it out and play it every now and then its a must have game and if you don\u0027t own it and you like rts then you must buy it the graphics are good for its day and t... ",
    "gameID": 1,
    "author": "Destructort1st"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-07-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "If you don`t know what is addiction...play this game ! This is the best game ever, even Blizzard can`t do it again !\nSimply I can say abut this game only one word, ruler, revolutionary, legendary,one of a kind, addictive, it`s the hardest drug!! Actually this was more than a word, but I can say positive words day and night about it!! T... ",
    "gameID": 1,
    "author": "relset"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 1,
    "date": "2006-07-06T00:00:00.000Z",
    "score": 7.5,
    "comments": "When do we get a worthy sequel?\nFun, thats all i can say. not my type of game, i like RTS like Battle for middle-earth with armies and swords and horses. But still, played this on a friends comp, and I have to say, its a good game. I don\u0027t plan on ever... ",
    "gameID": 1,
    "author": "Robbie8912"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2006-07-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "Makes the Age of Empires games look lame.\nLet me take you back to when i first played this game.....It was a rainy afternoon and i was at my friend\u0027s house and he had just bought this at Game for about £10 and he was playing it...anyway we played until about 10 ... ",
    "gameID": 1,
    "author": "i_hate_rangers"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-12T00:00:00.000Z",
    "score": 9.8,
    "comments": "Ahhhhh yes. Starcraft!!!\nWhat can I say, other than this is just simply one of the best multi-player games for the PC. I have spent many years playing this game now, it never 100 percent gets old. It might get boring after the first two to thr... ",
    "gameID": 1,
    "author": "kniLLinkkniL"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-13T00:00:00.000Z",
    "score": 9.2,
    "comments": "Old game yet awsome\nI thought this game was freakin awsome. Free multyplayer score! The campaign was really really fun and the campaign editor and just really fun. But they could have expanted on types of soldiers and new creatures and new ... ",
    "gameID": 1,
    "author": "ennt1"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2006-07-13T00:00:00.000Z",
    "score": 9.2,
    "comments": "Awesome game, it\u0027s a great RTS.\nThis is another spanish review by me, since you have money to spend on Videogames, you should use that money for something more productive and take some spanish lessons, this is an awesome game anyway, i love it. Star... ",
    "gameID": 1,
    "author": "MaxCal"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-14T00:00:00.000Z",
    "score": 9.5,
    "comments": "This is one of those games that you just keep coming back to.\nThis game never really gets old because there is practically endless possibilities of games you can join or create. What I mean by that is, if you have the internet there are always people creating new games on Battle ne... ",
    "gameID": 1,
    "author": "Proud_Warrior"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-07-15T00:00:00.000Z",
    "score": 9.8,
    "comments": "YES...\nThis game is AMAZING, if you never tried Starcraft i feel sad for you. This is the first \"real-time\" statagy game i\u0027ve play, at first i tried it at a friends house and i had no clue what to do (and i was playing it onlin... ",
    "gameID": 1,
    "author": "gidthekid56"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-07-15T00:00:00.000Z",
    "score": 9.8,
    "comments": "I believe there is no such thing as a perfect game, but this came damn close!\nI had always heard great things about this game, but when i got it my expectations were greatly exceeded, the main reason being how completely different the 3 armies/races are, there isnt a single common unit to any army... ",
    "gameID": 1,
    "author": "Kebn"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2006-07-16T00:00:00.000Z",
    "score": 9.7,
    "comments": "This game is the most addictive game ever created\nFor any one reading this and hasn\u0027t played this game then you need to stop reading and just go and buy this game. This game is addictive because theres so much things to do and it never gets boring its allway fun to pla... ",
    "gameID": 1,
    "author": "krazyhouse2"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-07-18T00:00:00.000Z",
    "score": 9.6,
    "comments": "Quite possibly one of the best Strategy games out there even Age of Empires can\u0027t compete with the great story.\nQuite possibly one of the best Strategy games out there even Age of Empires can\u0027t compete with the great story. Although sometimes a little boring this is certainly one of the best games released for the PC. With fun... ",
    "gameID": 1,
    "author": "Gamingod2272"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-07-18T00:00:00.000Z",
    "score": 9.3,
    "comments": "Star Craft is one of the Best RTS EVER!\nFirst to start off star Craft has a very good story.All races are well balanced.Terran is good against protoss,protoss is good against zerg,and zerg is good against terrran.The game requires strategy.Multiplayer is amazi... ",
    "gameID": 1,
    "author": "Yahiko182"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-19T00:00:00.000Z",
    "score": 9.8,
    "comments": "Best Game Ever.\nStarcraft Brood War is the expansion to the RTS that tens of thousands still play to this day. The game is fairly old, dating back to the mid to late 90\u0027s. I have been playing this game for 5 years, and its like a drug. ... ",
    "gameID": 1,
    "author": "dino316"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-20T00:00:00.000Z",
    "score": 9.8,
    "comments": "This game is really hard to live without once you play it so if you play it then i am sure that you will want to buy it.\nOne of the best strategy games of all time me and my whole family agrees on that. One thing that makes this game fantastic is you are not just one race you can be one of three races at a time, terran zerg or protoss. T... ",
    "gameID": 1,
    "author": "ggamer25"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-22T00:00:00.000Z",
    "score": 9.3,
    "comments": "Starcraft Is One Of The Greatest Games To Ever Be Released To The Public. Nuff Said.\nStarcraft For PC. I first played a demo of Starcraft on an old 486 back in 1998. Instantly, I was hooked as I played the 4 Terran missions available in the demo to death, at the agonizingly slow speed of the 486. Alon... ",
    "gameID": 1,
    "author": "gta11"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-07-25T00:00:00.000Z",
    "score": 8.3,
    "comments": "Starcraft Review\nStarcraft is a very fun game for RTS fans. If you enjoyed Star Wars or Star Trek, Starcraft is a game to think about buying next. GAMEPLAY: Very fun and highly addictive. Many people will enjoy a game like this becaus... ",
    "gameID": 1,
    "author": "timbo0827"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-26T00:00:00.000Z",
    "score": 9.2,
    "comments": "simply wonderfull. a great expansion pack to starcraft.\nThis game is one of the greates rts series ever. Civilazation can eat their heart out. This game is simply amazing. Gameplay 10/10 The game is easy to play and learn. Also the Story is ver engaging with many plot twist... ",
    "gameID": 1,
    "author": "lilazn_boi"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-26T00:00:00.000Z",
    "score": 9.1,
    "comments": "Probably the best old school rts because of the amazing multiplayer.\nThis game is a rts which some people just dont like but if you play online new ideas pop up. Gameplay 9/10 The story is sorta engaging exspecially with the many plot twists. And there is 3 scenarios to play from which ... ",
    "gameID": 1,
    "author": "lilazn_boi"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-07-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "Keeps you asking for more. After all these years, I still enjoy playing.\nStarcraft: Brood War is a continuation of the original Starcraft. With the Overmind destroyed, Kerrigan is in control of the zerg. Both Terran and Protoss do what they can to stop the Zerg in their tracks. Each race... ",
    "gameID": 1,
    "author": "LeerRosh"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-30T00:00:00.000Z",
    "score": 9.1,
    "comments": "A Great game\nwhat makes this game great is battle.net. You can play use map setting games that are way different than melee and theres alot of those map makers. But some of the people arent newby friendly. Alot of strategy is needed... ",
    "gameID": 1,
    "author": "StephenHu"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 6,
    "date": "2006-08-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "All you could ask for a strategy game is here.\nThis was one of the first PC games I have played. I remember that I was 10 years old. I really didn\u0027t liked strategy games, until I played this one. This game changed all my concepts off strategy games, it was amazing, a... ",
    "gameID": 1,
    "author": "pepechidoone"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-08-01T00:00:00.000Z",
    "score": 9.1,
    "comments": "Rock solid real-time strategy\nStarcraft is arguably one of the best executed real-time strategy games to have ever been released. There are a variety of options, none of them too complex that they aren\u0027t accessible to first-timers and novice players.... ",
    "gameID": 1,
    "author": "deathtok"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-08-01T00:00:00.000Z",
    "score": 9.4,
    "comments": "one of the best pc games still to date.\nnow-a-days the only pc game people are playing is warcraft and world of warcraft. but people still dont recognize what was the first pc game that started it all. starcraft. although its an old game its very fun. the grap... ",
    "gameID": 1,
    "author": "puerto_nican"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-08-01T00:00:00.000Z",
    "score": 9.3,
    "comments": "The RTS by which all RTSs are now judged...\nFor those not aware of it yet, Starcraft is a Real-Time Strategy game where you must command your army of units against enemy forces to complete objectives (more often than not destroying your enemies). Starcraft is s... ",
    "gameID": 1,
    "author": "baelrrogg"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2006-08-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Perhaps the best expansion for any game ever made!\nThe good: Keeps Starcraft\u0027s awesomely fun gameplay, sweet graphics and sound effects, and introduces so much more, like new units, three new challenging campaigns, and three new environments. The bad: --- Starcraft... ",
    "gameID": 1,
    "author": "Goliath_unit"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-08-02T00:00:00.000Z",
    "score": 8.4,
    "comments": "Starcraft can be be frustrating, but it\u0027s fantastic atmosphere, good story and unimaginable depth make up for that.\nI guess it really doesn\u0027t matter what I say about Starcraft. It\u0027s a classic that many people still play, now, eight years after it\u0027s release, making it by far the game with the longest shelf time. It\u0027s name has become sy... ",
    "gameID": 1,
    "author": "Gabe_Laurence"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-08-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "Unbelievably Amazing.\nStarcraft is the kind of game that you need... Blizzard is infamous for making games that you have to play... and games that are so great, that they could easily be confused with certain illegal drugs. It\u0027s the kind of g... ",
    "gameID": 1,
    "author": "Franklinstein"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-08-04T00:00:00.000Z",
    "score": 9.4,
    "comments": "The greatest rts ever made and the most played rts online..\nThe good Gameplay- Starcraft is an rts by blizzard entertainment, First you pick 1 of 3 races. These races are. terrain, protoss, and zerg, Each race has different units . What ever the race you pick you start out min... ",
    "gameID": 1,
    "author": "JabbasChef"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2006-08-08T00:00:00.000Z",
    "score": 8.8,
    "comments": "easily the best RTS ever and still made, if you\u0027re into RTS or want a good story line, then starcraft is for you!\nEasily one of the most engaging games ever, I found starcraft to enthrall me from beginning to end. Regardless of what I played, it was great... In single player, you begin as terran, and move onto 2 other races, pro... ",
    "gameID": 1,
    "author": "surag198"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-08-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "StarCraft is the all time BEST game on the pc.\nStarCraft is the best game i haveever played. for 1998, it has pretty good graphics. sound is great. single player is the best EVER. Multiplayer is awsome. Long and replayable. Jimmy Raynor, Samir Duran, Kerrigan, Arta... ",
    "gameID": 1,
    "author": "DarthVader92"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-08-11T00:00:00.000Z",
    "score": 9.3,
    "comments": "A lot of RTS games can learn a thing or two from Starcraft.\nThree major games that brought me into the RTS world, Age of Empires, Warcraft, and Starcraft! Gameplay: Starcraft is different from most RTS\u0027s because the story is based into the future with three different races the... ",
    "gameID": 1,
    "author": "halofreak3487"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-08-13T00:00:00.000Z",
    "score": 9.3,
    "comments": "The greatest RTS game since C\u0026C\nStarcraft is one of Blizzard\u0027s greatest creation, probably for a long time. It\u0027s 2006, and people all over the world are still addicted to this 1998 game. Because this truly is a wonderful game, it has the depth and game... ",
    "gameID": 1,
    "author": "hub0"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-08-14T00:00:00.000Z",
    "score": 9.4,
    "comments": "A lot to offer, adding up to a well built game\nI picked up Starcraft: Brood War forr $4.99 pre-owned, perfect condition. I said to myslef the guy that turned this in...is an idiot... Gameplay: The gameplay is a basic RTS, that has a lot new features, New storyline... ",
    "gameID": 1,
    "author": "halofreak3487"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2006-08-14T00:00:00.000Z",
    "score": 9.8,
    "comments": "Best RTS.\nWhere do I start. Starcraft did things that some RTS have trouble doing today. Which is having everthing totally blanced.Also or it\u0027s time and even today the graphis beat all. I would even go as far to say that there wer... ",
    "gameID": 1,
    "author": "PhoenixGod17"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-08-18T00:00:00.000Z",
    "score": 9.3,
    "comments": "Exceptional Experience.\nNot everyone likes RTSs but they should try this one out, Starcraft is its name. Stacraft is a unique fast paced RTS from Blizzard. Its last RTS, Warcraft II, was indeed a already a great game. Now Blizzard makes an impr... ",
    "gameID": 1,
    "author": "auron_xp"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2006-08-21T00:00:00.000Z",
    "score": 9.3,
    "comments": "Blizzard. RTS. Sounds good to me.\nSome RTSs are are slow. Some are too fast. Some lack other things, like good graphics, plenty of options, and so on. I\u0027d like to refer to Goldie Locks. (Remember, this is completely my opinion, criticize me as you will) ... ",
    "gameID": 1,
    "author": "vatterott"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-08-24T00:00:00.000Z",
    "score": 9.6,
    "comments": "amazing\nThis game is the best thing to happen to real time strategy. For those who don\u0027t know the premise, you play as one of three races. The Terran are nomadic humans with powerful siege machines and different types of infan... ",
    "gameID": 1,
    "author": "joshff8"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-08-25T00:00:00.000Z",
    "score": 9.6,
    "comments": "If you don\u0027t have this game you have to get it.\nIt is a great game. You must get it. You can get it for 20 $ and get the expasion pack and get the gameguide! When this review was publised 20,000 gamespot users had this game! And you get multi player games and think ab... ",
    "gameID": 1,
    "author": "irunongames"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-08-30T00:00:00.000Z",
    "score": 9.5,
    "comments": "one of the funnest rts\u0027\nalthough the graphics are kinda out dated by now, its a no brainer this game isn\u0027t all about graphics. its about the fun. the single player campaign might last you about 10-14 hours or so, but the multiplayer, battlenet,... ",
    "gameID": 1,
    "author": "metroid_frek1"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-09-02T00:00:00.000Z",
    "score": 8.0,
    "comments": "not my favorite game,but it is a blizzard classic\ni think that my favorite game company is blizzard.their games are all fun classics that can\u0027t be beat.the same can be said for one of blizzards oldest classics,Starcraft.Starcraft is the story of 3 species,the human and ... ",
    "gameID": 1,
    "author": "liukang666"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-09-02T00:00:00.000Z",
    "score": 9.7,
    "comments": "Buy this game it doesnt cost much money anymore u wont be dissapointed and be patient on graphics its been long time\nThis game starcraft is very good RTS game and when it first came out i was into it like no other game back in 98. This game was first RTS game to introduce 3 sides which overall incrases gameplay big time. One problem wi... ",
    "gameID": 1,
    "author": "Makaveli111"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 0,
    "date": "2006-09-03T00:00:00.000Z",
    "score": 8.4,
    "comments": "an expansion to one of the best rts ganes EVER.\nif you havent read my starcraft review than i suggest you should because this is only of BroodWar expansion. when you get the expansion you think \"WOW THIS IS GREAT!\" after all you should get your healthy dose of star... ",
    "gameID": 1,
    "author": "HOMER_SIMPSON"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2006-09-03T00:00:00.000Z",
    "score": 8.4,
    "comments": "A great game including unique races and decent gameplay.\nA great RTS and one of the best games out there. you notice some RTSs have 6 races/allignments all the same and only different graphics. well starcraft\u0027s races are all unique with the zerg hatchery and spawning pool or z... ",
    "gameID": 1,
    "author": "HOMER_SIMPSON"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-09-11T00:00:00.000Z",
    "score": 9.1,
    "comments": "Great Online Play!! But once you play it alot, it kinda gets boring...\nOnce I got this game, I loved it! And once I got my online account I played every day, and night. One of the best games I\u0027ve ever played, and it\u0027s still a popular game, I recommend this online game. But the thing is that... ",
    "gameID": 1,
    "author": "Strider57"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-09-12T00:00:00.000Z",
    "score": 9.5,
    "comments": "I can\u0027t play many games on the PC, but this game rocks!\nI have a screwed up computer so no 3D games can play on it. Only old ones. But I do have the Starcraft series and they are some of the best games I\u0027ve played. If you have played Age of Empires of Empire Earth, you will e... ",
    "gameID": 1,
    "author": "calexriv"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-09-14T00:00:00.000Z",
    "score": 9.4,
    "comments": "I didn\u0027t think Starcraft could be bettered..I was wrong. Without doubt...STILL my favourite game of all time.\nI discovered this game about 6 years ago. As good as it was playing the single player campaign, the multiplayer made it simply (to this day) unsurpassable. I got into so much trouble with my girlfriend over this, I just ... ",
    "gameID": 1,
    "author": "dhutch"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2006-09-14T00:00:00.000Z",
    "score": 8.6,
    "comments": "Classic\nIf i could wipe my mind and play through a game again, it would probally be Starcraft. I nice control system, 3 races to choose from which are distinctlly different each time and the story line is a script of genius. ... ",
    "gameID": 1,
    "author": "Jokul"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-09-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "A good but hard game\nThe GRaphic\u0027s are exelent the game play is easy to learn but hard to master. And of course it is a awsom game. Do you know y. It was made by bizzard. This game is sweet. It has a lot of veriety. You will naver have 2 gam... ",
    "gameID": 1,
    "author": "Nethrentol"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-09-25T00:00:00.000Z",
    "score": 9.8,
    "comments": "Review after almost 8 years\nHow many games are you going to find on the shelf after 6 years? How many games will be reviewed after 8 years? not many. This is truely one of the best game of its kind of all time. Its definitly one of the most intrigi... ",
    "gameID": 1,
    "author": "donnyz89"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-09-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best game EVER!!\nWhere to start with starcraft.... I\u0027ll just start with WOW! Such an amazing game. My favorite game, too. The 3 races are VERY different yet balanced. The Terran are defense heavy, the Zerg are quick assault, and the prot... ",
    "gameID": 1,
    "author": "Evanhaines"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2006-10-02T00:00:00.000Z",
    "score": 8.9,
    "comments": "Straightforward, fast-paced strategy game that should appeal to any gamer.\nStarcraft is one of the the best RTS I have played ever, and I have plenty of experience playing various RTS games. I bought Starcraft reluctantly on a recommendation of a friend, but it has been one of my best investmen... ",
    "gameID": 1,
    "author": "megafeck"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 0,
    "date": "2006-10-08T00:00:00.000Z",
    "score": 7.0,
    "comments": "look over there the zerg are attacking\nThis was my first game on computer so it was heaps of fun I got this burnt off my friend that’s how it all began .This game would be the best for 1st time strategy game players it has only 3 races on better in it own way... ",
    "gameID": 1,
    "author": "bradjt9"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-10-08T00:00:00.000Z",
    "score": 9.4,
    "comments": "Easily one of the greatest RTS games known to man. It has a little bit of everything for everyone to enjoy.\nGameplay: This game is crafted perfectly with you in mind. You can easily manipulate the battlefield and take full control of your units. Use your “\u0026Uuml;ber” micro or just send your units in and lay waste to the oppo... ",
    "gameID": 1,
    "author": "Zennious"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-10-10T00:00:00.000Z",
    "score": 9.6,
    "comments": "Best rts of it\u0027s time\nStarcraft went above and beyond all rts games of the past. The story mode is captivating and as you can expect, it\u0027s huge success is online. Battle.net is one of the great online / matching systems out there for any ga... ",
    "gameID": 1,
    "author": "BigDizz"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-10-12T00:00:00.000Z",
    "score": 9.2,
    "comments": "Perhaps the greatest real-time strategy game ever made.\nStarcraft is a sci-fi real-time strategy game that takes place in our universe but many years in the future. The game has both single and multi-player modes. It also includes a map editor where fans can create their own ... ",
    "gameID": 1,
    "author": "James00715"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-10-14T00:00:00.000Z",
    "score": 8.8,
    "comments": "Nice game....\nIt\u0027s an Expansion Pack but it is still good Brood War is an appropriate title for the new expansion for Starcraft. You continue in the \u0026quot;StarCraft universe\u0026quot; as the three species, Terran, Zerg, and Protoss. As... ",
    "gameID": 1,
    "author": "Slayer_Sam"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 2,
    "date": "2006-10-14T00:00:00.000Z",
    "score": 7.7,
    "comments": "An enjoyable RTS from the makers of Warcraft.\nRePlayability factor is good. This is due to the 3 different races to choose between. While the units do balance out over scale, the visual differences and mobility of the units seem to betray that statement. This also c... ",
    "gameID": 1,
    "author": "fiveball"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-10-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best RTS ever\nAt the time of this game\u0027s release, it was easily the best RTS to have ever been made. A revolutionary story-line (somewhat rare for rts\u0027) in which 3 races are pitted against each other, a similar yet amazing gameplay en... ",
    "gameID": 1,
    "author": "psnr24"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-10-23T00:00:00.000Z",
    "score": 9.8,
    "comments": "Simply the best game ever.\nAfter years of playing this game, the moment of writing a review has come, and I want to thank with my words all this game made me enjoy, but it\u0027s not going to be easy. This is for me simply the best game ever, and th... ",
    "gameID": 1,
    "author": "danigozne"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-10-24T00:00:00.000Z",
    "score": 9.6,
    "comments": "game rules!! Im a big blizzard player, and this game is great some of the best multi player and great for lan partys!!\ngame rules!! Im a big blizzard player, and this game is great some of the best multi player and great for lan partys!! tho I am more of a Warcraft player, this is a great game. This is a sci fi game if you like sci f... ",
    "gameID": 1,
    "author": "treytakahashi"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-10-25T00:00:00.000Z",
    "score": 9.8,
    "comments": "If you say you like strategy games, and you haven\u0027t played Starcraft, you don\u0027t know what are you talking about.\nI remember the first time I saw this game. I was really addicted to dungeon keeper at that moment, and I went to a Computer store to play it, and then I saw a bunch of winged flying monsters (after I knew there were call... ",
    "gameID": 1,
    "author": "danigozne"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-10-28T00:00:00.000Z",
    "score": 9.0,
    "comments": "THE GREATEST STORYLINE EVERY TO BRACE STRATEGY GAMES ! BY FAR\nStarcraft is one of the many strategy games that you will come across in the stores. At first look, it would seem a same old game, same old galactic wars with stupid creatures and stuff [??]. That’s when u come home and ... ",
    "gameID": 1,
    "author": "invinciblesuman"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-11-17T00:00:00.000Z",
    "score": 8.3,
    "comments": "A total classic!\nThis game is a total classic. The game play is so much fun! The single player mode is progressively more and more challenging, and it sucks the player in. think that everyone that is in to strategy games should pick thi... ",
    "gameID": 1,
    "author": "Kruexx"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2006-11-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "Ahh Starcraft in its finest. This is a truly amazing game and i\u0027ll tell you why in this review.....\nStarcraft was one of the most addictive games, wait what am i saying? It still is one of the most addictive games! And brood war just makes the expereance more better with more units, a whole new story, new heros, more m... ",
    "gameID": 1,
    "author": "Taloskai"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-11-26T00:00:00.000Z",
    "score": 9.8,
    "comments": "The Best Game Ever Made.\nWhat can I say about Starcraft? The game is simply amazing, even today. Its 8 years old and I\u0027d still play it over any RTS of today. Why? Starcraft features 3 races; Terran, Zerg, and Protoss, all of which are PERFEC... ",
    "gameID": 1,
    "author": "AntiH3ro484"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2006-11-26T00:00:00.000Z",
    "score": 9.3,
    "comments": "This is a great expansion pack to what has to be one of the best RTS games ever made!\nI didn\u0027t really play the original Starcraft, since I didn\u0027t find out about this series until Brood War was already released. Therefore, I wouldnt know much about what things were like before the pack. But let\u0027s stick wit... ",
    "gameID": 1,
    "author": "SuperDumbGuy"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-11-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best PC game I\u0027ve ever played!\nThis game was released in 1998. I got it about two years after that. I still play it today, and so do thousands of people online on Battle.net so I think that says enough. Originally, my friend got this game and wanted t... ",
    "gameID": 1,
    "author": "livethemusiclif"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-11-29T00:00:00.000Z",
    "score": 8.8,
    "comments": "STARCRAFT - If you have never played a game in this genre, START HERE!\nIt\u0027s been so long since I played, but I still remember loving every miniute of it. I return to the game about once a year for a week or two just to get some kicks. It has serious replay value and it is a fun game to play... ",
    "gameID": 1,
    "author": "andrecastillo"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-12-12T00:00:00.000Z",
    "score": 8.8,
    "comments": "The singleplayer lacks depth but all is forgiven on Battle.net!\nThis game is a basic RTS at first sight and can be fun playing melee battles against your friends or the computer;however, this game truly shines when you play use map settings online. People have the ability to make the... ",
    "gameID": 1,
    "author": "PvtSlayer1"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-12-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "Simply: The best PC Game i have ever played, the biggest addiction i have ever had.\nI played this game when i was in my Early College Years, and i got such an addiction on it, everytime i got from school i got in front of the computer and started another campaign, beat them, eat and play another campaig... ",
    "gameID": 1,
    "author": "raulacho"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-12-14T00:00:00.000Z",
    "score": 9.8,
    "comments": "My favorite game ever made.\nMy title explains it all for me. This is the best game ever made as far as I am concerned. There is simply no game more addictive then this game right here. Blizard needs to stop messing around with Warcraft and start... ",
    "gameID": 1,
    "author": "Camper_On_Creat"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 2,
    "date": "2006-12-16T00:00:00.000Z",
    "score": 8.7,
    "comments": "Pretty good game\nthis game is really good except it is insuperior to the warcraft series no offense the gameplay is fun with the races n stuff but the chat is kinda bad and the custom games are pretty crummy but its still an overall good... ",
    "gameID": 1,
    "author": "drblood1"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-12-21T00:00:00.000Z",
    "score": 9.7,
    "comments": "one of the best RTS games of all time\nStarcraft is am awesome game, and Starcraft Vroodwar is an excellent expansion pack, you can either play the Story, and have 3 different story\u0027s to choose from just like the priginal Starcraft but this time the story\u0027s a... ",
    "gameID": 1,
    "author": "c_murr69"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-12-23T00:00:00.000Z",
    "score": 8.7,
    "comments": "starcraft is a brilliant game that has reasonable 2d graphics and pretty good gameplay.\nin starcraft there exist 3 species 2 of them being genetically altered by all-powerful beings believed to be extinct, these races are the protoss who\u0027s powerful \u0026quot;psionic\u0026quot; abilities make them unique, and the zer... ",
    "gameID": 1,
    "author": "killa_link"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2006-12-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "The very best single/multiplayer RTS ever\nOriginal StarCraft was one of the first real time strategy games I ever played along with Command and Conquer Tiberian Sun. Later I got the expansion for StarCraft Brood War and Firestorm for Command and Conquer. In a fe... ",
    "gameID": 1,
    "author": "Cigaras"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-12-28T00:00:00.000Z",
    "score": 9.8,
    "comments": "Not only the best RTS game,, but also the greatest game of all time.\nOf all games to come close to perfection, Starcraft and its expansion, Brood War, come the closest. Starcraft is an RTS game that is the spiritual sequel to Warcraft II. Building on its success, Starcraft has 3 very dive... ",
    "gameID": 1,
    "author": "chaosarcher07"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2006-12-31T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is quite possibly the best RTS ever. Hell RTS made today are always compared to it.\nStarCraft is all round great game. The races are perfectly balanced. The (considering the time it came out) graphics for its time are pretty good. The sounds are amazing. Its is Blizzard\u0027s best selling game ( though Wo... ",
    "gameID": 1,
    "author": "InvaderZiM196"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-01-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "A must have for every gamer. Best game on earth right now. Just a perfect game.\nYou may think im going kinda strong with \u0026quot;best game on earth\u0026quot; and \u0026quot;10/10\u0026quot;, but its very true. Literally flawless. The graphics and sound might be outdated, but this game was made in 1998. Back then... ",
    "gameID": 1,
    "author": "brood_aliance"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-01-05T00:00:00.000Z",
    "score": 9.3,
    "comments": "The only rts series worth playing in my opinion\ncivilization and command and conquer cannot touch this game. This game is the highest selling rts for a reason and is still played by more people than the newer rts releases. While other rts games attempt to cater toward... ",
    "gameID": 1,
    "author": "umbracascade"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-01-05T00:00:00.000Z",
    "score": 9.3,
    "comments": "This is definantly among the best games I\u0027ve ever seen.\nStarcraft is a game that still remains as a classic today and it\u0027s for a reason. It is perhaps the best game I have ever played. First of all it has a replayability rate that I have never experienced before. I easily put... ",
    "gameID": 1,
    "author": "Jistyr"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2007-01-13T00:00:00.000Z",
    "score": 9.4,
    "comments": "RTS usualy bore me.........this was the game that got me that got me into \u0027em.\nSo when i first got this game i starting playing and soon found myself adiicted to the never-old custom compstomps and extremly deep online multiplayer Gameplay 9: do you even half to ask the depth of the campaign mod... ",
    "gameID": 1,
    "author": "Gedddy_lee"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-01-13T00:00:00.000Z",
    "score": 9.6,
    "comments": "Amazing game.\nStarcraft was the king at its time. But all things that rise,fall one day. At the given moment Starcraft is dieing a slow and painful death. But thats not important right now,lets talk about what this game really is. Sta... ",
    "gameID": 1,
    "author": "Fixer38"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2007-01-14T00:00:00.000Z",
    "score": 8.9,
    "comments": "With all the cashing-in these days, why doeesn\u0027t Blizzard just throw a new coat of paint on this gem?\nAfter nearly a decade of on and off playing Starcraft still holds my interest. It just goes to show that gameplay is a lot more important than flashy graphics. It also goes to show that the RTS genre peaked a long time a... ",
    "gameID": 1,
    "author": "devilreyes"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 8,
    "date": "2007-01-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best game ever made, period, no exceptions.\nThis game is without a doubt the best game ever made for any system bar none. I have spent more time playing this game than I have playing any other 5 games combined and that is including the 300+ hours I have spent on ... ",
    "gameID": 1,
    "author": "matrixman313"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2007-01-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "Another great game that Blizzard has made.\nOnce again Blizzards multi player for its games are great. With the Starcraft editor, this game is almost as good as Warcraft 3/Frozen Throne. It\u0027s too bad Warcraft 2 isn\u0027t played that much anymore but Starcraft still li... ",
    "gameID": 1,
    "author": "Perilslayer"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2007-01-20T00:00:00.000Z",
    "score": 9.9,
    "comments": "One of the best games ever made. If you don\u0027t have it, get it now!\nBlizzard has demonstrated what great games they have made in the past 15 years. Starcraft is one of their best games. If not, ever. It\u0027s one of the best games ever made. If you don\u0027t have it, get it now. There are so m... ",
    "gameID": 1,
    "author": "Goliath_unit"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 2,
    "date": "2007-01-21T00:00:00.000Z",
    "score": 7.0,
    "comments": "Starcraft is one of the best games ever to hit the market. There is no doubt that Blizzard has done an excellent game.\nStarcraft is a real time strategy game, from Blizzard, the makers of Warcraft II, Diablo, and Diablo II. It features three unique races [Terran, Protoss, and Zerg] that are pitted together in an intergalactic war taking ... ",
    "gameID": 1,
    "author": "rodrigo07"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-02-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the many great games from developer Blizzard Entertainment.\nI first picked up Starcraft back in 1999 and proceeded to play it for obscene amounts of time on line. The game is very well balanced so that anything you build can be countered by something else. The three races are uni... ",
    "gameID": 1,
    "author": "kelderon56"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2007-02-08T00:00:00.000Z",
    "score": 9.7,
    "comments": "Possibly the greatest game of all time, definitely the greatest strategy game of all time.\nWho hasn\u0027t heard of Starcraft? Unless you don\u0027t like boats, or hate video games, you\u0027ve heard of Starcraft. What other video game series has retained such support over nearly ten years spawning merchandise and tv shows... ",
    "gameID": 1,
    "author": "WinWalter"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-02-27T00:00:00.000Z",
    "score": 9.7,
    "comments": "crazy crazy crazy\nthis game is awesome and i love it so much im playin it like 247 and it is riged, i like the details and the evolution whatever **** it is but is absoluelty craze i wud perfer this better than warcraft and diablo cus th... ",
    "gameID": 1,
    "author": "jason_hho"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-02-28T00:00:00.000Z",
    "score": 9.6,
    "comments": "StarCraft keeps getting better!\nPlainly, StarCraft is my favorite strategy game of all time, bar none. The Brood War expansion pack only enhances the original. Each species gets a few new units and new upgrades. Species are divided into three type... ",
    "gameID": 1,
    "author": "fronttrigger2"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2007-02-28T00:00:00.000Z",
    "score": 9.8,
    "comments": "The best RTS i have ever played, the Best RTS ever made.\nThis game is so good i still play it almost a decade after its release. In today\u0027s gaming world graphics are substituting content, replay value is shot to hell as plot becomes one sided and boring. The classics are hard ... ",
    "gameID": 1,
    "author": "Terry_Foxman"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-03-01T00:00:00.000Z",
    "score": 9.6,
    "comments": "the RTS old school! one of the best RTS game ever created in 1998 till now!\nthis game is classic. its pretty imazing how the graphics and the sound and the campaign are good in 1998. ive seen worst game then this and they were made like 2005 to 2006. my favorite race is the protos. they are t... ",
    "gameID": 1,
    "author": "Bloodnecron"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-03-06T00:00:00.000Z",
    "score": 9.7,
    "comments": "A good expansion pack to an already great game\nWhile the game starcraft is really good this expansion pack made it even better. This expansion pack extended the story and boy was it good. Gameplay wise it added new units to each of the 3 races. The CGI cutscenes look... ",
    "gameID": 1,
    "author": "cobrax80"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-03-06T00:00:00.000Z",
    "score": 9.9,
    "comments": "One of the best if not THE best RTS ever created.\nHow do we know this game is good? Because it\u0027s still popular around the world even though it was released so many years ago. While the game has 2d graphics they still look great. The game is full of nice effects and some... ",
    "gameID": 1,
    "author": "cobrax80"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-03-08T00:00:00.000Z",
    "score": 9.6,
    "comments": "After 7 long years without this game, I am back to enjoy it all again. OLD school graphics, who cares, this game owns.\nI played this while beginning college on my friend\u0027s pc. He was a computer guy and I had no idea what a graphics card was. That was then, this is now. I am an avid gamer now and enjoy high quality graphics and mostly RTS... ",
    "gameID": 1,
    "author": "wireman32"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2007-03-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "Like no other. Almost 10 years beeing the BEST RTS ever. Hard to finish it, easily to fall in love with it.\nMy first RTS, my favorite game, I\u0026acute;ve played it so many times that I can\u0026acute;t remember exactly... It\u0026acute;s easy to learn the buttons, the secuence, but it\u0026acute;s not to easy to finish this fantastic game, not ... ",
    "gameID": 1,
    "author": "Raptors_81"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-03-08T00:00:00.000Z",
    "score": 9.4,
    "comments": "One of the most thriving games i\u0027ve ever played... I needed the cheats to beat it... so good till today.\nStarcraft was the first strategy role playing game that fell into my hands. The very good moments of this game started since the beginning... the frist scene was spectacular... to see those creatures in a shady way.. cha... ",
    "gameID": 1,
    "author": "gonzcast"
  },
  {
    "helpfulCount": 14,
    "helpfulScore": 13,
    "date": "2007-03-13T00:00:00.000Z",
    "score": 9.4,
    "comments": "Starcraft is a glittering example of real time strategy gaming, and it should be experienced by absolutely everybody.\nI\u0027m sure everybody has heard of Starcraft - without a doubt one of the most influential PC games ever and one of the greatest examples of strategy-based gaming to this day. It\u0027s a game that has captivated thousands, mayb... ",
    "gameID": 1,
    "author": "stevenscott14"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2007-03-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "Without a doubt, the best RTS ever made.\nThis game set the new standard of RTSs. Even in modern games you will see elements that you will look at and say, \u0026quot;That\u0027s from Starcraft.\u0026quot; Starcraft is one of those games that is a must have for any gamer, Expe... ",
    "gameID": 1,
    "author": "doomsdaydave11"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-04-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Easily one of the best strategy games on PC, even 9 years later\n9 years ago, Blizzard was put on the map by the super-popular real-time strategy game Starcraft. Now, 9 years after release, it can still hold its own with the newer games. Starcraft\u0027s races form the backbone o... ",
    "gameID": 1,
    "author": "Ratchetrider34"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-04-04T00:00:00.000Z",
    "score": 9.5,
    "comments": "If Blizzard didn\u0027t put this game out there, I would still be playing my N64!\nStarcraft has to be the best RTS game of the 90\u0027s. It was because of this game that I got into computers and heavy into computer gameing. This says a lot for a game that has you build bases and attack non-stop a enemy,... ",
    "gameID": 1,
    "author": "merloslacker"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-04-04T00:00:00.000Z",
    "score": 9.5,
    "comments": "Despite its dated graphics, Starcraft is like a modernized version of chess, making it a must-have for RTS fans.\nStarcraft is one of the best-selling games of all-time, and there is good reason for that. The game is a real-time strategy game in the same vein as Command and Conquer or Supreme Commander. However, Starcraft has one of... ",
    "gameID": 1,
    "author": "Bozanimal"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-04-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best PC Game\nStarcraft is what strtegy really means. The best of all strateg games. IF this is still popular and good 9 years later u know that this game is unique. This is revolutionary and now remains a great classic. Warcraft can;... ",
    "gameID": 1,
    "author": "Talon124"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2007-04-12T00:00:00.000Z",
    "score": 9.2,
    "comments": "It was nine years ago Blizzard entertainment first released Starcraft upon the world. Like a ravenous Zerg, the game ra\nIt was nine years ago Blizzard entertainment first released Starcraft upon the world. Like a ravenous Zerg, the game rapidly swept the gaming community. (In fact, it is so popular, that a man in South Korea died of a h... ",
    "gameID": 1,
    "author": "amroe333"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 6,
    "date": "2007-04-14T00:00:00.000Z",
    "score": 9.8,
    "comments": "One of the best strategy games to ever come out on PC.\nIn all that it\u0027s worth, I consider StarCraft a classic among all strategy games. The game is great in almost every aspect, and after nearly 10 years, it\u0027s still played by lots of people worldwide. Like any BLIZZARD game,... ",
    "gameID": 1,
    "author": "CantTouchThis12"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2007-04-14T00:00:00.000Z",
    "score": 9.9,
    "comments": "OMG THIS GAME IS AWESOME!!!!\nYou don\u0027t have to be a RTS fan just to love this game, this game is just awesome. Even though it came out in 1998 it still had users still playing it. i can\u0027t say enough how much I love this game. I gurantee you once you... ",
    "gameID": 1,
    "author": "pro_gamer12345"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-04-18T00:00:00.000Z",
    "score": 9.3,
    "comments": "Three sides, one war, survival depends on your command.\nCinematics are the saving grace of this series. The single player storyline is gripping, shocking, numbing, and leaves you standing there like the soldier that knows the time has come to face the dawn or the dusk. The ... ",
    "gameID": 1,
    "author": "Elim10286"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2007-04-25T00:00:00.000Z",
    "score": 7.8,
    "comments": "Well one of the first RTS games I played along with Gettensberg. But there are other better RTS game out there now.\nGameplay: Anyways in Starcraft you start out in the campain you fight alien scum with the rednecks from Earth. Anyways there are three nations you can play as. The Terrans (the aforementioned rednecks) and two alien race... ",
    "gameID": 1,
    "author": "RedneckGamer87"
  },
  {
    "helpfulCount": 22,
    "helpfulScore": 4,
    "date": "2007-04-25T00:00:00.000Z",
    "score": 7.7,
    "comments": "Well one of the first RTS games I played along with Gettensberg. But there are other better RTS game out there now.\nGameplay: Anyways in Starcraft you start out in the campain you fight alien scum with the rednecks from Earth. Anyways there are three nations you can play as. The Terrans (the aforementioned rednecks) and two alien race... ",
    "gameID": 1,
    "author": "RedneckGamer87"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2007-05-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "If the mona lisa is a masterpiece then what do you think this game is? MASTERPIECE IS A UNDERSTATEMENT.\nI can write about this game for hours on end and it would not even come close to explaining the extreme depth of the strategy and gameplay. Starcraft is a national sport in South Korea because no other video game on this... ",
    "gameID": 1,
    "author": "GundamWeed"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-05-08T00:00:00.000Z",
    "score": 9.4,
    "comments": "It possesses all the wonderful things previously incorporated in the original Starcraft.\nGeneric two word review: Great Game It possesses all the wonderful things previously incorporated in the original Starcraft: -Singleplayer is not the best, but it is enough to teach you basic strategies and is a f... ",
    "gameID": 1,
    "author": "deadkat"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2007-05-09T00:00:00.000Z",
    "score": 9.7,
    "comments": "One of the best RTS ever.\nBlizzard have never dissapointed its fans, Warcraft and Diablo were a huge success and instant classics, Starcraft followed this sagas and guess what? just like the other two blizzard sagas starcraft was nearly perfectio... ",
    "gameID": 1,
    "author": "Darkdesires"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-05-16T00:00:00.000Z",
    "score": 9.2,
    "comments": "An immersive and unique RTS to add to the uninspired one out there\nStarcraft.Starcraft is one of the most well done real time strategy games i have played.First, the races, starcraft has only 3 races but each are highly refined in their units, style of play and their tech tree.There are... ",
    "gameID": 1,
    "author": "redfury0101"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-05-17T00:00:00.000Z",
    "score": 9.7,
    "comments": "peanut butter \u0026amp; chocolate, peanut butter \u0026amp; jelly, Harry \u0026amp; Loyde-all were made for each other, like me and st\nAs i sit here falling asleep while writing this review i consider wether i should practice my speech i have to give tomorrow as a final for the semester. it will count as 20% of my final grade. And yet...starcraft awaits... ",
    "gameID": 1,
    "author": "whiteninjaz88"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2007-05-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "When it comes to RTSs, this game owns all\nI\u0027m bored. What should we do? Play Starcraft of course! Ever since I was like seven years old I have played this game as if it could never be beaten. I always thought this game would never end since it is so addictive. ... ",
    "gameID": 1,
    "author": "Luwo0629"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 7,
    "date": "2007-05-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "10 years means nothing to this game!\nWith the announcement of Starcraft 2 I thought it would be time to review a game that I have loved and sometimes hated over the years. The graphics may not be as hyped as Supreme Commander but it has in my opinion the 3 ... ",
    "gameID": 1,
    "author": "TruGillies"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2007-05-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "THE BEST\nHow could I possible describe Starcraft? It is the best strategy game ever, the graphics were and still are awesome. The gameplay and the game strategy are really immersive, the atmosphere is great and the possibility yo... ",
    "gameID": 1,
    "author": "colorado20"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2007-05-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "starcraft is amazing\nstarcraft is one of the most amazing RTS\u0027s ever made. It is timeless and classic no1 has anytyhing bad to say. Plus it has free online. It is totally awsome you must play it before 2 comes out. The story line is also ama... ",
    "gameID": 1,
    "author": "hades0069"
  },
  {
    "helpfulCount": 17,
    "helpfulScore": 2,
    "date": "2007-05-26T00:00:00.000Z",
    "score": 8.6,
    "comments": "great game but....if its called a strategy game....online they should use STRATGETY\nthis is a great game...single play is challenging...ive only beaten the original without cheats....right now im on the 2nd campaign of terran on the last mission and its a bit hard...online.....theres no stragety everyon... ",
    "gameID": 1,
    "author": "S0mEGuY12"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-05-31T00:00:00.000Z",
    "score": 9.9,
    "comments": "One of the best games every invented\nThe best The best The best The best The best The best The best The best The best The best The best The best The best The best The best The best The best The best The best The best The best The best The best The best The ... ",
    "gameID": 1,
    "author": "HannahAngel"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 4,
    "date": "2007-05-31T00:00:00.000Z",
    "score": 9.6,
    "comments": "I\u0027M GONNA NUKE YOU TO NEXT WEEK ... OH WAIT HOW DO I USE NUKE\nStory: StarCraft takes place in the distant future. Human exiles fight for survival on the edge of the galaxy, and a unified Terran government has formed through espionage, deceit and military might. Their resources have... ",
    "gameID": 1,
    "author": "nutta27"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-06-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "Rating for StarCraft in 2007\nEveryone who has played this game has loved. I mean you get free internet battles and get to make your own maps and share it with people. After time has gone on games have been getting better with graphics sound and so... ",
    "gameID": 1,
    "author": "KyleStilkey"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-06-02T00:00:00.000Z",
    "score": 9.8,
    "comments": "if there is a game that made RTSs what they are today that game certanly is StarCraft.\nMore thatn 10 years ago StarCraft firs appeared and toke the (small and still young ) games comunity by surprise. Then years after you can still see televised game of it. Almost every game copied a bit of SC\u0027s succesful... ",
    "gameID": 1,
    "author": "redangelus"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-06-02T00:00:00.000Z",
    "score": 8.7,
    "comments": "This was good but not as good as the original\nThis game was really good but still I thought they kind of lost it in some parts but still is a really great game. Recommend playing especially Battle.Net REALLY FUN GAMES THAT PEOPLE MAKE like defense maps and bonds an... ",
    "gameID": 1,
    "author": "KyleStilkey"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2007-06-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best RTS ever created.\nStarcraft is pure fun, plain and simple. There\u0027s a huge variety of units, three races, and any number of ways to be win. The actual story mode is incredible, and is great for learning how to play. But, in my opinion, ... ",
    "gameID": 1,
    "author": "wizardmon5"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-06-06T00:00:00.000Z",
    "score": 9.7,
    "comments": "An Amazing Game\nGameplay: Play as 3 diffrent races and kill each other with all kinds of diffrent vehicles and guns and ships ... ",
    "gameID": 1,
    "author": "Star_Wars117"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-06-07T00:00:00.000Z",
    "score": 9.3,
    "comments": "A great follow up to the starcraft series\nUsually expansions to games don\u0027t add much content. Starcraft:Brood War is however, an exception to this. This new edition to the starcraft franchise adds many to the game. It adds new units for each race as well as a fr... ",
    "gameID": 1,
    "author": "redfury0101"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-06-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "Everything a game should be. So polished it puts all other RTS games, if not all games, to shame.\nStarcraft/Brood War is is one of those rare games where all the necessary ingredients have come together to create virtual perfection: the right idea of what a game like this needs (and doesn\u0027t need); the right people to... ",
    "gameID": 1,
    "author": "Banestyrelsen"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-06-09T00:00:00.000Z",
    "score": 9.2,
    "comments": "The balance is perfect.\nNo other game ever created has met the preciseness of this game. Its unbelievable when one thinks of the strategic possibilities of this game, its as if they are endless. Three races is all you need when the game is a ba... ",
    "gameID": 1,
    "author": "xXCol_SandersXx"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-06-10T00:00:00.000Z",
    "score": 9.2,
    "comments": "The Best Game, The Best Addon and everything you need to make it all the better.\nStarcraft is no doubt one of the best, if the not the best RTS game to date. Its greatness comes from superior balance with 3(thats an odd number) entirely diffrent races, with the only similarities being that there are ... ",
    "gameID": 1,
    "author": "tool_tip_missin"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-06-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is amazing and far ahead of its time...\nStarcraft is the champion of all real time strategies. What\u0027s better than having a based army and defending bases while scouting our for their bases and destroying them bit by bit, or the whole thing at once? Nothing is ... ",
    "gameID": 1,
    "author": "Coolinbny1"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2007-06-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Perfect game!The best strategy game!!\nPerfect game!The best strategy game!!!great multi-player!The Campaing is amazing! play StarCraft from 1998 until today!All games must buy this game and come to battlenet....The battlenet of this game has much more fun t... ",
    "gameID": 1,
    "author": "spirosway"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-06-13T00:00:00.000Z",
    "score": 9.7,
    "comments": "Best Classical Game That You can Never get bored of read on?\nStarcraft is a game that i still see sold in stores and ive owned this game for many years from now and i can say it was one of the best games of my childhood games. Its a bit like age of empires but alot diffrent and... ",
    "gameID": 1,
    "author": "Da_Bacon_master"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-06-16T00:00:00.000Z",
    "score": 9.5,
    "comments": "Pretty good\nI liked this game and I am excited for Starcraft II. I liked all the armies and their units, but my favorite has to be the Protoss. The Zerg were probably the only army I wasnt the best in. The singleplayer missions were... ",
    "gameID": 1,
    "author": "Meteor7"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-06-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "Starcraft is simply one of the best games ever made.\nThe Good: Great gameplay, funny and wonderful voice acting, great graphics (for its time), many humorous moments, story keeps you paying attention to the end. The Bad: Took almost a decade to spawn a sequel. Game... ",
    "gameID": 1,
    "author": "Ryo_Kensen"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2007-06-18T00:00:00.000Z",
    "score": 9.6,
    "comments": "Fast-paced multiplayer action you can never get bored of!\nAlright, in case you don\u0027t know what StarCraft is, it is a SciFi Real-Time Strategy game by Blizzard Entertainment, released in 1998, and is considered by many to be the best RTS game ever created. Players take control o... ",
    "gameID": 1,
    "author": "EE2lemmonhead"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-06-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "Still one of the best RTS games out there. I still play it, and its still fun.\nOne of the best RTS out there....STILL it will awalys be fun no matter what, I can play this game for hours and hours on end and still have fun no matter if its an old game i got it when it came out and still to date thi... ",
    "gameID": 1,
    "author": "immortaljester6"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-06-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "A game you\u0027d better play before it hits the history books.\nStarcraft was released in 1998 (2 years from which people in the 60\u0027s thought we would have robots \u0026amp; flying cars!!). Blizzard was famous for developing the game before starcraft called Warcraft. Warcraft was a huge s... ",
    "gameID": 1,
    "author": "934400"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-07-02T00:00:00.000Z",
    "score": 9.2,
    "comments": "I absolutly love this game. With a good plotline, superb gameplay, and easy to learn controls how can you not lov\nThis is my favorite game ever. I learned to play since i was really little and it was fun ever since. Sure graphics may be well... 2D and kind of blocky but thats not what matters. The characters are very realistic in a... ",
    "gameID": 1,
    "author": "Lycan_Tiger"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 1,
    "date": "2007-07-02T00:00:00.000Z",
    "score": 7.3,
    "comments": "Hardcore Starcraft fans will adore it, but Brood War proves to be too demanding for casual gamers.\nI\u0027m not a serious Blizzard or Starcraft fan, so well, though I like Starcraft very much, Brood War doesn\u0027t really suit my taste for an RTS fix. After tons of harrowing time spent on it, I find myself pitifully exhausted ... ",
    "gameID": 1,
    "author": "KingLim"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-07-02T00:00:00.000Z",
    "score": 9.2,
    "comments": "With a deep strategy that makes use of Warcraft II elements, Starcraft is an amazing achievement.\nAs a C\u0026amp;C fan, I see that Command \u0026amp; Conquer has met its match with Starcraft, also a sci-fi RTS, and it comes with a hefty amount of cinematics to beef up its value and reputation as one of the leading pioneers of... ",
    "gameID": 1,
    "author": "KingLim"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2007-07-05T00:00:00.000Z",
    "score": 9.6,
    "comments": "Starcraft is a space-based real-time strategy game that is top-notch from start to finish in both single and multiplayer\nAt first glance Starcraft appears to be a standard RTS (real-time strategy) game where the player builds up a technology tree and gathers resources in order to create new and more powerful units to use against their oppo... ",
    "gameID": 1,
    "author": "Bozanimal"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-07-06T00:00:00.000Z",
    "score": 9.4,
    "comments": "An Immortal Game\nThere is just one word for Starcraft -- Legendary! Never has a game provided the kind of longevity that Starcraft provides. This longevity is based neither on the story nor on the features (though both of which are consi... ",
    "gameID": 1,
    "author": "Themaazandar"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-07-08T00:00:00.000Z",
    "score": 9.9,
    "comments": "Best RTS ever made\nThis game is classic, every1 should at least, know what StarCraft is, maybe no the 1st RTS game created, but the 1 that made this genre 1 of the best. In my opinion: It owns: Command and Conquer...any Age of empires..... ",
    "gameID": 1,
    "author": "centruroides"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-07-12T00:00:00.000Z",
    "score": 9.0,
    "comments": "My favorite RTS game to date (2007).\nStarcraft is truly hard to describe. Any game that can be out for 9 years and still be the best has to be great. The people wjo don\u0027t like this game never gave it a chance because it is hard to learn. Once you learn it y... ",
    "gameID": 1,
    "author": "scarymovie5"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2007-07-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "Completely amazing and completely underrated. Easily better than any game of it\u0027s kind.\nThis game is just amazing. Simple as that. It has a very engaging single player, and the multiplayer is extremely fun. This game is always being outshined by WoW and Warcraft 3 and such, so nobody ever gets to see how am... ",
    "gameID": 1,
    "author": "MetalFreekz"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-07-16T00:00:00.000Z",
    "score": 9.8,
    "comments": "Simply the best strategy game I\u0027ve played to date, even though it\u0027s almost 10 years old.\nThis game is simply put, the best strategy game I\u0027ve played to date. Each race has a different gameplay style with the proper balance between them. The story in the single player campaign is top notch, as are the graph... ",
    "gameID": 1,
    "author": "chockett"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-07-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best strategy game ever\nThere are three races fighting each other, each with it\u0027s strong points and weaknesses:protoss,zerg and terran.If u learn how to do it u can be very powerful and win all the wars no matter which of the 3 u represent.This... ",
    "gameID": 1,
    "author": "sorin_ro"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2007-07-22T00:00:00.000Z",
    "score": 9.6,
    "comments": "TO THIS DAY ONE THE BEST RTS EVER! 7/22/07\nstarcraft is one the games that shaped modren gameing. In many ways it is the best game every made. Great online play, great editor ,tightly blanced, and just plan fun .In Korea it has been one of the most populary games... ",
    "gameID": 1,
    "author": "carenot15"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-07-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "Maybe I weren’t be alive because of starcraft, or writing this, or having bad qualifications on school. FULL REVIEW.\nREVIEW. Almost ten years destroying my little zergs, my huge protoss or my technologic terran, I just can stop playing it, 3 different races who no one of the 3 have the same thing, or even close, just nothing who make ... ",
    "gameID": 1,
    "author": "pandresvillare"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-07-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "If the Greeks had a god for RTSs Starcraft would be it.\nOk shut up that graphics are old who gives a care, know I am done with that. Starcraft has to be the best RTS around and oh my god, there is a god, Starcraft II is coming but this not a preview of SCII this a review of S... ",
    "gameID": 1,
    "author": "slamthebowler"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-07-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "The King of RTS\nStarcraft – will take you thru strategic large scale battle against hordes of alien zergs, rough marine and high tech species protos which side you chose will determine your destiny unless you play again using the other ... ",
    "gameID": 1,
    "author": "willxcool"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-08-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Nothing is better than this computer war game i love. This is one of my all time favorite games.\nPerfect,Perfect,PerfecPerfect,Perfect,t,Perfect,Perfect,Perfect, Thats all i can say. this game is so much fun for any gamer. I play this game everyday because it is soo good. This game came out years ago and people sti... ",
    "gameID": 1,
    "author": "Super_Link_77"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-08-06T00:00:00.000Z",
    "score": 8.7,
    "comments": "Starcraft is one of the best rts games of all time\nI think that starcraft is one of the best real time strategy games of all time. The game has a very fun and immersive story. I will start with the positives. One of the best positives is the storyline, another is the... ",
    "gameID": 1,
    "author": "Captain_Lindo"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-08-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best PC game of all time!\nPerfect,Perfect,PerfecPerfect,Perfect,t,Perfect,Perfect,Perfect, Thats all i can say. this game is so much fun for any gamer. I play this game everyday because it is soo good. This game came out years ago and people sti... ",
    "gameID": 1,
    "author": "Super_Link_77"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-08-10T00:00:00.000Z",
    "score": 9.6,
    "comments": "Starcraft review\nStarCraft is a real time strategy game by Blizzard Entertainment. It was initially released for Microsoft Windows in 1998. A Mac OS version of the game was released in 1999, and a port to the Nintendo 64 was released in ... ",
    "gameID": 1,
    "author": "agustbestur"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-08-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "As far as classic style RTS games go, it just doesn\u0027t get any better than this.\nThere\u0027s a reason millions of people still play this game. It\u0027s perfectly balanced, has kick ass characters/villans, and the storyline is sweet. If you like RTS at all, you need this game right now. It is, in my opinio... ",
    "gameID": 1,
    "author": "bulldog7"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-08-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "With an interesting storyline, and great multiplayer. It\u0027s a 9.9! (except I can\u0027t use that).There\u0027s no reason not to buy\nThis game is the first great PC game I played. I bought it on its release and still play it to this day. Its graphics may be dated but it still keeps it fresh with great art design and character direction. This game i... ",
    "gameID": 1,
    "author": "liquid_ninja"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-08-27T00:00:00.000Z",
    "score": 9.5,
    "comments": "Continues to be my favorite RTS almost ten years after release.\nStarCraft has really amazed me with its longevity. Blizzard has continued to release updates that keep the game working with MacOS X even though StarCraft has been out for almost ten years now. While the old version of B... ",
    "gameID": 1,
    "author": "xodiac"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-09-03T00:00:00.000Z",
    "score": 9.5,
    "comments": "Awesome!\nIf you want the perfect strategy game, this is it! You can have tons of hours of fun whether you play the story-based single player or play FOR FREE online against people all around the world. The single player has a g... ",
    "gameID": 1,
    "author": "206695019692191253266167253831"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-09-05T00:00:00.000Z",
    "score": 9.5,
    "comments": "Easy to get into, and maximum lasting Power!!!\nStunning game, takes you about 15 minutes to get started and along the lines of 60 hours of pure fun and discovery. Recreated a world of mystery and monsters like only seen in your dreams Nice thing about this title i... ",
    "gameID": 1,
    "author": "dupreez"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-09-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "Probably the best game that\u0027s set in the future.\nIf you\u0027re ever with a group of nerds or game enthusiasts (as some wish to be known as,) you might come across a few games that you can relate to. If there is one game that everyone in the room can relate to, I bet that ... ",
    "gameID": 1,
    "author": "moogle_eater_89"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-09-08T00:00:00.000Z",
    "score": 9.5,
    "comments": "It\u0027s tha game that brought a revolution in real-time strategy games.\nWithout doubt StarCraft has made a huge success in rts games because of it\u0027s new based formula that Blizzard used.It is completely unlike the past games of Blizzard and it provided many new features in a way to be one of... ",
    "gameID": 1,
    "author": "MindThaGap"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-09-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "Take Red Alert and multiply it by 50 and you get the best selling RTS to this day.\nIntroduction Starcraft(SC) dates back to 1998. When Blizzard brought another one of their infamous online games to the fans with tons of gameplay opportunities. Diablo was first on their list. Starcraft exploded in sale... ",
    "gameID": 1,
    "author": "Fossil"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-09-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Amazing\nWell though this review is coming almost a decade after the game was released the game is still Golden. In my opinion the best RTS ever created. The game even though 9 years old still has a very large fanbase. The campai... ",
    "gameID": 1,
    "author": "AlmightyGeo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-09-13T00:00:00.000Z",
    "score": 9.5,
    "comments": "Nothing beats a good ol\u0027 game of Starcraft.\nStraight up, this is one of the most classic strategy games you will play. It barely ever gets old, and when it does, you only have to take a break from it for about a week or two until it rejoices to its best playabilit... ",
    "gameID": 1,
    "author": "OwNaGe_CRZY"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-09-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best game in history. Period.\nAFter playing Warcraft II, most players I knew back then were expecting to see another great Blizzard game. However, as the transition from Warcraft I to Warcraft II was mostly a facelift, most people expected a \u0026quot;Wa... ",
    "gameID": 1,
    "author": "afpabon"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-09-15T00:00:00.000Z",
    "score": 9.5,
    "comments": "VIdeo games at their best! Starcraft is at the complete peak, putting hundreds of games to shame!\nWhat more is there to say, it\u0027s Starcraft! If any game is better than this, even SC2, then it defies the laws of physics! However, in accordance with those laws, nothing is perfect so I give it real close! Starcraft prov... ",
    "gameID": 1,
    "author": "cA-cerebrate"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-09-15T00:00:00.000Z",
    "score": 9.5,
    "comments": "This game is going to be one of those games that will be played online FOREVER!...\nThis game, not that there isn\u0027t much to say about it\u0027s campaign, is almost strictly a multi player game. Although the campaign is fun to play, the AI is nice, it doesn\u0027t have much of a story to it, and so most people ju... ",
    "gameID": 1,
    "author": "lokiisback"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-09-22T00:00:00.000Z",
    "score": 9.0,
    "comments": "The greatest strategy game ever??\nThis game is the most popular strategy game of all time, and for a good reason. This game is outstanding in every way. First the game has a decent storyline, which is a nice difference from other games who don\u0027t focus on... ",
    "gameID": 1,
    "author": "cujodog09"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-09-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "Truly a perfect game in every phase of the game. Blizzard has really outdone themsleves in this marvelous bloody melee.\nStarcraft is the most amazing game i have ever laid my hands on. In ten years i have not encountered another game that is more balanced and addictive. This game is truly one of the greatest computer strategy games ever c... ",
    "gameID": 1,
    "author": "Nexrad"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-09-25T00:00:00.000Z",
    "score": 9.5,
    "comments": "Starcraft is undeniably the best PC RTS to date. Even ten years after its release, it still retains its magic.\nStarcraft: Brood War took all the brilliance of the original Starcraft and built upon it with new gameplay balances, additional campaign missions, and new units for each race. One of the most significant problems that f... ",
    "gameID": 1,
    "author": "John__locke"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-10-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Starcraft is the best real-time strategy game i have played ever. Without a doubt.\nStarcraft is the best real-time strategy game i have ever played. From the incredibly diverse and amazingly thought out units to the incredibly fast-paced gameplay it towers at the top as the game i will compare all othe... ",
    "gameID": 1,
    "author": "Shrog-III"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-10-03T00:00:00.000Z",
    "score": 9.0,
    "comments": "fant@stic one of the best\ngood story .Teams are perfect wants to keep on playing it.... its just so great i hope starcraft 2 will be much more better ..... waiting to play it too protoss zergs and terran fighting \u0026amp; the combination of terran a... ",
    "gameID": 1,
    "author": "tahha"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-10-09T00:00:00.000Z",
    "score": 9.5,
    "comments": "can\u0027t beat the classics!\nStarcraft, don\u0027t believe i\u0027ve met a \u0026quot;gamer\u0026quot; that has never heard of it. possibly one of the best RTSs in game history. With the choice of 3 different races, the zerg, the terran (humans), and protoss, you wage ... ",
    "gameID": 1,
    "author": "Jonahzg"
  },
  {
    "helpfulCount": 15,
    "helpfulScore": 4,
    "date": "2007-10-16T00:00:00.000Z",
    "score": 7.5,
    "comments": "Really fun/Addicting but heres the bad reason why this game don\u0027t deserve a 9-10 score.(In my opinion)\nThis game is really addicting with all the 1vs1-1vs7 games and the custom maps like helms deep and crash rpg I can play it all day but. I say blizzard needs a report thing where u can report hackers and get there A**es b... ",
    "gameID": 1,
    "author": "DarkWatchman"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-10-21T00:00:00.000Z",
    "score": 9.0,
    "comments": "Starcraft is easily defined as the best RTS classic of all time, serving as inspiration to other strategy games.\nEven today, it is still played by countless players around the world, who don\u0027t forget the considerable value of Starcraft in the history of RTS\u0027. Even with his outdated graphics, it can still compete with other well kno... ",
    "gameID": 1,
    "author": "Kroich"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-10-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "A breakthrough in the RTS genre and one of my favorite games of all time.\nStarcraft is an RTS for the PC. Don\u0027t get me wrong. I don\u0027t just hand out perfect scores. But this is truly deserves it. It was kind of a breakthrough for the genre. Before it was either two races like Warcraft, or a bun... ",
    "gameID": 1,
    "author": "monkeytoes61"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-11-06T00:00:00.000Z",
    "score": 9.5,
    "comments": "Is there a better RTS out there to date? The answer is....\nNO Thats because starcraft is THE best RTS I have ever played. And still to date (2007) millions of people are still playing on battle.net. And I\u0027m one of them. The graphics are perfect for a game like this, because y... ",
    "gameID": 1,
    "author": "00kev"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-11-14T00:00:00.000Z",
    "score": 9.5,
    "comments": "BEST BLIZZARD GAME EVER!! if you dont have this, i dont know whats wrong with you.\n-basically, if you own a pc, and enjoy pc games, and have the original starcraft i don\u0027t know WTF is wrong with you seriously, comon man. not owning starcraft is like eating bread when the peanut better and jelly are in ... ",
    "gameID": 1,
    "author": "H3LL_Hunter"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-11-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Satrcraft: Brood War is one of the best RTS games that i have played and that has made it through so much\nThis game is one of the best RTS games that i have seen in years an to those of you who din\u0027t know what RTS means it mean Real Time Strategie. the campaign Editor is common these days but more simpler to mnuver and this ... ",
    "gameID": 1,
    "author": "Hengif"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-11-20T00:00:00.000Z",
    "score": 9.5,
    "comments": "Totally rocks!\nStarcraft is one of my all time favourite games ever made. Blizzard was the one company I could always look to for a good game to play. Starcraft\u0027s campaign was amazing, totally immersive. Even though the graphics weren\u0027... ",
    "gameID": 1,
    "author": "ComradeWolf"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-11-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best real time strategy to date......and its still fun 10 years later!\nThe original Starcraft proved to be an innovative, complex, and deep rts, and brood war only expands and complements on what the original game did so well. Starcraft was not broken and Brood war is not trying to fix it, ... ",
    "gameID": 1,
    "author": "PyroPice"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-11-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the greatest game of the computer game history.\nAw... Starcraft... If you were born after 1992 or so and has never heard about Starcraft, I understand. You have your pokemons and Yugiohs to worry about anyway. But if you were born between 1970 and 1990 and still has n... ",
    "gameID": 1,
    "author": "mrlie3"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2007-12-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "oh man, sorry diablo ...\nat first when i played diablo, i thought it was the greatest game 4 the pc to ever be created, and i was only so young too. lol, isnt it rated M? anyways, then i played starcraft ... i was totally wrong. I must say they ... ",
    "gameID": 1,
    "author": "PrincessSamus"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-12-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "Same game as Starcraft with added units. Lurkers, Devourers, Dark Templars, Valkyries, etc.\nThis is more of a story than a review, but this is an awesome game, and I highly recommend it to RTS gamers. It\u0027s been a while since I played the game. I mean I replayed it again during the summer when I heard that St... ",
    "gameID": 1,
    "author": "pcktlnt"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-12-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "Played this RTS online for the longest time. 4 years maybe.\nThis is more of a story than a review, but this is an awesome game, and I highly recommend it to RTS gamers. It\u0027s been a while since I played the game. I mean I replayed it again during the summer when I heard that St... ",
    "gameID": 1,
    "author": "pcktlnt"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-01-01T00:00:00.000Z",
    "score": 9.5,
    "comments": "The only expansion to Starcraft is monumental simply because it improves one of the greatest games of all time.\nOne has to admit that Starcraft has been a powerhouse of a game since it\u0027s inception into the video gaming world. Ever since the game came out in 1998, the gaming world still has a lot of people\u0027s hearts locked onto thi... ",
    "gameID": 1,
    "author": "WinWalter"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-01-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "one of the best games ever\nits one of the best games ever, i think that you feel addicted to this game, i play it since i was ten and i still play it every day, its not a very difficult game, its well explained, and im sure that starcraft 2 is goi... ",
    "gameID": 1,
    "author": "FernadoCR"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-01-09T00:00:00.000Z",
    "score": 9.0,
    "comments": "Starcraft will remain forever, one of the best games produced ever, but for me, it\u0027s not the best of all the time.Sorry!\nIf you\u0027re ever with a group of nerds or game enthusiasts (as some wish to be known as,) you might come across a few games that you can relate to. If there is one game that everyone in the room can relate to, I bet that t... ",
    "gameID": 1,
    "author": "mircea_calarasu"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2008-01-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best Strategy Game of All Time\nThis is kind of pointless. I\u0027m not even sure why I\u0027m writing this review. It\u0027s STARCRAFT! If you don\u0027t know what that is, then you need to go to Amazon and order this game. It is, without any doubt, the greatest PC strat... ",
    "gameID": 1,
    "author": "decoy415"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-01-12T00:00:00.000Z",
    "score": 9.0,
    "comments": "My Starcraft Review\nStarcraft is one of the best old school RTS\u0027s. It has both single player and online multiplayer( which was not very common back in the day ). The game also features a map editor, so you can come up with your own crazy al... ",
    "gameID": 1,
    "author": "ryguy35"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-01-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Holy Freakin GOD!\nBlizzard has always made good games. I own all non WOW blizzard titles and know them all well. This means that I can easily say that Brood Wars is easily the best. It carries on brilliantly from Starcraft and adds just ... ",
    "gameID": 1,
    "author": "lv46"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-01-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "Gameplay, Gameplay, Gameplay\nStarcraft is quite a few years old now but it\u0027s still enjoyable because it nails the most important aspect of any game: Gameplay. Games can look nice, but so can paintings...games can have a compelling story, but so ca... ",
    "gameID": 1,
    "author": "Stowik"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-01-28T00:00:00.000Z",
    "score": 9.5,
    "comments": "The Best RTS, Period.\nStarcraft has done what no other strategy game series has offered, diversity. The three different races are so unique that you are basically given 3 games in one package. Starting off in the campaign mode you have three ... ",
    "gameID": 1,
    "author": "jb5O4"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2008-02-04T00:00:00.000Z",
    "score": 8.5,
    "comments": "tis game ads the frase \"Raining blood\" to the RTS gender.\nIt\u0027s all about game play. if you gotta choose between graphics and game play you\u0027ll choose the 2nd one, right? Amazing sound effects and a lot of action make this game different to the other ones. The graphics did\u0027n... ",
    "gameID": 1,
    "author": "nintendofreak19"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2008-02-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is the best game ever. What can I say more?\nThis is some kind of a story that happened to me and not a review about the game so if you don\u0027t want to read it, you don\u0027t have to. I had just bought my PC in 2002 and had no games at all. Then a friend of mine who had ... ",
    "gameID": 1,
    "author": "A-myrtaj"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2008-02-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best game ever, it\u0027s really the best strategy game. the great gameplay compensates for the lack of gr\nwell i don\u0027t have much to say really, this game is amazing !!! it\u0027s perfectly balanced, has a great story-line, it really submerges you into a universe of war, and the races of the game are perfectly balanced and very... ",
    "gameID": 1,
    "author": "FireWarriorr"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2008-02-18T00:00:00.000Z",
    "score": 9.5,
    "comments": "I first played the game when I was 7, and never forgot it afterwards.\nWell I can\u0027t say much about Starcraft that hasn\u0027t already been said, so I\u0027ll keep this snappy. I went to my friend\u0027s house one day when I was 7 so he could show me this game. I had no idea what it was like. I remember... ",
    "gameID": 1,
    "author": "cheeseboy666"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2008-02-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "Multiplayer competitive enough to become a national sport in South Korea!\nStarcraft: Brood War, is the only official expansion pack to Starcraft. After hearing the announcment of Starcraft 2, I had decided to buy Starcraft: Battlechest. I had only played it once before in my life. I was excite... ",
    "gameID": 1,
    "author": "EE2lemmonhead"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2008-02-22T00:00:00.000Z",
    "score": 3.0,
    "comments": "Official licensed products made by a third party don\u0027t usually work out too well...\nThe unbelievable success of Starcraft would obviously invite many things to the table. Toys, comics and legions upon legions of fans are just a few things to name but there is one more thing that people neglect to talk... ",
    "gameID": 1,
    "author": "WinWalter"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-02-22T00:00:00.000Z",
    "score": 8.5,
    "comments": "Made one of the top 5 best PC games ever EVEN better\nAgain, I can\u0027t say much that hasn\u0027t already been said about Brood War, but I will say this: IT\u0027S MOTHER******* HARD! And that\u0027s ok. Blizzard obviously assumed that people who are playing the 3 new Campaigns have be... ",
    "gameID": 1,
    "author": "cheeseboy666"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2008-02-24T00:00:00.000Z",
    "score": 9.5,
    "comments": "Excellent.\nFirst off this game is just amazing. It was released ten years ago, and I still play it to this day. I am not a big fan of real time strategies, but this game is an exception. Each faction is unique and has something ... ",
    "gameID": 1,
    "author": "Migsten"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-02-26T00:00:00.000Z",
    "score": 8.0,
    "comments": "the formula for making people go \"WOW!\"\nFirst and foremost, i\u0027ve just recently completed the game, but i really got to write a review about this. IT\u0027S AWESOME. 1st up..let\u0027s start with Gameplay. there are 3 species in the game, the Terrans (your normal fig... ",
    "gameID": 1,
    "author": "MrFinalFantasy"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2008-03-07T00:00:00.000Z",
    "score": 9.5,
    "comments": "Many people think is overrated, others think is perfect, i think: \"THIS GAME TURNS ME ON!!!\"\nBlizzard entertaiment just made a mastrpiece, it is fun, interesting, a great campaign story, graphics and sound. Let us begin with the gameplay, simpy to understand, easy to control, and fu to make an army and destroy e... ",
    "gameID": 1,
    "author": "Vikthorious"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2008-03-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is very addictive. It is a little short and thats the downside but it is still a very fun game to play........\nThis is one of the best games you can play on the internet. People say its been around for too long and that its old but dont listen to them. Play the game yourself and rate it. The storyline in the campaign is fascinat... ",
    "gameID": 1,
    "author": "007-wolfenstein"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2008-03-22T00:00:00.000Z",
    "score": 9.0,
    "comments": "Starcraft: Broodwar is a sequel to the awesome original game, \"Starcraft\".\nIf you\u0027re looking for a real time strategy game with plenty of variety, this is your game. Starting off, Starcraft: Broodwar has been packed in with a whole new campaign for the three races: protoss, zerg, and terran. Ea... ",
    "gameID": 1,
    "author": "mircea_calarasu"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2008-03-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "The Absolute Best Game Out There!\nWhat to say about StarCraft....more like What is there not to say?! StarCraft is A revolutionary game, one of the few out there I could give a strong 10...It hasn\u0027t got a weak point, really. I\u0027ve never played a bette... ",
    "gameID": 1,
    "author": "StarCraft-Klown"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 3,
    "date": "2008-03-26T00:00:00.000Z",
    "score": 9.5,
    "comments": "one of the best games in its genre.\nStarcraft is a real time strategy game in which you must manage a base whilst building a large enough force to methodically destroy the enemy base and all of its installments, higher level combat units can be gained by \u0027... ",
    "gameID": 1,
    "author": "nickelarcade"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-03-30T00:00:00.000Z",
    "score": 9.5,
    "comments": "An AMAZING expansion to an AMAZING game....\nWhat to say about a game that is as big, innovative, and revolutionary as Starcraft and it\u0027s expansion Brood War? This game took PC gaming by storm and pretty took over an entire country of gamers (South Korea). So wh... ",
    "gameID": 1,
    "author": "DrewTheSchu"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-03-30T00:00:00.000Z",
    "score": 9.5,
    "comments": "The GRANDADDY of RTS!!!\nWhat to say about a game that is as big, innovative, and revolutionary as Starcraft. This game took PC gaming by storm and pretty took over an entire country of gamers (South Korea). So what made Starcraft such a grea... ",
    "gameID": 1,
    "author": "DrewTheSchu"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2008-04-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "The number one Strategy of all time\nStarcraft was released in 1998 and right from the beginning became a very popular strategy game. The game is based sometime in the future on a far off world with three distinct alien races combating each other for univer... ",
    "gameID": 1,
    "author": "krondor13"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-04-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "Starcraft has a wonderfull storyline filled with special content. The game is a must try out for everybody.\nStarcraft brood war opens up a lot more story line, filled with old characters and new characters. It will keep you interested throughout the campaign with wonderful strategy and content. Certain characters will help you... ",
    "gameID": 1,
    "author": "XAntFreakX"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-04-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "Starcraft is the best game I have ever played! And the game I play the most too!\nStarcraft is the best game I have ever played! And the game I play the most too! Even today, none strategy game is better! And every time a new RTS came I wonder if could be better, but isn\u0027t. But it is only worthy tod... ",
    "gameID": 1,
    "author": "Mouriner"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2008-04-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "Greatest Game of All Time. (At least of all the games I have ever played… and that\u0027s a lot.)\nI own over 250 video games. I have easily played over 1000 different games over the past 25 years. Star Craft: Brood War is STILL the best game I have ever seen or played, and in my humble opinion, is the greatest game... ",
    "gameID": 1,
    "author": "olympicheropaul"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-04-17T00:00:00.000Z",
    "score": 8.5,
    "comments": "So is this better than Warcraft?\nWell that depends. Starcraft plays so similar to the Warcraft games it\u0027s kind of hard to differentiate them. Thankfully this is all science ficition. You know, set in outer space with humans versus aliens versus cyborgs.... ",
    "gameID": 1,
    "author": "pandaramaster"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-04-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "ATTACK OF THE PROTOSS..........\nSo ANYONE who has NOT been living under a rock for YEARS now has heard of the legindary hit starcraft. I personaly have been playing this game for 3 years now and finaly decieded to write a review about this INCREADABLE ... ",
    "gameID": 1,
    "author": "belladonna14"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-04-29T00:00:00.000Z",
    "score": 9.5,
    "comments": "Starcraft 1 The game play is brilliant the graphics not so good but for its time amazing this is the best game.\nas i said before the game play is amazing it is the best game I have played by far apparently from atrox with is practically the same but made by a different company gamespot didn\u0027t know about it but my trusting friend r... ",
    "gameID": 1,
    "author": "calx3"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-05-04T00:00:00.000Z",
    "score": 9.5,
    "comments": "An amazing game.\nThis game will keep you entertained for hours.Some Koreans have been playing this game since it was released....IT WAS RELEASED IN 1998!Ok so it has nice graphics, a good story,nice online play,well balanced races and ni... ",
    "gameID": 1,
    "author": "bobbyjh213"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-05-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best Sci Fi RTS game made.\nThere are several reasons this game deserves a 10. 1. The story is fantastic: The story is just hard enough to challenge you, while not driving you insane. The characters are all very engaging, as you go through th... ",
    "gameID": 1,
    "author": "igotoda"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-05-18T00:00:00.000Z",
    "score": 9.0,
    "comments": "Great Game but loses its touch when u compare it to the new ones.\nStarcraft is not a great game today but back in the day it was top notch setting the high standards and inventing new ideas. The three races are absolutely amazing to play with but after playing this game for so long i h... ",
    "gameID": 1,
    "author": "gamefreak9"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-05-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "As perfect a ten as it was 10 years ago.\nAt this stage in the lifespan of Starcraft there shouldn\u0027t even be the need for another review that states how perfect this game is. But here it is, STARCRAFT is a perfect 10, not because it is flawless, I don\u0027t think th... ",
    "gameID": 1,
    "author": "79th_Warrior"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-06-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Who can\u0027t say WOW at this game? Wanna know why? Then read meXD\nAt 9 yrs old I got my first Pc and this game and what a blast! Creat your own army, you got some kinda of story line (if you wanna read it between missions), Cut scenes like never before and also what a wonderful map mak... ",
    "gameID": 1,
    "author": "The_SlaY3R"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 5,
    "date": "2008-06-21T00:00:00.000Z",
    "score": 7.0,
    "comments": "Good game, but not excellent.\nI must start by saying this: I\u0027m playing the game in 2008 and the game is 10 years old. I tried to write down this review considering the fact that this game was written in an earlier technological era. This game ... ",
    "gameID": 1,
    "author": "SonOfSparda018"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2008-06-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "Still the king of all RTSs, even by modern standards.\nYou just can\u0027t go wrong w/ Starcraft. This game still remains my fav. RTS of all time. Everything about this game, unlike other RTSs out there, feels just balanced. The Zergs, Protoss, and Terrain forces all have the ... ",
    "gameID": 1,
    "author": "benx009"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-07-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "It\u0027s not just a game but a sport as well.\nStarcraft...where do I start? Perhaps with the single player campaign. I never really paid any attention to the single player campaign and for good reason, it sucks in comparison to the multiplayer. Don\u0027t even touch t... ",
    "gameID": 1,
    "author": "vTank"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 0,
    "date": "2008-07-01T00:00:00.000Z",
    "score": 9.0,
    "comments": "Old as dirt, but this aging fart\u0027s still alive and kicking.\nStarCraft and its expansion, Brood War, are Real Time Strategy games on the PC and Mac, and are widely considered to be among the best games in the last few years. Blizzard, the developer of lore that makes games for the... ",
    "gameID": 1,
    "author": "gbarules2999"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2008-07-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "ITS AN AWSOME GAME!!!!\nThis game is the best game I\u0027ve ever played. Every faction has just the right amount of differences that you can switch easily but you still can say \"Wow, this is totally different than the last faction!\" The plot line i... ",
    "gameID": 1,
    "author": "Dok777"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-07-09T00:00:00.000Z",
    "score": 9.5,
    "comments": "Even if you don\u0027t like RTS games, get this.\nI never liked RTS games. hated them. They seemed really boring but I heard starcraft was fun. So I thought \"hey, I\u0027ll pick this up.\" and I did today and I\u0027m shocked. This game is so amazing. I\u0027ve played for a short time ... ",
    "gameID": 1,
    "author": "CowsGoWoof"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-07-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "Amazing game is amazing.\nThere are many games out there who have been awarded the, \"Greatest Game of All Time,\" title, but I don\u0027t think any other game deserves it as much as StarCraft. It practically birthed competitive gaming, and took it to t... ",
    "gameID": 1,
    "author": "RustyScrew"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-07-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "SS Free\u0027s official review of StarCraft\nStarCraft is arguably the best real-time strategy game ever. The single player mode of the game is extremely boring, however StarCraft is awesome online! Blizzard Entertainment\u0027s Battle.net supports both StarCraft and ... ",
    "gameID": 1,
    "author": "xgmx"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-07-29T00:00:00.000Z",
    "score": 9.0,
    "comments": "The prefect addition to an already perfect game.\nSoon after the release of the original game the powers that be decided an expansion set was needed to further enhance the addiction of millions of people and so they came out with Star Craft Brood War. Then the craziness... ",
    "gameID": 1,
    "author": "79th_Warrior"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-07-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "SS Free\u0027s review of StarCraft\nStarCraft is arguably the best real-time strategy game ever. The single player mode of the game is extremely boring, however StarCraft is awesome online! Blizzard Entertainment\u0027s Battle.net supports both StarCraft and ... ",
    "gameID": 1,
    "author": "xgmx"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-08-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is Starcraft... The mother of all strategy games, even today.\nStarcraft was released in 1998, so it is an older game, but the fact that thousands of people play it today prove that this game is amazing. A brief explanation of it is based on a futuristic science fiction world whe... ",
    "gameID": 1,
    "author": "Bust4G4me"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-08-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is the best strategy game!\nStarcraft is the most amazing strategy game ever made. I played it for years, and I still am playing it. Starcraft is a great game, but the expansion (Starcraft: Brood War) made it one of the best games on Earth. With th... ",
    "gameID": 1,
    "author": "scigeni"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 6,
    "date": "2008-08-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "StarCraft is balanced, gritty, and lots of fun.\nGameplay - 5/5 Breaking free from RTS conventions of the time, StarCraft featured three playable races that differed in more than just aesthetics. The resilient Terrans, swarming Zerg, and high-tech Protoss each have th... ",
    "gameID": 1,
    "author": "BladeMaster75"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-08-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best game ever!!!!!!!!!!!!\nThis game is fantastic!!!!!! :), it\u0027s just amazing how it survives to time and still being one of the most played games. I think that its originality because of the three different races. The one I like the most the Zerg... ",
    "gameID": 1,
    "author": "gonztar"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-08-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best RTS out there...still\nStarcraft: Brood War is amazing. Starcraft happened to be my first RTS game and my favorite as well. I tried play the others, but nothing compares. Its gotten so big that in Korea its considered a sport, and if you have ... ",
    "gameID": 1,
    "author": "kjohn88"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-08-27T00:00:00.000Z",
    "score": 9.5,
    "comments": "Perfect Addition to the original\nIf anything could come close to the success of Starcraft, it would obviously be its expansion pack. Whats cool about this expansion is that you basically call a whole new, full campaign to play as well. It was about the ... ",
    "gameID": 1,
    "author": "halolife982"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-08-27T00:00:00.000Z",
    "score": 9.5,
    "comments": "Definition of the ultimate RTS\nI know this is an older game, but even today I find myself playing it on occasion. For the time period that it came out, it was revolutionary. Blizzard, as usual, created a top notch game that does exactly what every vid... ",
    "gameID": 1,
    "author": "halolife982"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-09-01T00:00:00.000Z",
    "score": 9.0,
    "comments": "It\u0027s 2008 and Gustav is making me review a game from 1998......\nStarcraft takes place during the future, where there are three main races; the Zerg, the Terrans, and the Protoss. You play in a single-player campaign mode which you play in order as the Terrans, Zerg, then Protoss. T... ",
    "gameID": 1,
    "author": "robbieeeeee"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-09-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is the only game in history ive given a 10.\nok, i honestly think this is my all-time favorite game ever. This game has awsome gameplay, awsome graphics (for its time), and an amazing story. The single player campaign is just amazing as well. its one of the only RT... ",
    "gameID": 1,
    "author": "Bowserpwns"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-09-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "The absolute greatest VIDEO GAME (including all consoles) to have ever been created.\nWhen describing Starcraft, it\u0027s not so much describing a video game as it is describing a religion. Starcraft, and it\u0027s expansion set Brood War, are the greatest games to have been put on a computer or any gaming system ... ",
    "gameID": 1,
    "author": "JOke622"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-09-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "i dont ever recall a blizzard game being bad....this is the best blizzard game out there..... nothing beats starcraft bw\ni dont ever recall a blizzard game being bad....this is the best blizzard game out there..... nothing beats starcraft bwi dont ever recall a blizzard game being bad....this is the best blizzard game out there..... nothin... ",
    "gameID": 1,
    "author": "itaichi-666"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-09-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "Greatest Blizzard game to date, pure amazement.\nStarcraft: Brood War is sure to make anyone happy....forever. Being an amazing expansion it packs the punch that Blizzard knows how to give, and being experienced in this style of game, Blizzard of come to recognize what... ",
    "gameID": 1,
    "author": "Soilworker1234"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-09-25T00:00:00.000Z",
    "score": 9.5,
    "comments": "8 years and still playing see what is great!\nInfo: This review entails both worlds of Starcraft and Broodwar. I am writing my review on the Broodwar section because the expansion is what made the game great for me! I have now been playing SC for more than 8 yea... ",
    "gameID": 1,
    "author": "joewspecks"
  },
  {
    "helpfulCount": 22,
    "helpfulScore": 5,
    "date": "2008-10-15T00:00:00.000Z",
    "score": 7.0,
    "comments": "Personally, I Prefer Command And Conquer.\nIt Is Good,but i find it to be more entertaining when played online and not many games are. I Know You See People Always Saying \"This Is The Best Game EVER!!!!\" and stuff but really,it could be better. I Mainly Play it... ",
    "gameID": 1,
    "author": "Half_Jaw223"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-10-23T00:00:00.000Z",
    "score": 8.0,
    "comments": "Still fun and better than alot of games after all these years.\nStarcraft is pretty, nearly a decade and its still fun and better than alot of games released these days. Its classic RTS game featuring three factions which are look and play differently, these are the Terrans - huma... ",
    "gameID": 1,
    "author": "master_blue"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-11-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Who would give bad score to this game??? Only a crazy person!!!!\nThis is the father, no the GOD of RTS games even 10 years later this is still one of my favorite games, of course you can\u0027t compare it with games from this last years, in that time there wasn\u0027t even 3D graphics, anyone w... ",
    "gameID": 1,
    "author": "ixtykurrumi"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-11-06T00:00:00.000Z",
    "score": 9.0,
    "comments": "Take command of one of the three struggling races and lead intergalactic battles of supremacy and survival.\nThe great Protoss hero Tassadar sacrificed himself in order to destroy the Overmind of the insectoid Zerg. The Protoss home planet Aiur is totally devastated after the Zerg invasion, but thanks to Tassadar\u0027s great effort... ",
    "gameID": 1,
    "author": "gggames_se"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-11-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "The first voilent game I have ever played. And it made me the gamer that I am today. Hail, StarCraft!\nThis is a classic. The game that began the online frenzy of interstellar battles. This is the multi-million bestseller that placed Blizzard Entertainment in the list (if there ever was one) of the most successful gaming ... ",
    "gameID": 1,
    "author": "awwitz"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-12-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best PC RTS ever.\nStartcraft has got to be the best and most time consuming game I have ever played besides Super Mario Bros. This game has supplied me with countless hours of entertainment and will continue as Starcraft 2 gets released. ... ",
    "gameID": 1,
    "author": "Wiiownzzz"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-12-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "Great story, great gameplay, perfectly balanced and perfect difficulty curve. Starcraft is truly all it\u0027s made up to be.\nStarcraft is the best RTS (real-time strategy) game I have ever played. The story in the game is innovative, immersing, and loads of fun playing through, with many unique characters (my personal favourite being Zeratul).... ",
    "gameID": 1,
    "author": "moridin239"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2009-01-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is a no-brainer if you play rts or for that matter pc games.\nTHIS is what accelerated Blizzard Entertainment to what it is today. No doubt Starcraft is the standard by which all rts games should aspire to be though c\u0026c fans will beg to defer on this matter. Enough with the commend... ",
    "gameID": 1,
    "author": "pinpointmc"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2009-03-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best strategy games ever released.\nstarcraft was a game that I had originally heard about some years back from a friend of mine that played it frequently so I decided to go and try to buy the game for myself and luckily for me I found it for 25 cents at a... ",
    "gameID": 1,
    "author": "bountyhunter4"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2009-03-25T00:00:00.000Z",
    "score": 8.5,
    "comments": "This is a masterpiece that shouldn\u0027t be missed by any RTS lover.\nI feel ashamed that despite of playing PC games since 2000, I have not played this game before. Only recently I have got this game from my friend to check it out. There\u0027s much voices for this game in many topics througho... ",
    "gameID": 1,
    "author": "arijit_2404"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2009-03-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "My family and I have spent so much time playing this game it isn\u0027t even funny. We STILL play it, after all these years!\nWhere to even start? This game is the perfect blend of action and micro-management. It is an instant classic. It never gets old, because there are so many possibilities for battle and bases and whatnot. StarCraft w... ",
    "gameID": 1,
    "author": "MaXiMuS3"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2009-03-31T00:00:00.000Z",
    "score": 9.2,
    "comments": "A classic. One of the first true great online multiplayer games!\nWell to be honest its been quite a long time since I have played this game. Its old and its hard to play an old game on a new computer. But for the record this is one of a few multiplayer games in existence that for it... ",
    "gameID": 1,
    "author": "bobman_420"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2009-04-01T00:00:00.000Z",
    "score": 9.5,
    "comments": "Great game we used to play over dial-up!\nThis was my first exposure to RTS games back in the mid 90\u0027s. I\u0027ll have to say, first of all, that the learning wasn\u0027t bad especially using the tutorials. The storyline was pretty good, and the campaign through the three... ",
    "gameID": 1,
    "author": "Trekfighter88"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-05-13T00:00:00.000Z",
    "score": 9.5,
    "comments": "It\u0027s Starcraft. Need more be said?\nYes, more must be said. It will come as no surprise to Starcraft fans that Brood War adds on to the already amazing base of the first game. A few new units, maps, and an extension to the story is well worth the play t... ",
    "gameID": 1,
    "author": "MajinKnux"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2009-05-22T00:00:00.000Z",
    "score": 9.5,
    "comments": "StarCraft is just another masterpiece delivered with utmost finesse by Blizzard\nMan, you\u0027ve got to love Blizzard. Diablo, Diablo 2, Warcraft 3 - Reign of Chaos, Warcraft 3 - Frozen Throne and the StarCraft series. No gaming company goes any better than this -- and no games go better than these. 1... ",
    "gameID": 1,
    "author": "rohitmitra5752"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2009-05-25T00:00:00.000Z",
    "score": 9.5,
    "comments": "StarCraft is incomplete without Brood War\nWell! Brood War was released in 8 months after 2 other failed expansions (none of them were created by Blizzard - why do other companies try what they cannot achieve?) and it swept away the entire StarCraft universe. ... ",
    "gameID": 1,
    "author": "rohitmitra5752"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-05-31T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best storyline I have seen to date. No game will ever top it!!!\nThe story of Starcraft is one of the most intriguing story lines that I have ever seen. Full of betrayals, alliances, revenge, and one mean chick. This storyline picked up perfectly where the original left off, beating e... ",
    "gameID": 1,
    "author": "xxxx59"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-06-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "\"My life for Aiur!!!\" Best strategy game ever designed.\nStarcraft itself was an amazing game, that itself would be a 9.8 but brood war bumps it up to that perfect score. There are three races to choose from and there each so balanced and unique that no matter which you choose... ",
    "gameID": 1,
    "author": "Emilczawa"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2009-07-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "\"Simply Perfect\"\nthink about this. wat kind of a corporation would sponsor a gaming team paying them 250k a year, (salary only) with additional funds from advertising and fame? there is a reason for this. Because this game is so PERFECT ... ",
    "gameID": 1,
    "author": "brianthe12"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 5,
    "date": "2009-07-06T00:00:00.000Z",
    "score": 9.5,
    "comments": "Starcraft is still one of the best RTS games to come out, and new additions in Brood War makes it even better.\nImagine a sci-fi, futuristic world where world domination is considered a thing of the past, and the fight for universal supremacy is the latest trend. Starcraft provides you with that same imagination on a colossal scal... ",
    "gameID": 1,
    "author": "asian_pride69"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-07-28T00:00:00.000Z",
    "score": 8.5,
    "comments": "starcraft is a fun addictive game and i cant wait for starcraft 2 hope its fun too!\nstarcraft is a fun addictive game and has a great campain and storyline including for starcraft and starcraft brood war the new units bring the game to life more and multiplayer is still running which supprised me but ... ",
    "gameID": 1,
    "author": "steelersrawk"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2009-07-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "SC1 brings back memories.\nThis game is an RTS and if you are waiting for SC2 i encourage you to get this game and play the single player missions because this game was the best RTS ever made in the USA. People will disagree but I have played m... ",
    "gameID": 1,
    "author": "GenoXV"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-08-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "This battle pack will make gamers of all kinds happy, and is a great deal.\nIt doesn\u0027t get much better than 2 games, 2 strategy guides, a complete tech tree and a 14 day free subscription to World of warcraft. That\u0027s exactly what this box packs. This battle pack includes Starcraft and the Brood ... ",
    "gameID": 1,
    "author": "Tee-3"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2009-08-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best RTS ever made!\nThe Broodwar expansion pack made the already ground-breaking real time strategy game Starcraft into the worlds best computer game ever in my opinion. The graphics are wonderful. You can se all the units well even if s... ",
    "gameID": 1,
    "author": "gammis"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-08-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "The greatest expansion pack of all time? Yeah, it actually is.\nStarcraft was a revelation when it first came out. Rather than simply having two almost perfectly identical factions, as in the Warcraft series, Starcraft pioneered the idea of asymmetrical sides that each enjoy their ow... ",
    "gameID": 1,
    "author": "masterpinky2000"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-08-04T00:00:00.000Z",
    "score": 9.5,
    "comments": "The greatest real-time strategy game of all time...can\u0027t wait for that sequel.\nStarcraft is without a doubt the most important real-time strategy game of all time. Its impact is still felt today, as it has spawned a massively popular gaming culture in South Korea and dominated the U.S. PC games sal... ",
    "gameID": 1,
    "author": "masterpinky2000"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2009-08-09T00:00:00.000Z",
    "score": 9.5,
    "comments": "Totally awesome! Made gaming so much more worth it!\nA great game even without the expansion! Starcraft has it all. A great singleplayer story, great multiplayer opportunities, three different species with even benefits, a great campaign editor, cool background music, g... ",
    "gameID": 1,
    "author": "gammis"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2009-08-14T00:00:00.000Z",
    "score": 9.5,
    "comments": "Awesome gameplay , great music and an engrossing storyline, make Starcraft one of the best RTS games of all time\nStarcraft, released in 1998 for the PC, is one of the most amazing games I had ever played, In its day , it was an RTS like no other, and to this day very few games in the genre can even come close. at its time, it had a... ",
    "gameID": 1,
    "author": "Darkman2007"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-08-18T00:00:00.000Z",
    "score": 9.5,
    "comments": "The best RTS ever made.\nThe original StarCraft was revolutionary, and sold millions of copies. Blizzard would be hard-pressed to make a sequel as good as it, but they went over the top and beat it. Using 3 races, Terran, Zerg, and Protoss, you ... ",
    "gameID": 1,
    "author": "infested_ramza"
  },
  {
    "helpfulCount": 38,
    "helpfulScore": 2,
    "date": "2009-08-21T00:00:00.000Z",
    "score": 2.5,
    "comments": "Is strategy doing the same thing over and over?\nI\u0027ll mainly be discussing the campaign side of this game because the multiplayer is an even more pathetic waste of time. The campaigns start off charmingly enough. Each mission actually has a bit of variance, but boils... ",
    "gameID": 1,
    "author": "flclempire"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-08-24T00:00:00.000Z",
    "score": 9.5,
    "comments": "An amazing expansion, can\u0027t come up with a better description then that.\nFirst of all, the gameplay is extremely better off with the inclusion of this expansion as it adds a few helpful units and upgrades to a team that are an amazing help in any Battle.net match. Another great thing is the n... ",
    "gameID": 1,
    "author": "ColonelX24"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-08-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "The Definitive RTS\nThe fact that this game was made by probably the most successful game company ever and therefore is continuously updated, even today, aside; this is the ultimate of all RTS games, ever. I have had tons of fun, and lov... ",
    "gameID": 1,
    "author": "snared04"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-09-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "We all have the ambition to conquer the universe at some point of time in our lives now you can with three races.\nNow we all love to explore the universe in a Sci-Fi way. Well we don\u0027t have to wait any longer since StarCraft is here. Retaliate and conquer the universe with three races:Terrans, Protoss, and Zerg. The odds will be aga... ",
    "gameID": 1,
    "author": "Ramdath14"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2009-09-29T00:00:00.000Z",
    "score": 9.5,
    "comments": "Best executed RTS to date - lacks only based on current additions not available during development\nBackground: Starcraft was originally released when I was in middle school to a moderate release. This was relatively speaking before online gaming was widespread and RTS games consisted of custom LAN games for the most p... ",
    "gameID": 1,
    "author": "gdw0908"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-10-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "This Awesome combination of a lucrative Campaign, map editor, and multiplayer make this the best PC strategy game ever.\nExpanding on the already astounding gameplay of the original Starcraft, Brood War produces 3 more fun and challenging campaigns that will challenge you at every turn. It makes you make decisions, some affecting just the ... ",
    "gameID": 1,
    "author": "Silent_Vulpes"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-10-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "Number 1 balanced Real Time Strategy game for competitive play!\nAs a sit-back gamer, but not pro yet till SC II comes out. This game has the easiest hot keys to memorize and also only has 3 races to counter each other. You\u0027ll always find a player to play against no, matter what. Ev... ",
    "gameID": 1,
    "author": "JuDgEpowr"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 6,
    "date": "2009-11-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "Rating StarCraft is like rating God. How can one be so arrogant?\nHow can you believe yourself to be in such a position to give a review, to rate, to JUDGE such an entity as Starcraft? How can you be so arrogant to think that YOU are in any way capable of this?! StarCraft is someth... ",
    "gameID": 1,
    "author": "drwink"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-12-17T00:00:00.000Z",
    "score": 9.5,
    "comments": "How good? Really good.\nStarcraft is one of those games that whenever you mention its name, everyone in the room goes \"Hell yeah bro I know what yo\u0027 talkin\u0027 bout mo-****a\". This is one of those games that many people grew up with as kids and s... ",
    "gameID": 1,
    "author": "dudeeemadudbomb"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2010-01-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Perhaps the greatest strategy game ever made.\nWhat can I say, this game is timeless. The game that started out as WarCraft in Space evolved into something even the big Blizz didn\u0027t expect, an international juggernaut of Real-Time-Strategy. With it\u0027s three totall... ",
    "gameID": 1,
    "author": "JonChaoZ"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2010-01-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is the pinnacle of RTS gaming there is no finer RTS.\nWow what can I say, 11 years later and I am still playing this game. Wether or not its the amazing online community (battlenet or iccup) the amazing campains or the completely balanced gameplay I don not know but it kept... ",
    "gameID": 1,
    "author": "dave-dark"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2010-02-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "Another one of Blizzard\u0027s awsome games.\nIn this videogame you play as a Commander for 3 different races. A parasite like race called the Zerg. A human race called the Terran and an Alien race called the Protoss. The Good -The graphics were pretty good -The ... ",
    "gameID": 1,
    "author": "GeoffShouldWin"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2010-02-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Arguably one of the best real-time stragety games to date. To me, it\u0027s all that and more. A must-have.\nStarCraft had me speechless. I am the kind of person who loves science fiction and real-time strategy games, so this was like a gift from God above to me. I have not played a lot of campaign in this game, but I have b... ",
    "gameID": 1,
    "author": "Retroman47"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2010-02-16T00:00:00.000Z",
    "score": 9.5,
    "comments": "The plague of public presence\nI remember being a little boy and going out to play in the sun and on the beach, and I would always come home from my endeavors to find my brother sitting in front of the computer (under a blanket-tent to deal with glare... ",
    "gameID": 1,
    "author": "twinkieman2k"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2010-02-28T00:00:00.000Z",
    "score": 8.0,
    "comments": "I used to love this game to bits, I still do, but now it\u0027s just a passing fancy...\nWith the legend that is StarCraft comes it\u0027s expansion pack: Brood War. Every single thing about it screams \"EPIC!\", but it can only last for so long. The game is cake, the graphics are beautiful, (although it isn\u0027t 3... ",
    "gameID": 1,
    "author": "subhumanmoron"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2010-03-08T00:00:00.000Z",
    "score": 1.5,
    "comments": "Wow, I have no wonder this was retired from sales\nThis has to be the worst addon ever made for Starcraft. You can tell why Blizzard decided to hunt down and destroy all copies of this. So I\u0027ll quickly point out what the problem of this expansion is: * There is no story... ",
    "gameID": 1,
    "author": "CKeen666"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2010-04-10T00:00:00.000Z",
    "score": 7.5,
    "comments": "Retribution is a fairly decent expansion pack for Starcraft which comes with a new campaign and new multiplayer missions\nStarcraft is definitively one of the most well known real time strategy games of all times and it has largely influenced the genre. It was a great success and as such, two authorised add-ons not made by Blizzard were rel... ",
    "gameID": 1,
    "author": "CKeen666"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2010-05-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "Masterpiece!!!\nStarCraft is definitely one of the best Real Time strategy games ever made. Many people found the campaign to be great but it was not very interesting for me. I spent hundreds of hours playing on battlenet and lan and th... ",
    "gameID": 1,
    "author": "dazylee"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2010-05-21T00:00:00.000Z",
    "score": 9.0,
    "comments": "Campaign? Excellent. Multiplayer? Good. Battle Net? Awesome. Players? Not-so-good.\nThis is a classic. Maybe way back more than a decade ago, and there is a lot of reasons why millions of people are still playing this right now, especially in Korea. The reason why this is a very good game to me is th... ",
    "gameID": 1,
    "author": "William6058"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2010-05-22T00:00:00.000Z",
    "score": 9.5,
    "comments": "Brood Wars is to Starcraft what Frozen Throne is to Warcraft III\nStarcraft: Brood Wars is an expansion pack release for Starcraft. Seeing as it was released only 8 months after the original it is not so much an add on as it is a sequel to the first game. Blizzard probably had too much... ",
    "gameID": 1,
    "author": "stabelfy"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2010-05-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best RTS ever. Peroid!\nThe game you should play even 12 years after its release. Great single player story, truly fantastic multi player (best ever), highly fun and addictive. You will love characters in campaign but multi player will blown yo... ",
    "gameID": 1,
    "author": "masterring"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2010-06-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "Starcraft is an epic RTS game with amazing game play and a great story\nsimply put I will not write about the game\u0027s graphics or sound or story or even game play because all those things are so solid and so amazing they don\u0027t need to be explained. perfectly balanced units, amazing 3 total... ",
    "gameID": 1,
    "author": "vadagar1"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2010-06-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "I wouldn\u0027t dare rate this less than 10.\nIts quite possible that Starcraft is the greatest RTS game ever created, that is, until \"Wings of Liberty\" is released this July. I\u0027ve had so much fun playing this game over the last 7 or 8 years, and particularly so... ",
    "gameID": 1,
    "author": "Overlord76"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2010-06-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "Great, Even the times could not wear this game out.\nStarcraft is no joke, even after its original release about a decade ago. The Battle.net is still bristling with players, and this allows for a brimming multiplayer action. Campaign: Campaign does have its own flaws:... ",
    "gameID": 1,
    "author": "iloneforcombat"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2010-07-21T00:00:00.000Z",
    "score": 9.0,
    "comments": "The game that lived .\nThis game has been created year 1998 and it survived until now being even an international Korean Esport . Starcraft was created just as a joke the creators didn\u0027t expect much of success. It was something like a transiti... ",
    "gameID": 1,
    "author": "zakupower12"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2010-07-29T00:00:00.000Z",
    "score": 9.5,
    "comments": "Fun game still today.. Very hard but very fun.. classic..\nThis game is SOOOO OLD 1998. and let me say I bought the starcraft chest for 30 dollars and it loads instantly and is fun to play.. sure the graphics are crappy but the music is good and the characters are pretty interes... ",
    "gameID": 1,
    "author": "lastchancejames"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2010-08-17T00:00:00.000Z",
    "score": 9.5,
    "comments": "Never had so much fun playing a RTS game before.\nRecently I went to the local GameStop to check out if any special sales were going on, and lo and behold it was StarCraft-Mania in there people lining up to get their copies of the newly released StarCraft 2, I really di... ",
    "gameID": 1,
    "author": "Kakaroti4"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2010-09-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "favorite game of all time\nI have been playing this game for about 6 years and I cant stop the lust I have for it. Never once have I felt an urge to stop playing. Even if I am not able to beat very many 1 on 1 matches its LAN and campaign are e... ",
    "gameID": 1,
    "author": "audgess"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2010-09-15T00:00:00.000Z",
    "score": 2.0,
    "comments": "this is a joke right?\nThis joke of an \"expansion addon\" is the reason the developer, Aztech New Media (once an incredibly mediocre bargain developer) is no longer in existence. Even for 1998, Insurrection has incredibly poor production values... ",
    "gameID": 1,
    "author": "pinpointmc"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2010-09-30T00:00:00.000Z",
    "score": 9.5,
    "comments": "Continues the legacy of the original, adds new units and buildings, remains balanced. Solid gameplay.\nThe true goal of any game is to innovate the genre. This game does that and more with a great story and great gameplay. There are 3 playable races in the game, each has their own unique play style along with unique build... ",
    "gameID": 1,
    "author": "FireBaneLuther"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2010-09-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "The true goal of any game is to innovate the genre. This game does that and more with great story and great gameplay.\nThe true goal of any game is to innovate the genre. This game does that and more with a great story and great gameplay. There are 3 playable races in the game, each has their own unique play style along with unique build... ",
    "gameID": 1,
    "author": "FireBaneLuther"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 8,
    "date": "2010-11-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "Starcraft is a exceptional game with three well-balanced races, an exciting story and incredible multiplayer.\n*** STARCRAFT *** THE GOOD -Thrilling story and characters -Three unique and well balanced races -Excellent multiplayer -Outstanding visuals -Exceptional audio and voice acting -Challenging A.I. -Powerful ma... ",
    "gameID": 1,
    "author": "Garrison_Ford"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2010-11-21T00:00:00.000Z",
    "score": 9.0,
    "comments": "Perhaps some of its concept designs may be derivative, but Starcraft\u0027s design formula is still a great innovation.\nThe Warcraft franchise did not exactly amuse the more out-spoken fans of Warhammer Fantasy Battles, but that did not stop Blizzard from crafting (pun intended) an IP that eventually developed an identity of its own, with... ",
    "gameID": 1,
    "author": "Gelugon_baat"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2010-11-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "Where Starcraft did not tidy up, Brood War did so and added more to the formula.\nStarcraft was a much-awaited Blizzard title, so when it was well-received (and sold well), Blizzard just had to make an expansion to further build on the IP that they have created (and earn some more revenue while doing ... ",
    "gameID": 1,
    "author": "Gelugon_baat"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2010-12-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "Definately one of the best RTS games of all time.\nStarCraft is one of the best RTS games of all time because it has 3 diverse but balanced races,a great story and even though I\u0027m not a big fan of multiplayer,StarCraft\u0027s multiplayer is loved by many people around the wor... ",
    "gameID": 1,
    "author": "ZanarkandTidus"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-02-25T00:00:00.000Z",
    "score": 9.0,
    "comments": "The expansion to the greatest RTS has the best story ever developed in a video-game!\nIn Brood War continues the epic saga of the 3 struggling races,Terran,Zerg \u0026 Protoss.If i would have to compare them,they would be like AVP in my oppinion.Starcraft \u0026 it\u0027s Expansion is in fact an Alien vs Predator RTS wi... ",
    "gameID": 1,
    "author": "snes_vs_ps1"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-03-07T00:00:00.000Z",
    "score": 9.5,
    "comments": "Gameplay is very simplistic but intense. This game defines what a real time strategy game should be. Without the fuss.\nYou know that you really love and cherish a game when even if it was release a decade ago you\u0027d still be playing it today despite its outdated graphics and gameplay. This is what the expansion Brood War is all about. ... ",
    "gameID": 1,
    "author": "gba1989"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2011-03-31T00:00:00.000Z",
    "score": 9.5,
    "comments": "no matter how hard starcraft is,it remains forever the best rts of all time!old,but the best!bllizard rules.\nstarcraft is in the top 10-greatest games of all time.i can\u0027t believe it\u0027s only from 1997,it seems like it\u0027s here since the creation of earth!it\u0027s a timeless classic,probably the most played game ever after mario... in ... ",
    "gameID": 1,
    "author": "snes_vs_ps1"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-05-07T00:00:00.000Z",
    "score": 9.5,
    "comments": "\"An expansion to Starcraft? With MORE campagin and MORE units? Bring it!\" Starcraft: Brood War brought it.\n\"An expansion to StarCraft? With MORE campagin? And MORE units?? Bring it!\" Starcraft: Brood War definitely didn\u0027t disappoint! Returning to the story of an intergalactic war between three races, you\u0027re instantly thrust ... ",
    "gameID": 1,
    "author": "Hagosha"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2011-08-31T00:00:00.000Z",
    "score": 10.0,
    "comments": "Every single moment of action and detail is perfect art. A universe of teenage fantasies.\nThe races of this real-time strategy are perfectly balanced. The plot is amazing in every turn and so twisted you don´t get it ´till the fourth play throughout. The characters are so deep and humane you could cry when th... ",
    "gameID": 1,
    "author": "FINginga"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-12-05T00:00:00.000Z",
    "score": 9.5,
    "comments": "After playing it, it is not surprising to see why Starcraft has been such a phenomenon in most of the world.\nOriginal Starcraft game is probably the most valuable and revolutionary game in strategy genre. I think that designing a game with the seemingly simple procedures of collecting and using resources to defeat the enemy was... ",
    "gameID": 1,
    "author": "cenneli"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-12-31T00:00:00.000Z",
    "score": 9.0,
    "comments": "Call in sick for work and lock your doors....\nIn the latest of my \u0027throwback Retro series\u0027, Starcraft reigns as one of the very best games ever released way back when... Even today, over two decades after it was released, Starcraft still stands proud as a highly ... ",
    "gameID": 1,
    "author": "aussieinvader"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-06-06T00:00:00.000Z",
    "score": 9.5,
    "comments": "Great classic, still addictive!\nOne of the first online games that did it right! Starcraft began as a simple game that had a fun storyline along with some of the most impressive characters ever designed. The system requirements were low and playing ... ",
    "gameID": 1,
    "author": "Giantess"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-01-15T00:00:00.000Z",
    "score": 8.0,
    "comments": "Makes a good game even better\ncoming soonreview coming soonreview coming soonreview coming soonreview coming soonreview coming soonreview coming soonreview coming soonreview coming soonreview coming soonreview coming soonreview coming soonreview com... ",
    "gameID": 1,
    "author": "Diggfinger"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-01-15T00:00:00.000Z",
    "score": 8.0,
    "comments": "My fav. strategy game of all times\ncoming soonreview coming soonreview coming soonreview coming soonreview coming soonreview coming soonreview coming soonreview coming soonreview coming soonreview coming soonreview coming soonreview coming soonreview com... ",
    "gameID": 1,
    "author": "Diggfinger"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2015-01-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "The Classic that still has class.\nThis game was the game that got me to like Real-time Strategy games. The Storyline is suspenseful, engaging, and well written, and the gameplay is set up to challenge you, but not be impossibly hard. What\u0027s more, this g... ",
    "gameID": 1,
    "author": "porkchop726"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2017-01-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "Starcraft\nhttp://katiejurek.comI grew up on the chat service for Blizzard games, Battle.net, and I have played this timeless RTS combined with Diablo II for an estimated 10,000 hours (that\u0027s almost 417 days, a lot of which was me ... ",
    "gameID": 1,
    "author": "katiejurek"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-03-23T00:00:00.000Z",
    "score": 9.0,
    "comments": "StarCraft: Brood War review\nG\u0026rsquo;day everyone what is going on its CoGTidyQuotient, and today we are doing a game review on the first StarCraft\u0026copy; game. This game is made on March 31 in 1998, I will be playing the Brood War\u0026copy; expansion, ... ",
    "gameID": 1,
    "author": "cogtidyquotient"
  }
]