[
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-03-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "I think this game has been underrated by critics because they didn\u0027t know the impact it was going to have. It\u0027s an extremely well-balanced game with a great story and gameplay.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-03-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best real time strategy ever.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-04-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "Greatest RTS ever made hands down. This game defines competitive multiplayer, the difference in skill between players is unbelievable, there are guys that can take on 3-4 people at once.... The balance of the game is just about perfect, and the variety and completely different play styles for each race is amazing. 10 years later this game is still so amazing playing online. Warcraft III Greatest RTS ever made hands down. This game defines competitive multiplayer, the difference in skill between players is unbelievable, there are guys that can take on 3-4 people at once.... The balance of the game is just about perfect, and the variety and completely different play styles for each race is amazing. 10 years later this game is still so amazing playing online. Warcraft III added some niceties,,,,some of which went against the competitive nature of this game but in the end this game is a way better competitive experience.… Expand",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-05-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "A decade later and this is still my favorite game of all time and I still play it on a regular basis. The storyline is fantastic, the single player is very rewarding and worth playing through over and over again, the gameplay is perfectly balanced, and so very much fun overall. Even a decade later it still beats the pants off of every other game I\u0027ve played to date. I doubt that even A decade later and this is still my favorite game of all time and I still play it on a regular basis. The storyline is fantastic, the single player is very rewarding and worth playing through over and over again, the gameplay is perfectly balanced, and so very much fun overall. Even a decade later it still beats the pants off of every other game I\u0027ve played to date. I doubt that even the sequel will be better than this game.… Expand",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-06-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "Simply the best RTS of all time. So many permutations one can use in winning the game. Still amazing gameplay after around 10 years.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-07-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "If you can accept the poor graphics in this game, it will blow you away. Each race is totally unique and balanced, and mostly everything that is offered is required to reach victory. Everything has a counter, and taking better positions extremely affects outcome of the battle. Since all statistics and abilities are simple and easily understood, there is no such thing as luck in Starcraft, If you can accept the poor graphics in this game, it will blow you away. Each race is totally unique and balanced, and mostly everything that is offered is required to reach victory. Everything has a counter, and taking better positions extremely affects outcome of the battle. Since all statistics and abilities are simple and easily understood, there is no such thing as luck in Starcraft, and this simplicity makes it perfect. Good multiplayer and custom maps also get this game hard to be bored of.… Expand",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-07-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "I\u0027ve been playing Starcraft since its inception, and now more than 10 years later I still haven\u0027t found a game that is more pleasurable, noob-friendly and yet intricate and involved, and whose graphics have stood the test of time. Blizzard\u0027s best work on show here...and that\u0027s saying something!",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-07-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best RTS of all time... DON\u0027T listen to these idiot \"critics\" (Game Revolution) who only played the game for 2 days to meet a deadline for their boss and only gave it a 75%. Unparalleled online experience in its genre.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-07-14T00:00:00.000Z",
    "score": 9.0,
    "comments": "10 year ago this game came out, and it is still a great game. complex enough that it isn\u0027t a walk through the breeze, but simple enough that everyone can pick up on. Multiplaying is the most challenging aspects of this game considering that you don\u0027t play against the computer\u0027s AI.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-08-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "Hands down the best RTS ever. When it originally came out, I would have agreed with a score of 88, but I had no idea (like a lot of the critics) how big the online competition would become, how much of a social phenomenon the game would be, how the balance would continue to be tweaked to perfection, etc. 10/10",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-09-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is THE RTS. After years it still is fresh and has a cult-like following across the globe. A game has to be amazing to support professional players, which Starcraft does: South Korean professional starcraft gamers have celebrity status and the top make more many than an exec. Now that is gaming!",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-09-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best RTS games ever! 3 completely balanced factions that are extremely distinctive and imaginative. Great gameplay. The graphics may be out of date for sure but 10 years after the original the most amazing game is about to get released. Starcraft 2!!! Fixes all graphical issues and takes the battle to places that can\u0027t be competed with. Adds so much more to the fantasticOne of the best RTS games ever! 3 completely balanced factions that are extremely distinctive and imaginative. Great gameplay. The graphics may be out of date for sure but 10 years after the original the most amazing game is about to get released. Starcraft 2!!! Fixes all graphical issues and takes the battle to places that can\u0027t be competed with. Adds so much more to the fantastic original. 10 years was well worth the wait!… Expand",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-12-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "Ten years later, this is still the RTS I personally recommend. So the graphics aren\u0027t as pretty as other RTS (COUGHTODAYCOUGH), so what? The gameplay is still addicting, some later campaign missions are still difficult compared to other RTS of today, and the three races are virtually perfectly balanced. Not to mention you still have a massive online community for a game ten years Ten years later, this is still the RTS I personally recommend. So the graphics aren\u0027t as pretty as other RTS (COUGHTODAYCOUGH), so what? The gameplay is still addicting, some later campaign missions are still difficult compared to other RTS of today, and the three races are virtually perfectly balanced. Not to mention you still have a massive online community for a game ten years running. But the campaign/story itself. Yes I did say that it would be very challenging later on but the beginning is quite novice friendly with the difficulty. But the story overall will MAKE you want to get Brood War and later SC2 once it comes out in the near future, yes it is a pretty good story. Honestly I don\u0027t think I\u0027ve ever run into a problem in this game. Sure the online connectivity to other users computers can be frustrating once in a while. But even if you took out the online part of the game, the single player part of it is just as fun.… Expand",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-01-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "The score for this game needs to be updated. There is no way its only 88. \"Thank God for cold fusion\" \"You Pig ! ; What? I didn\u0027t say anything. ; no, but you were thinking it ! \" \"I love you sarge\" I lost jobs and GFs for this game. No game ever came close to the perfection of starcraft. Best game ever made. Awesome single player. (with awesome cinematics) Bnet was amazing when SC The score for this game needs to be updated. There is no way its only 88. \"Thank God for cold fusion\" \"You Pig ! ; What? I didn\u0027t say anything. ; no, but you were thinking it ! \" \"I love you sarge\" I lost jobs and GFs for this game. No game ever came close to the perfection of starcraft. Best game ever made. Awesome single player. (with awesome cinematics) Bnet was amazing when SC came out. The ease of finding games. I wonder how many milions of Big Game Hunters matches have been played.… Expand",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 47,
    "helpfulScore": 5,
    "date": "2009-03-01T00:00:00.000Z",
    "score": 4.0,
    "comments": "A very traditional RTS game that brought nothing new to the table. The interface was quite unwieldy and dated considering it came out in 1998. The actual strategy/tactics emphasis was quite low, and battles were mostly stats vs stats and numbers vs numbers.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-04-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Well, what to say thats haven\u0027t been said, I played it for years, first back in the late \u002790 on my old P233 with 32 MB of RAM, was late in high school because of it :-). Have spent on it hours and hours and don\u0027t regret a single minute. By my humble opinion the nearest thing to perfection the game can get and my all time personal favourite. Maybe I\u0027m not 100% objective Well, what to say thats haven\u0027t been said, I played it for years, first back in the late \u002790 on my old P233 with 32 MB of RAM, was late in high school because of it :-). Have spent on it hours and hours and don\u0027t regret a single minute. By my humble opinion the nearest thing to perfection the game can get and my all time personal favourite. Maybe I\u0027m not 100% objective but it is still 100/100 game from it\u0027s huge and interesting singleplayer to multiplayer to expansion Broodwar and hopefully StarCraft 2. Thanks Blizzard. Greetings from Zg.… Expand",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-04-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "I think if the world ended in 1999, the would would not have missed much in terms of P.C. gaming. Fallout 2, Half-Life, Grim Fandango, Balder\u0027s Gate, Thief, Unreal and Starcraft all came in 1998. Starcraft had a killer matchmaking system and A.I. Coupled with diverse units, races and maps. Ran on a low end machine and was fun, fun, fun. A good fulfilling single player campaign to I think if the world ended in 1999, the would would not have missed much in terms of P.C. gaming. Fallout 2, Half-Life, Grim Fandango, Balder\u0027s Gate, Thief, Unreal and Starcraft all came in 1998. Starcraft had a killer matchmaking system and A.I. Coupled with diverse units, races and maps. Ran on a low end machine and was fun, fun, fun. A good fulfilling single player campaign to round it out.… Expand",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-05-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "What hasn\u0027t been said? I played it for years at end, I don\u0027t regret all the time which was spent on the multiplayer. It set the standards for any RTS, it revolutionized the entire genre.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-06-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "Rash M obviously doesn\u0027t know anything about Starcraft. \"The actual strategy/tactics emphasis was quite low...\" Are you kidding me? Starcraft is the ONLY RTS which has been in every single WCG. No emphasis on strategy/tactics, psh. Don\u0027t judge something you obviously have no idea about. Starcraft is by far, the most complete, most balanced RTS ever made. After 10 years, Rash M obviously doesn\u0027t know anything about Starcraft. \"The actual strategy/tactics emphasis was quite low...\" Are you kidding me? Starcraft is the ONLY RTS which has been in every single WCG. No emphasis on strategy/tactics, psh. Don\u0027t judge something you obviously have no idea about. Starcraft is by far, the most complete, most balanced RTS ever made. After 10 years, Starcraft is still being revolutionized in terms of gameplay. If you don\u0027t believe me, just look at the Korean Starcraft scene. This game is golden.… Expand",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 28,
    "helpfulScore": 1,
    "date": "2009-06-12T00:00:00.000Z",
    "score": 0.0,
    "comments": "I bought this game and though it was going to be a cool game like halflife but instead I got some crappy graphics game with some guys running around on a dirty map Waste of money, DO NOT GET IT",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-07-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "A timeless masterpiece. At the time of writing, StarCraft is 11 years old. I still play it to this day. The perfectly balanced gameplay never gets dull or boring. I hope StarCraft II will be able to live up to its predecessor.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 28,
    "helpfulScore": 3,
    "date": "2009-08-19T00:00:00.000Z",
    "score": 5.0,
    "comments": "Starcraft had a solid potential to be an epic RTS game but unfortunately the vast amount of hype surrounding it seems misplaced. The game plays like any other RTS of the time, many people claim that Starcraft was the first RTS ever made, which again seems to be an example of fan boys over hyping the game. The first real RTS is arguably Dune 2, or it\u0027s later spin-off Command \u0026 Starcraft had a solid potential to be an epic RTS game but unfortunately the vast amount of hype surrounding it seems misplaced. The game plays like any other RTS of the time, many people claim that Starcraft was the first RTS ever made, which again seems to be an example of fan boys over hyping the game. The first real RTS is arguably Dune 2, or it\u0027s later spin-off Command \u0026 Conquer. This is my main problem with Starcraft, there is virtually no originality in it. The gameplay seems to be a direct rip-off of Command \u0026 Conquer, with the races all being a cheap rip-off of three of the races from Warhammer 40,000. The actual gameplay in Starcraft seems pretty solid but once you realise that the Blizzard almost completely copy and pasted other content into the game it soon loses all it\u0027s appeal. Also what annoys me, and this has nothing to do with Blizzard is the majority of fanboys who flame anyone who disagrees with Starcraft being a perfect game. Perhaps if you opened your eyes to other games you\u0027d enjoy gaming more. I have respect for Rash M\u0027s review as he seems to also not be brainwashed by Blizzards attempted epic.… Expand",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-10-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best RTS Game ever made, i must agree that the score needs to be updated 88 is simply too low. this is easily one of the best video games ever created and is the best multiplayer game ther is, no question. it is so balanced, and it is complex enough to make you think and stategize against others, but it is easy enough to learn without too much trouble. Double thumbs up and 11 ot of 10",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-11-06T00:00:00.000Z",
    "score": 9.0,
    "comments": "A completely new, incredibly innovative, absolutely must-have game for the PC. With a massive amount of maps and an overall decent online experience, this game should not be overlooked. If you don\u0027t know Starcraft, you don\u0027t know RTS.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-11-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "Good plot, interesting campaign, great playability. As singleplayer this game is great strategy, need thinking and planning (especially in Brood War), and does have THIS. Even it\u0027s really primitive, it\u0027s great, I can hardly understand, why it\u0027s so addicting, but it realy is. As a multiplayer: it\u0027s not a strategy, it requires to much agility (\u003e250apm is for people with Good plot, interesting campaign, great playability. As singleplayer this game is great strategy, need thinking and planning (especially in Brood War), and does have THIS. Even it\u0027s really primitive, it\u0027s great, I can hardly understand, why it\u0027s so addicting, but it realy is. As a multiplayer: it\u0027s not a strategy, it requires to much agility (\u003e250apm is for people with ADHD, not for strategists).… Expand",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2009-11-27T00:00:00.000Z",
    "score": 7.0,
    "comments": "What makes StarCraft stand out is it brilliant campaign. The briefings are boring, which adds simply nothing, you can say. The gameplay seems tedious, the process getting easier and not so hard campaign. The story is great although at some point confusing. Overall I give 7, something I didn\u0027t expect from Blizzard.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-12-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "StarCraft became more than a game. Became the reference in competitive gaming, leading a revolution in what we know today as e-Sports, giving birth to legends such as Lim Yo-Hwan. This masterpiece is arguably one of the greatest games ever made. For me, it is.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2010-01-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best games I have ever played...not the first of it\u0027s kind, but arguably the best of it\u0027s kind!",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 10,
    "date": "2010-08-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is never getting old :) Now that SC2 is finally out I put my Starcraft cd-s onto my shelves.. One week before Starcraft 2 Beta I was still playing with the 1st sequel and i have been creating and scripting custom maps for that game for years!! Love the feeling, epic ending, characters, stories, races, music, cutscenes and everything about this game!",
    "gameID": 0,
    "author": "tsabszy"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2010-10-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "I still remember coming home from school to play this game with friends and stopping just in time for bed time and thinking \"I forgot to eat again\" ah the good days~",
    "gameID": 0,
    "author": "Tubie"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2010-12-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "Even this game is pushing on 13 years old it is still one of the best RTS games ever released for PC/MAC, and until Starcraft II, the best game released by Blizzard ever!",
    "gameID": 0,
    "author": "Fuzzi99"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-05-29T00:00:00.000Z",
    "score": 9.0,
    "comments": "One of greatest RTS of all time, but personally im not a big fan of how its all about APM. \"You snooze, you lose\" is very accurate for this game, you must be 100% focused when playing it. No wonder its treated more as a sport than a game.",
    "gameID": 0,
    "author": "Pomornik"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-07-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "I used to play this game back in the day with an old friend of mine, this game was just plain fun at the time it was a must have if you like strategy games.",
    "gameID": 0,
    "author": "snowshreder"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-07-20T00:00:00.000Z",
    "score": 9.0,
    "comments": "This has to be the best RTS iv ever played! 3 different chapters with 3 different groups and some levals that you really got to put up a good fight and make good strategy\u0027s and decisions and just a really fun game, it even has multiplayer if you get bord with the campain. Create classes, make building to help further your base and then destroy the enemy. This is a really solid PC game.",
    "gameID": 0,
    "author": "DWlubu1998"
  },
  {
    "helpfulCount": 31,
    "helpfulScore": 7,
    "date": "2011-08-19T00:00:00.000Z",
    "score": 2.0,
    "comments": "a very overrated game. even at the time it was made, it had poor graphics, horrible UI, just plain annoying resource collection. ridiculously low unit cap (there are 20 people on the ENTIRE PLANET) terrible unit AI requiring silly amounts micromanagement. has a horrible case of scissors paper rock, made worse by the small selection of units. it has two saving graces- firstly its story isa very overrated game. even at the time it was made, it had poor graphics, horrible UI, just plain annoying resource collection. ridiculously low unit cap (there are 20 people on the ENTIRE PLANET) terrible unit AI requiring silly amounts micromanagement. has a horrible case of scissors paper rock, made worse by the small selection of units. it has two saving graces- firstly its story is fairly ok, but this is fairly extraneous on a multiplayer oriented game. secondly, it has the best support for any game ever. but while lack of polish can break a game, lots of polish does not make a game… Expand",
    "gameID": 0,
    "author": "stinky"
  },
  {
    "helpfulCount": 21,
    "helpfulScore": 15,
    "date": "2011-09-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "AMAZING!!! even better than WOW!!!",
    "gameID": 0,
    "author": "grandpajoe6191"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-10-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "Blizzard had become the evil empire of gaming, perhaps even more so than EA since the release of WoW - but you cannot deny the incredible ingenuity and epic scope of the games they made before that time. Starcraft was not the first RTS that Blizzard made (all the Warcraft titles) but was certainly the best. Anyone criticizing this game for anything needs to have their head hit against aBlizzard had become the evil empire of gaming, perhaps even more so than EA since the release of WoW - but you cannot deny the incredible ingenuity and epic scope of the games they made before that time. Starcraft was not the first RTS that Blizzard made (all the Warcraft titles) but was certainly the best. Anyone criticizing this game for anything needs to have their head hit against a wall. This game is so good, it is literally a national sport in Korea. The guys who win the national championship for this game are put on the Wheaties box - yes, just like Olympic athletes. Unreal. This is one of the best games ever, and certainly the best RTS ever - the incredible balance of the game has never been equaled since. Play this game now - then go play StarCraft II, it is not as good, but far more updated.… Expand",
    "gameID": 0,
    "author": "Humboldt1337"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-11-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best RTS period! Drop a copy on any old computer you can find and give away! Put a copy on your new computer for nostalgia! This old game don\u0027t really get that old.",
    "gameID": 0,
    "author": "YeshuaAgapao"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-01-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best RTS ever released for a few simple reasons. Its 3 solo campaigns are perfectly balanced from start to end, perfectly scripted, versatile, challenging and supported by an intense storyline that easily outshines other rts. Multiplayer and matchmaking was close to beeing perfectly balanced on release and just needed a few minor fixes to reach a level that allowed starcraft to be the nr.1Best RTS ever released for a few simple reasons. Its 3 solo campaigns are perfectly balanced from start to end, perfectly scripted, versatile, challenging and supported by an intense storyline that easily outshines other rts. Multiplayer and matchmaking was close to beeing perfectly balanced on release and just needed a few minor fixes to reach a level that allowed starcraft to be the nr.1 platform for competetive gaming in rts genre. Every single unit of the 3 races in this game has its value and it is just up to the player if he can make use of it or not. A hand full of the cheapest units can be enough to win a game even after a long game of for example an hour. This is also what seperates starcraft from other games.… Expand",
    "gameID": 0,
    "author": "Kirase"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-01-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "Epic. After almost 14 years, I still play it with my friends. Although his game created e-sports thanks to battle.net, its best multiplayer mode is LAN! LAN ftw!",
    "gameID": 0,
    "author": "JudgeHolden"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-02-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "Classic game. Best RTS ever. On the golden table in Hall of fame for PC games. Just one word: Starcraft ! 10 of 10 and no other mentions to consider).",
    "gameID": 0,
    "author": "Kosheus"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-03-09T00:00:00.000Z",
    "score": 9.0,
    "comments": "Blizzard is master at creating games that require skill, thinking or planning. Starcraft requires all of them and plays out beautifully, on top of a good story.",
    "gameID": 0,
    "author": "BoltzmannBaby"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2012-04-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "Great singleplayer coupled with great mutliplayer creates an experience like no other. The music is great, the gameplay is fluent and solid. You\u0027ll have a ton of fun playing it.",
    "gameID": 0,
    "author": "Helmore"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2012-04-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "Starcraft is truly a landmark RTS game, and an absolute joy to play. I have spent hour upon hour playing this game and every moment was worth the experience. Even today Starcraft is still played, which is a testament to it\u0027s brilliant design.",
    "gameID": 0,
    "author": "Everlong"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-06-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "Starcraft is a classic. Today,it is still one of the most popular franchises in the world! Yes its player base is set mostly in south Korea, but the skill involved in veteran game play is unbelievable! Imagine playing any other game with over 300 APM, not many games can claim that. It\u0027s too bad Blizzard (the producers of the game) set their sights on other projects including Diablo III andStarcraft is a classic. Today,it is still one of the most popular franchises in the world! Yes its player base is set mostly in south Korea, but the skill involved in veteran game play is unbelievable! Imagine playing any other game with over 300 APM, not many games can claim that. It\u0027s too bad Blizzard (the producers of the game) set their sights on other projects including Diablo III and Starcraft 2 - it\u0027s projected to die within the year.… Expand",
    "gameID": 0,
    "author": "Realistic123"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-07-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is truly the best RTS out there. Its very skill based game with a really competitive game design combined with a balanced unit design. Just watching the games of competitive players is fun and entertaining.",
    "gameID": 0,
    "author": "Zelosfan"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-07-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "The prefect balanced RTS with 3 really different play style ! This game is only really polished with the units of the sequel (Brood Wars). Even i tested a lot of others RTS (included Blizzard ones) that one is for me the best balanced !",
    "gameID": 0,
    "author": "ssstevee"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-09-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "I have put more time into this game than any other game I\u0027ve ever played, and that\u0027s saying a lot. This along with Chrono Trigger are the best childhood gaming memories I have. This game seriously does not get old, to this day I love playing on BattleNet when nerds aren\u0027t spam hacking the game list, and the UMS aspect of the game I think is one of its greatest features and one of theI have put more time into this game than any other game I\u0027ve ever played, and that\u0027s saying a lot. This along with Chrono Trigger are the best childhood gaming memories I have. This game seriously does not get old, to this day I love playing on BattleNet when nerds aren\u0027t spam hacking the game list, and the UMS aspect of the game I think is one of its greatest features and one of the greatest features of any video game in history.… Expand",
    "gameID": 0,
    "author": "chronoT"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-11-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "Greatest game ever made. Nothing will ever beat the community of good ol\u0027 b.net 1.0.",
    "gameID": 0,
    "author": "Audius"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-11-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "I remember playing this game for hours after it was released i enjoyed the multiplayer/map editor the most. It is one of the best RTS games created and well worth the time playing. It was not my favorite but it is a game that is very enjoyable to play.",
    "gameID": 0,
    "author": "njkk"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-12-11T00:00:00.000Z",
    "score": 8.0,
    "comments": "This game is very good. Its\u0027s frustratingly hard, but it has solid gameplay and challenges the mind to think unlike any other game I\u0027VE played. I\u0027m not very good though and it is difficult to learn and master, so prepare to spend lots of time just learning basics. It is a good game non the less, though.",
    "gameID": 0,
    "author": "Valiko"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-01-24T00:00:00.000Z",
    "score": 9.0,
    "comments": "I really find it funny how some recent reviews criticize this game. I got this game the day it originally came out. And it was absolutely amazing! Up until then, almost all RTS games were just Command \u0026 Conquer clones, and the ones that weren\u0027t were usually bad. Starcraft revolutionized the RTS industry, showing developers everywhere: Hey, Westwood aren\u0027t the only ones who can do it. ToI really find it funny how some recent reviews criticize this game. I got this game the day it originally came out. And it was absolutely amazing! Up until then, almost all RTS games were just Command \u0026 Conquer clones, and the ones that weren\u0027t were usually bad. Starcraft revolutionized the RTS industry, showing developers everywhere: Hey, Westwood aren\u0027t the only ones who can do it. To date this is still one of my favorite games of all time and I still prefer it to its sequel. To anyone who speak hate of this game, well, I feel sorry for you. a shame you\u0027ll never have a real appreciation for games. Overall: A fantastic RTS game that will be treasured classic for anyone with taste.… Expand",
    "gameID": 0,
    "author": "Rox22"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2013-01-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best game ever made. Will never be surpassed. Period.",
    "gameID": 0,
    "author": "deadlockedworld"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2013-03-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "Easily the best RTS game in history. Not for the faint of heart. For mavericks only. If you are a candle in the wind, this game is not for you. However if you consider yourself not to be a grab it and have fun",
    "gameID": 0,
    "author": "Wonder_Boy"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2013-03-17T00:00:00.000Z",
    "score": 9.0,
    "comments": "Even after 10 years, this is still a standout title. It\u0027s aged very very well. One of those games that you can\u0027t stop playing. It\u0027s an absolutely perfect example of easy to learn, hard to master, there\u0027s something here for anyone with any interest in RTS. Still doesn\u0027t look too bad graphically, well except for the cutscenes. After the first mission theres one in particular where the peopleEven after 10 years, this is still a standout title. It\u0027s aged very very well. One of those games that you can\u0027t stop playing. It\u0027s an absolutely perfect example of easy to learn, hard to master, there\u0027s something here for anyone with any interest in RTS. Still doesn\u0027t look too bad graphically, well except for the cutscenes. After the first mission theres one in particular where the people are so badly rendered and the dialogue is so hilarious I was busting my sides. Even the better people look ridiculous. Blizzard had a nasty habit of having horribly modeled people with freaky faces. It\u0027s a really awesome game though, and I really suggest it to anyone.… Expand",
    "gameID": 0,
    "author": "Nosirrah123"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-04-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "Back in the days when Blizzard were still small guys trying to make a living, they gave the world one of the best games there is. Enter StarCraft. With interesting story, addictive gameplay, this masterpiece was easy to learn and hard to master. Both unforgivable and rewarding, there was nothing like clash of massive armies, one of which you spend skill and resources to build, andBack in the days when Blizzard were still small guys trying to make a living, they gave the world one of the best games there is. Enter StarCraft. With interesting story, addictive gameplay, this masterpiece was easy to learn and hard to master. Both unforgivable and rewarding, there was nothing like clash of massive armies, one of which you spend skill and resources to build, and controlled at your best. Immersing yourself in Koprulu sector for battles, everyday after school with your friends, building precious memories and nostalgia of a time when Blizzard did give a damn for you. These were the golden ages of multiplayer, and StarCraft was one of the giants. With time the game became a cult, a passion, a sport, a legacy which to this day is cherished, loved, respected. Today, the mighty Blizzard have fallen, they are nothing but a former glory, a shadow of once a great giant committed to deliver to his followers... But still, if you didn\u0027t play this game do yourself a favor, and taste what was Blizzard at it\u0027s best!… Expand",
    "gameID": 0,
    "author": "ClaySoldier"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-05-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "This game is a good RTS. There are many people who play the game today. It has a good storyline. The graphics and cinematic were good as well. Voice acting brought a new experience and leaves you to play more. I would recommend this game!",
    "gameID": 0,
    "author": "Nickkix37"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-06-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "I\u0027ve spent so many hours of my life on this game, I may as well have gone pro. So much fun to play in LAN with your friends. Great storylines for each race, all interwoven together nicely, and very memorable characters. The graphics were fantastic for its time, I remember being very impressed by how realistic it all looked when I first played this. Now of course it looks dated and old, butI\u0027ve spent so many hours of my life on this game, I may as well have gone pro. So much fun to play in LAN with your friends. Great storylines for each race, all interwoven together nicely, and very memorable characters. The graphics were fantastic for its time, I remember being very impressed by how realistic it all looked when I first played this. Now of course it looks dated and old, but they don\u0027t call it a classic because it\u0027s new; it\u0027s old! But it never gets old. Haha I no longer play the original, but I still have the CD and only uninstalled it finally about four years ago. I play SC2 now. You could probably get this basically for free from a friend or online and if you love RTS games, you cannot go wrong with Starcraft.… Expand",
    "gameID": 0,
    "author": "Toffenuff"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-06-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "If pro players can make a LIVING off of this game, you know that something is right about this game. One of the if not the best RTS game made in a very, very long time.",
    "gameID": 0,
    "author": "Red-Rocket"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-11-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "Single Player/Multi Player (2/2) (If the single player is better than the multiplayer, review this section as if it had no multplayer) (If the multiplayer is better than the multiplayer, review this section as if it had no single player) Gameplay (2/2) Visuals/Story (1/2) (If the visuals are better than the story, review this section as if it had no story) (If the story isSingle Player/Multi Player (2/2) (If the single player is better than the multiplayer, review this section as if it had no multplayer) (If the multiplayer is better than the multiplayer, review this section as if it had no single player) Gameplay (2/2) Visuals/Story (1/2) (If the visuals are better than the story, review this section as if it had no story) (If the story is better than the visuals, review this section as if the visuals didn’t matter) Accessibility/Longevity (2/2) (Review this section only on Accessibility if the game has no longevity) (Review this section only on longevity if the game isn’t accessible) Pricing (2/2) Wildcard (0) This is a guideline for how to properly review games. Many reviewers like to get a “feel” for a game, and arbitrarily give a game a score that they believe it deserves. This results in wildly different scores between different reviewers, and vastly different scores between similar games. This guideline addresses these problems and scores games fairly and consistently. This guideline also gives scores that are usually similar to the metacritic score. The review score is based out of 10 points. There are no “half” or 0.5 increments. It is impossible to have a score above 10 or below 0. The review score will change as the game gets new dlc, drops in price, or if more secrets are found through the game increasing its appeal. The scoring is split into 6 sections. The first five sections can add a possible 2 points to the final score. The first 5 sections are Single Player/Multi Player, Gameplay, Visuals/Story, Accessibility/Longevity, and Pricing. Notice that 3 of these sections have two parts. These particular sections will be scored based on the stronger part of the game of the two. For example, if a game has a lousy single player campaign, but an excellent multiplayer component, that section will be based solely on the multiplayer as if the single player did not exist. This allows games to be based on their own merits, as many unnecessary features are shoehorned into video games by publishers to reach a “feature quota”. Games that excel in both areas of a section don’t receive should be noted in the written review, but cannot increase the score past 2 in that section. However, it can be taken into account in the final section The final section can add 1, add 0, or subtract 1 to the final score. This final section is the “wildcard” section. This section is for how the reviewer “feels” about the game, but limits this only to this section, rather than the entire 10 point review. This section can include any positive or negative point that was not covered in the previous 5 sections.… Expand",
    "gameID": 0,
    "author": "SupaChigga"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-11-24T00:00:00.000Z",
    "score": 8.0,
    "comments": "Popular at the same time with Age of Empires. Two great RTS games with different backgrounds. The unit building process and technology tree in Starcraft are much simpler, allowing the players to put more emphasis on how to win the battles.",
    "gameID": 0,
    "author": "gzy91"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2014-02-28T00:00:00.000Z",
    "score": 6.0,
    "comments": "15 years ago i have putted 8/10. It is still the best RTS game for strategy with the expansion pack Brood War. Very nice missions. Good story line. Balanced races. less : graphics, need to build from scratch in pvp which is annoying (like other RTS games) Game play : 7/10, graphics : 3/10, background : 7/10, lifetime : 7/10, sound : 7/10",
    "gameID": 0,
    "author": "aatassi"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2014-03-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "It\u0027s almost exactly like diablo 2... This game was one of the best of its time... If you go play starcraft or diablo 2 now its full of hackers but in its time it was the best thing you could get. Personally i would still play it over a lot of new games.",
    "gameID": 0,
    "author": "Lord174"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2014-04-05T00:00:00.000Z",
    "score": 8.0,
    "comments": "This game is awesome, but it really doesn\u0027t deserve as much attention as it has now. I have never played an RTS game that is as balanced as Starcraft. Even Starcraft 2, the acclaimed sequel to the game, can\u0027t beat it. Which is surprising, really, since everyone expected Blizzard to learn from their mistakes. Now, I\u0027ve hear many idiots that say that this game is the traditional statsThis game is awesome, but it really doesn\u0027t deserve as much attention as it has now. I have never played an RTS game that is as balanced as Starcraft. Even Starcraft 2, the acclaimed sequel to the game, can\u0027t beat it. Which is surprising, really, since everyone expected Blizzard to learn from their mistakes. Now, I\u0027ve hear many idiots that say that this game is the traditional stats vs. stats and numbers vs. numbers. Nothing could be further from the truth. If you understand the speed and quality of each individual unit, the game could be so much more than just the free-for-all that many have chosen to make it. \"If you like it so much, then why do you say that it doesn\u0027t deserve publicity?\", you may ask? Because it\u0027s just a game. Honestly, people have been making RTS games similar to Starcraft for years. It\u0027s just the fact that Starcraft does it a little better than the average RTS game. Nothing to it. I\u0027m going to go ahead and give it a 8, just because I spent a lot of time enjoying it. Definitely not a waste of money.… Expand",
    "gameID": 0,
    "author": "FireBirdx2"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-04-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best RTS game ever.Very good game balance.3 race with different gameplay, in 1998 it was revolution.Also it perfect Multiplayer perfect game game.Fast and hardcore.",
    "gameID": 0,
    "author": "bookreade"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-05-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "Back in the good old days where Blizzard actually knew how to make good games and not ONLY care about money but the gamers as well. This has no DRM on there(Except for the Regular one time CD key) unlike SC2 and has greater versatility(you can play on your laptop were ever you want) You could play on as many computers as you want you could trade it in you dont an account just the game running.",
    "gameID": 0,
    "author": "Hitlerisgreat"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2014-07-01T00:00:00.000Z",
    "score": 6.0,
    "comments": "i don\u0027t really see how this is a star of the RTS genre there isn\u0027t much strategy, as the only real units you train are your first ones (I.E marines and zerglings) that\u0027s spam, not strategy.",
    "gameID": 0,
    "author": "Sensless"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-08-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "To this day the best multiplayer strategy game of all time. 3 completely different factions, yet perfectly balanced, still not sure how they achieved this, but it\u0027s a huge achievement. Incredibly fun, playable and fantastic on every level. The visuals, music, all the different troops with their voices, cinematics. The single player campaign was good, but it\u0027s the multiplayer that turnedTo this day the best multiplayer strategy game of all time. 3 completely different factions, yet perfectly balanced, still not sure how they achieved this, but it\u0027s a huge achievement. Incredibly fun, playable and fantastic on every level. The visuals, music, all the different troops with their voices, cinematics. The single player campaign was good, but it\u0027s the multiplayer that turned Starcraft into a timeless classic. 10/10… Expand",
    "gameID": 0,
    "author": "DeusXCom"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-10-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the top 5 genre-defining strategy games, well up there with Supreme Commander, Total Annihilation, Command and Conqueror, Dune, etc. Any serious fan of strategy games owes it to themselves to play this - it is the source of many of the genre\u0027s conventions. The graphics are dated, yes, but everything else is of legendary quality, and you can pick it up fairly cheaply nowadays.",
    "gameID": 0,
    "author": "Dozmo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2014-10-25T00:00:00.000Z",
    "score": 8.0,
    "comments": "i played this game for thousands of hours since release. now it may look very dated compared to other rts games but still it was very good for its time, for me its up there with RA, AoE, RoC.",
    "gameID": 0,
    "author": "yuya88"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2014-11-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Simply put, Starcraft is the finest game ever to be made. People have literally died from playing too much Starcraft. It essentially created eSports. It popularized RTS (real-time strategy) games. The balanced asymmetry was truly a unique feature, one that has been difficult for other studios to emulate. The use-map settings created an incubator in which entire genres of games wereSimply put, Starcraft is the finest game ever to be made. People have literally died from playing too much Starcraft. It essentially created eSports. It popularized RTS (real-time strategy) games. The balanced asymmetry was truly a unique feature, one that has been difficult for other studios to emulate. The use-map settings created an incubator in which entire genres of games were produced. Starcraft is the father of modern gaming.… Expand",
    "gameID": 0,
    "author": "Gregon"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2014-11-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Starcraft is a challenging yet fun-to-play Real Time Strategy game. It is especially enjoyable when playing the multiplayer with friends or online opponents.",
    "gameID": 0,
    "author": "WarcraftAwesome"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2015-01-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "Starcraft is generally considered to be the greatest RTS games of all time, along with its sister, Warcraft 3. Starcraft left a lasting impact on gaming. During this time period - the golden age of games - we saw the rise of online competitive play. Starcraft single handidly took over an entire country (Korea) to become an actual e-sport, and with Unreal Tournament (online competitiveStarcraft is generally considered to be the greatest RTS games of all time, along with its sister, Warcraft 3. Starcraft left a lasting impact on gaming. During this time period - the golden age of games - we saw the rise of online competitive play. Starcraft single handidly took over an entire country (Korea) to become an actual e-sport, and with Unreal Tournament (online competitive FPS) helped spawn an entire new sporting industry. Starcraft helped catapult Battle.net to THE place to go for online gaming at the time. The visuals, music, gameplay and story is masterfully done. Blizzard during the late 90\u0027s was unstoppable. This, Warcraft 2 and 3, and Diablo. Starcraft is considered to be the pinnacle of pure RTS gameplay. There are other titles out there (most notably Command and Conquer) but Starcraft stands head and shoulders above the rest. I personally have played much more WC3 than Starcraft, but I have immense respect for the game and recognize it\u0027s accomplishments. Anything less than a 10/10 is a travesty for this game. This is all that needs to be said.… Expand",
    "gameID": 0,
    "author": "Ghost67"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2015-03-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "On of the Best of not the BEST RTS game ever made. Revolutionary. This was in an age when developers produced high quality games and before publishers turned into greedy bastards they are today.",
    "gameID": 0,
    "author": "TommyTanker"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2015-05-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best RTS in existance, and only one of three RTS I was able to finish without any cheat codes. Challenging, yet playable, unlike the expansion.",
    "gameID": 0,
    "author": "KurtisStryker"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2015-06-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Well, we have an RTS that people still playing since 1998 (even after Starcraft II). It popularized RTS and invented the e-Sports category because of its unique balanced asymmetric factions. I grew up with this game, the online is perfect but the LAN is the most enjoyable multiplayer with friends in cyber-coffee or at our homes, the map editor gave thousands of additional hours of fun!",
    "gameID": 0,
    "author": "Vamrem"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-09-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best RTS games of all time. Three unique races, great story, graphics which I think look good if not great, beautiful music which really fits the world. Great campaign with interesting missions.",
    "gameID": 0,
    "author": "DREST"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2015-11-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "Starcraft is undoubtedly the best Real Time Strategy series ever made. There is no RTS game which can match the Starcraft series in any term, from storytelling, to creativity or gameplay. The most considerable characteristic in Starcraft is the unmatched complexity and diversity between the races/factions which no RTS game before could reach or ever will. But even such an excellent gameStarcraft is undoubtedly the best Real Time Strategy series ever made. There is no RTS game which can match the Starcraft series in any term, from storytelling, to creativity or gameplay. The most considerable characteristic in Starcraft is the unmatched complexity and diversity between the races/factions which no RTS game before could reach or ever will. But even such an excellent game has minor flaws such as the ridiculously stupid pathfinding, which was pretty normal back in the 1990\u0027s, but still is very annoying when units block each other and some units don\u0027t find their assigned destination at all.… Expand",
    "gameID": 0,
    "author": "Tuz0"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-12-06T00:00:00.000Z",
    "score": 9.0,
    "comments": "Man. i love this game. And i am not even an RTS fan :)) can\u0027t say enough about this classic. Play it, play it, plat it! Yes. i know it\u0027s 2016. PLAY IT! :))",
    "gameID": 0,
    "author": "GolovA"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2016-03-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "Definetely one of the best RTS\u0027s ever, right next to Warcraft III in my opinion. Campaign is great, a lot of missions, great storyline, only the voice-acting seemed a bit off for me, but overall it was grat. And what to say about multi-player... this is the definition of competitive gaming, if you want high level competition it won\u0027t get any better than with this game, at least back in theDefinetely one of the best RTS\u0027s ever, right next to Warcraft III in my opinion. Campaign is great, a lot of missions, great storyline, only the voice-acting seemed a bit off for me, but overall it was grat. And what to say about multi-player... this is the definition of competitive gaming, if you want high level competition it won\u0027t get any better than with this game, at least back in the day, don\u0027t know how it\u0027s like nowadays.… Expand",
    "gameID": 0,
    "author": "ThecriticGoD"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2016-07-30T00:00:00.000Z",
    "score": 9.0,
    "comments": "Recensione temporanea da sostituire non appena disponibile quella definitiva. Recensione temporanea da sostituire non appena disponibile quella definitiva.",
    "gameID": 0,
    "author": "zampaconi"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2016-08-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "Si bien siempre me gustó mas la saga Command and Conquer, debo reconocer que este juego es probablemente el mejor juego de estrategia de la historia, no solo por su interface que es genial sino también por su estética y sus diferencias estructurales entre la jugabilidad de cada raza.",
    "gameID": 0,
    "author": "Leoka"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2017-05-04T00:00:00.000Z",
    "score": 9.0,
    "comments": "Uno de los mejores juegos de estrategia en tiempo real de la historia. Imprescindible. Una historia bien elaborada, con especies dotadas de un carácter propio, una estética bastante peculiar y un estilo de juego adictivo e inteligente.",
    "gameID": 0,
    "author": "angelss_13"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2017-09-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "Starcraft, as almost anyone who grew up playing it will tell you, is one of the most important RTS games of all time. In this reviewers opinion, it is one of the best and most important games of all time across any genre, or platform. And what modern gamers need to understand, is that discussing Starcraft in this way is a bit like trying to explain to young boxing fans why fighters likeStarcraft, as almost anyone who grew up playing it will tell you, is one of the most important RTS games of all time. In this reviewers opinion, it is one of the best and most important games of all time across any genre, or platform. And what modern gamers need to understand, is that discussing Starcraft in this way is a bit like trying to explain to young boxing fans why fighters like Floyd Mayweather Jr would never stand a chance against legends like Rocky Marciano from the past. The reason is simply that games like this one were successful in a time where the competition was intense. In the 90\u0027s, gaming graphics were overall still pretty terrible. 3D gaming was limited in its capabilities, and still mostly relegated to the FPS genre. As a result, the decade produced some of the finest RTS games to have ever been designed before or since. Games like those in the Civilization franchises, the Red Alert Franchise, Warcraft, and others all were incredibly popular, and innovative for the time. So when I describe Starcraft as the king of RTS, I say that will the weight of a champion who has bested not only its peers of the day, but those who are considered among the best that have ever been. Frankly, this game is 20 years old, and I feel a review on the nature of its play is virtually irrelevant at this point. But I will say that despite its age, it continues to feel enjoyable to play even now. The greatest bulk of this game\u0027s design was in the replayability factor. It\u0027s simply off the charts. It is still played around the world to this day, professionally and there is ample reason why. As a young gamer, I knew what Starcraft was. Starcraft was the modern day Chess...except there were 3 unique armies, instead of one. In this way, and on a cubic scale, Starcraft will continue to be important in the same way Chess has been for centuries, for years to come. It\u0027s no coincidence that the re-mastered edition has only just come out, and in time I predict we will see that that release is just the first of many re-releases of what is unequivocally the best RTS ever made. Why do I keep saying that? Its re-playable, yes. But why? Simple. It\u0027s the most balanced game to ever be built. In any game system, in any genre, anywhere across time, you will see flaws in any system wherein differing groups are sent to face one another. Whether you look at games like Street Fighter or Tekken, or others like Call of Duty or even any given pinball machine, there will always be an *optimal* approach, race, character, or design which is simply superior to all others in the game. Inevitably, the game becomes more of a competition of who is the best at using that particular configuration to win. But Starcraft proved that games *could* be made which lacked this fatal flaw. While many players on the professional level seem to believe that the Zerg race offers an overall slight edge, this may be more about the likely psychological preferences of the kinds of players who are the best in the world, rather than a true edge inherent in that species. Moreover, outside the realm of top 1% of professional gamers, the rest of us will gladly be able to enjoy a seamlessly perfect warfare, with each race inhabiting unique advantages and challenges to overcome, as well as intricate and various means by which to counter any given enemy assault or defense. In spite of all the complexities the game offers though, the end result is the same: A simple to pick up, difficult to master, masterpiece of RTS perfection which will forever be the yard stick by which its successors will be measured. As a fan of all races, but one who\u0027s heart will forever belong to the mighty Terrans, I will finish off this review with a \"Shields up, weapons online!\" \"Awwww yeah!\"… Expand",
    "gameID": 0,
    "author": "Arbiter61"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2017-09-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "As close to perfect as anybody can make, StarCraft is the legacy Blizzard has long since tried to replicate. Three balanced races, a stunning single-player story and endless LAN potential make this the definitive RTS. In fact, it\u0027s fair to say that it\u0027s the only game of the genre that survived the DOTA map in WarCraft III that caused a transition from RTS to MOBA. The game has justAs close to perfect as anybody can make, StarCraft is the legacy Blizzard has long since tried to replicate. Three balanced races, a stunning single-player story and endless LAN potential make this the definitive RTS. In fact, it\u0027s fair to say that it\u0027s the only game of the genre that survived the DOTA map in WarCraft III that caused a transition from RTS to MOBA. The game has just been re-released and it is as compelling as ever - a game that is unmatched before or since.… Expand",
    "gameID": 0,
    "author": "Yukle"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2017-12-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "Great game, love the artwork, storyline, grit and everything else this game has to offer. I wish blizzard would revist why starcraft 1 was so much better than starcraft 2, and diablo 1-2 were so much better than diablo 3. It seems blizzard drops the ball on franchises as time goes by. Maybe its time to fire who is in charge. Give us some good products like these blizzard.",
    "gameID": 0,
    "author": "TomCat86"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-01-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "Самая большая мечта 1998-1999 года, домашний компьютер с установленным STARCRAFT. Что то более весомое представить было невозможно. Обладать этим было, настоящее, не поддельное счастье.",
    "gameID": 0,
    "author": "iddqd4"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-08-03T00:00:00.000Z",
    "score": 9.0,
    "comments": "Teniendo en cuenta que es un juego de 1998 ha envejecido bastante bien. La campaña a nivel jugable es algo limitada pero en cuanto a la historia y la ambientación es sensacional, deja en ridículo a la basura que es SC2. En cuanto al multijugador ocurre lo mismo, es superior al vergonzoso SC2.",
    "gameID": 0,
    "author": "Hannibaal"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-09-09T00:00:00.000Z",
    "score": 8.0,
    "comments": "RTS 장르의 완성. 흔히 추앙받는 것처럼 무슨 완전무결한 신의 게임은 아니지만, 현재까지 이 장르와 더 나아가 e스포츠 계에서 스타크래프트보다 완벽에 근접한 작품은 보지 못했다. 일반적인 게임들처럼 단순히 게임 디자이너들의 설계와 패치로 완성된 작품이 아니라, 제작자들 외에도 무수한 프로게이머들, 코치들, 맵 디자이너들과 아마추어 유저들의 수십년에 걸친 연구와 집단지성으로 완성도를 이루었기 때문이다. 그 완성도를 기반으로 e스포츠가 태동했고 결국 게임사에 거대한 획을 그은 작품이다. 명성 높은 멀티플레이어 못지 않게 스타크래프트의 싱글플레이어 캠페인 역시도 인상적이다. 에일리언, 워해머 40,000, 스타 트렉, 스타쉽 트루퍼스 등에 영감을 얻은 듯한 SF 세계관을 배경으로 종족 전쟁,RTS 장르의 완성. 흔히 추앙받는 것처럼 무슨 완전무결한 신의 게임은 아니지만, 현재까지 이 장르와 더 나아가 e스포츠 계에서 스타크래프트보다 완벽에 근접한 작품은 보지 못했다. 일반적인 게임들처럼 단순히 게임 디자이너들의 설계와 패치로 완성된 작품이 아니라, 제작자들 외에도 무수한 프로게이머들, 코치들, 맵 디자이너들과 아마추어 유저들의 수십년에 걸친 연구와 집단지성으로 완성도를 이루었기 때문이다. 그 완성도를 기반으로 e스포츠가 태동했고 결국 게임사에 거대한 획을 그은 작품이다. 명성 높은 멀티플레이어 못지 않게 스타크래프트의 싱글플레이어 캠페인 역시도 인상적이다. 에일리언, 워해머 40,000, 스타 트렉, 스타쉽 트루퍼스 등에 영감을 얻은 듯한 SF 세계관을 배경으로 종족 전쟁, 반란, 종교재판, 암살, 배신과 복수가 주를 이루는 웅장한 정치 드라마이자 스페이스 오페라이다. 스타만큼 게임의 밸런스를 유지하면서 각 종족별, 유닛별로 뚜렷이 차별화되는 개성적인 디자인은 당시 어떤 RTS에서도 찾아볼 수 없었다. 음악까지 상징적이다. 세계관이 완전히 새롭지만은 않고 스토리와 캐릭터들도 클리셰는 많다. 그러나 블리자드 특유의 디테일한 디자인과 영화적인 연출, 그리고 자극적인 스토리가 결국 20년이 지난 오늘날까지도 수많은 2차 창작물과 후속작들로 이어진 거대한 세계관의 근간이 되었다. 그러나 이러한 유례없는 전략적인 깊이와 난이도가 오히려 게임에게 독이 되었을까. 세월이 흐르면서 기존 플레이어들의 수준이 높아지고 게임의 깊어지자 진입장벽이 어마어마해졌고, 그 바람에 선수와 팬들의 유입이 점차 끊기며 아이러니하게도 스포츠로서의 생명이 다해가고 있다. 스타보다 더 화려하고 더 편리한 게임들이 많아진 오늘날 스타를 처음 접하는 사람이 과거 우리 세대가 느꼈던 흥분과 감동을 똑같이 느끼긴 힘들 것이다. 대전 액션 게임들과 MOBA와 FPS 게임들은 수많은 캐릭터들이나 무기들이 있어서 사실상 완벽한 밸런스는 포기하는 대신, 끝없는 패치와 업그레이드(캐릭터 추가, 후속작 발매 등)로 다양성을 제공하고 커뮤니티에 자극을 준다. 선택지가 워낙 많고 일부는 비슷해서, 특정 패치로 본인이 플레이하던 캐릭터가 마음에 안 들면 다른 캐릭터로 계속 즐기는 게 가능하다. 반면 스타는 3개의 (뚜렷이 개성적인) 종족들만으로 밸런스를 최우선적으로 여겼기 때문에, 작은 변화가 밸런스를 해칠뿐만 아니라 각 종족만을 전문적으로 다루던 선수들에게 강한 거부감을 일으킨다. 결국 밸런스를 추구한 댓가로 다양성을 잃은, 스포츠로는 완벽하나 게임으로는 침체되고 있는 안타까운 현실에 직면하게 되었다. 설상가상으로 발매된지 20년이나 지나서 신인들이 뜸해지고 게임에 대한 연구는 줄고 선수들의 전체적인 기량이 하락하자, 그 훌륭해 보이던 스타의 밸런스에도 금이 가고 있다. 예를 들면 과거엔 각 종족별 난이도와 불리함을 최정상의 프로 선수들이 극한의 실력과 노력으로 극복하고 강점을 극대화했으나, 세월이 지나 프로계가 비교적 노쇠해지면서 종족 상성과 불균형이 고착화되고 있다. 이것이 결국 플레이어들이 지나치게 신성시하여 변화를 거부한 게임의 운명인 걸까. 다른 RTS들은 스타만큼 오래가지도 못 했기 때문에 결국 모든 게임들의 한계이기도 하지만, 한편으론 스타의 커뮤니티가 한계에 다다랐을 때 블리자드라도 나서서 약간의 변화를 추구했다면 게임의 수명이 더 오래가지 않았을까 하는 아쉬움이 남는다.… Expand",
    "gameID": 0,
    "author": "greenndreams"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-11-16T00:00:00.000Z",
    "score": 5.0,
    "comments": "Игра для корейских задротов, ремастер не нужен. Кампания не очень. Сюжет можно в вики почитать.",
    "gameID": 0,
    "author": "MillersWeeb"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-12-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of those rare games that is not overly complex, but provides a challenging and fun gaming experience. It never seems to get old or boring.",
    "gameID": 0,
    "author": "voditelnlo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-03-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is one of my all time favorites. one of the best RTS games out there.",
    "gameID": 0,
    "author": "Yomi07"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-08-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "Okay, docking marks because a game isn\u0027t groundbreaking or pioneering a new genre is ridiculous... If that were the case, everything save a few games would have lowered marks. You need to see it for what it is, and as has been said a couple times, it really is a complex game with alot of thought behind everything you do. To be amazing at it isn\u0027t simple, and I think that counts for something.",
    "gameID": 0,
    "author": "jelikey"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-10-10T00:00:00.000Z",
    "score": 9.0,
    "comments": "This is exactly the game that can be called one of the pillars of the gaming industry. A \"masterpiece of gaming art\" with a very interesting plot and a deep atmosphere. Everything was great in this game for its time. So why I didn’t give it rating 10? ...Because if this rating and review is precisely about my taste, then I cannot note that I did not like the appearance of the game. I playThis is exactly the game that can be called one of the pillars of the gaming industry. A \"masterpiece of gaming art\" with a very interesting plot and a deep atmosphere. Everything was great in this game for its time. So why I didn’t give it rating 10? ...Because if this rating and review is precisely about my taste, then I cannot note that I did not like the appearance of the game. I play different indie games, so the graphics is not in the first place for me, but it is part of my taste and those indie projects that I like, graphically well done too in theirs way. So, I did not like the style of this game.… Expand",
    "gameID": 0,
    "author": "SilverOrlov"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-01-08T00:00:00.000Z",
    "score": 0.0,
    "comments": "Best Game ever created. You actually need your brain and strategy , unlike in most games today",
    "gameID": 0,
    "author": "Shathe_"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "This Game is a Milestone in real Time Strategy. Three total different and perfectly balanced Races. A real good Story, that has a perfect cold Space Mood. Good Mission Design, good Sound and Music Design. A really Fun Map Editor (spend more Time in this one than in the Game itself). It has not a \"forced Epicness\", no foreseeing and not an \"good Overmind\", thats what the second oneThis Game is a Milestone in real Time Strategy. Three total different and perfectly balanced Races. A real good Story, that has a perfect cold Space Mood. Good Mission Design, good Sound and Music Design. A really Fun Map Editor (spend more Time in this one than in the Game itself). It has not a \"forced Epicness\", no foreseeing and not an \"good Overmind\", thats what the second one just made bad. The Queen of Blades is one of the most to be hated Villian ever.… Expand",
    "gameID": 0,
    "author": "Azuris"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Even though more then 20 years passed, I still remember my first expirience in this game, and it was overwhelming. Great story, awesome \u0026 atmosperic music, strong and unusual characters, unexpected plot twists, hard missions, instresting units \u0026 strategies. Ah, those days when Blizzard actually cared about quality of their games!",
    "gameID": 0,
    "author": "laertan"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-04T00:00:00.000Z",
    "score": 9.0,
    "comments": "Amazing game loved it for many years. To this very day is still a favorite. Blizzard in their prime Great times! The Custom games were game flatteringly fun.",
    "gameID": 0,
    "author": "Red_Spectre"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "Best RTS ever made, good and interesting story, good balance, unique races, enough said.",
    "gameID": 0,
    "author": "Wiebe"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-04T00:00:00.000Z",
    "score": 8.0,
    "comments": "Ахуенный геймплей и пиздатый сюжет вот что хочу сказать про эту игру. Из минусов это однотипные миссии и сооружения. В целом пойдёт!",
    "gameID": 0,
    "author": "kenenkes"
  }
]