[
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2004-10-11T00:00:00.000Z",
    "score": 9.3,
    "comments": "This game set the bar for Hack-n-Slash RPG games. A classic must have for all fans of the genre.\nThis game set the bar for what an addictive hack-n-slash RPG should be. Although this bar was shattered by Diablo II and its expansion pack, Lord of Destruction, the original Diablo is still a lot of fun to play. I isn\u0027t... ",
    "gameID": 0,
    "author": "ULTIMA-Demon"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2004-10-25T00:00:00.000Z",
    "score": 9.0,
    "comments": "a true rpg classic\nIf you\u0027ve played Diablo 2 but never got around to playing the first one then you really have to see where it all began. The thing about the first game is that it truly has this evil atmosphere about the levels that was n... ",
    "gameID": 0,
    "author": "Deano"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2004-11-03T00:00:00.000Z",
    "score": 9.8,
    "comments": "The game that popularized the hack n\u0027 slash genre.\nIn corporating action and adventure in RPGs is nothing new in gaming. The Baldur\u0027s Gate and AD\u0026D series could attest to this, but none of them had the simplicity in structure of Diablo, Blizzard\u0027s foray into the hack n\u0027... ",
    "gameID": 0,
    "author": "led282"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 3,
    "date": "2004-11-08T00:00:00.000Z",
    "score": 9.6,
    "comments": "The progenitor of the action rpg genre. This classic game is a must own for any fan of fantasy gaming.\nThis brilliant game started it all back in the 90\u0027s. Because of Diablo, companies realized they could release a graphically rich, 3rd person rpg that would still appeal to fans of the fast-paced, real-time kill, kill, ki... ",
    "gameID": 0,
    "author": "Vorcoth"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2004-12-01T00:00:00.000Z",
    "score": 9.4,
    "comments": "RPG fantasy classic!\nThis is one of those games that everyone should at least try to play...and end up playing until you forget what time it is. There are only so many games that really revolutionized video games. Diablo did this ahead of ... ",
    "gameID": 0,
    "author": "thegorum"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2004-12-05T00:00:00.000Z",
    "score": 8.5,
    "comments": "A classic.\nDiablo was one of great games in its day and may represent the pinacle of isomorphic action RPGs. It is simple to learn (a 4-year old can play it), a has a random level generator that keeps the game a challenge for a wh... ",
    "gameID": 0,
    "author": "gsantor"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2004-12-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game has everything to offer!\nBlizzard does it AGAIN! Diablo is THE most amazing RPG game ever created! This game is perfect for any type of gamers, whether it be RPG, mass slaughter, hack-n-slash, or Adveture-type people. Gameplay: So cool. Ha... ",
    "gameID": 0,
    "author": "Warp_2567"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2005-02-04T00:00:00.000Z",
    "score": 9.1,
    "comments": "Infinite replayability and a surprisingly fascinating storyline combine for a true classic.\nWell, here it is, folks. The role-playing game that took the genre and turned it on its head. Looking back, it could be considered the most innovative RPG of the 90\u0027s. You can buy this game for a song on Amazon or EBa... ",
    "gameID": 0,
    "author": "anonymous21"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-02-12T00:00:00.000Z",
    "score": 9.4,
    "comments": "Ahhhhhh diablo. For so long i have live, breathed, and just been diablo the game. Honestly i couldnt get enough of\nAhhhhhh diablo. For so long i have live, breathed, and just been diablo the game. Honestly i couldnt get enough of this game. In diablo you run around as a warrior, rogue, and sorcerer trying to defend the town of Tri... ",
    "gameID": 0,
    "author": "S7ATER"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2005-02-24T00:00:00.000Z",
    "score": 9.8,
    "comments": "A dark gothic story and simple, yet revolutionary gameplay combine to make one of the best games of all time.\nNow I’m going to review a wonderful game, and one of my favorite games of all time, Blizzard Entertainment’s classic, Diablo. The dark story of three people’s journey into the heart of darkness evokes more emotion than a... ",
    "gameID": 0,
    "author": "SolarisDeschain"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-03-06T00:00:00.000Z",
    "score": 9.5,
    "comments": "An old classic that can still hold it\u0027s own today.\nThe game that refinded and set the standard for all Hack n\u0027 Slashes. You\u0027ll still see it\u0027s likes in various games today such as Divine Divinity, Darkstone, Dungeon Siege. Why? Because of a few key factors: Simplistic Gam... ",
    "gameID": 0,
    "author": "Everclearules"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-04-09T00:00:00.000Z",
    "score": 9.5,
    "comments": "Everyone who plays PC games should have this.\nThis is one of my first ever PC game that i\u0027ve owned and seriously this game is addicting. Diablo has 3 kinds of people to choose from when creating a character. There is a mage, a warrior, and a rogue. The mage y... ",
    "gameID": 0,
    "author": "SlipknotIowa666"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-04-22T00:00:00.000Z",
    "score": 9.1,
    "comments": "The best and most addictive RPG ever. Simple.\nDiablo is undoubtedly the best RPG made. With it\u0027s simple click and slash formula, players will whittle away hours plumbing the depths of the Labyrinth of creatures, where Diablo, the Lord of Terror, abodes. The story... ",
    "gameID": 0,
    "author": "043030"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-05-26T00:00:00.000Z",
    "score": 9.3,
    "comments": "Diablo, simply put, still amazes me even to this day.\nDiablo still stands as the best hack and slash RPG ever. I still think it has some pretty great looking graphics, a great story, and some great game controls. All the characters in the game drew me into their world. Gris... ",
    "gameID": 0,
    "author": "Wilfred_Owen"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-06-12T00:00:00.000Z",
    "score": 9.0,
    "comments": "A Blizzard classic that will make you play the second game of the series and dream of a third.\nBlizzard´s smash hit, that sold over 5 million copies, is a testament of pure fun, with a simple interface, great gameplay and awesome setting, this was the game to play in 1996. Nowadays after going for it after 9 year... ",
    "gameID": 0,
    "author": "alvarinho"
  },
  {
    "helpfulCount": 20,
    "helpfulScore": 0,
    "date": "2005-07-01T00:00:00.000Z",
    "score": 6.9,
    "comments": "Some intense moments, but nothing too fun.\nI borrowed diablo 2 from my friend awile ago and that was really fun, so i begged my mom to get it for me for christmas, instead, she got me diablo 1 While still a good game, diablo has some things i dont like about ... ",
    "gameID": 0,
    "author": "-_-rock_n_roll-"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-07-06T00:00:00.000Z",
    "score": 8.0,
    "comments": "Diablo is one of those games that was good for its time.\nEven after the dawn of World of Warcraft and Diablo II, Diablo seems to be more of a nice collector\u0027s item than it is game worth playing. However, there\u0027s more to Diablo than meets the eye. There\u0027s no doubt that Diabl... ",
    "gameID": 0,
    "author": "smbius"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-07-07T00:00:00.000Z",
    "score": 9.7,
    "comments": "This is one of my favorite games of all time...and if you dont have a copy...shame on you.\nA couple days ago, i loaded the game Dungeon Siege up and started playing. As i was playing, i kept making remarks about it and how \"this could be better\" and \"i dont like this aspect\" Then i remembered Diablo, and how g... ",
    "gameID": 0,
    "author": "WallaKoala"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 3,
    "date": "2005-08-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "So addictive that it almost ruined my life!\nDiablo. What can I say about this game. How about most addicting gameplay ever. How about most enjoyable leveling up ever designed. How about fantastically designed multiplayer (which is totally free by the way). Ho... ",
    "gameID": 0,
    "author": "Goldenboy467"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-10-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best rpg other than kotor\nits the best rpg other than kotor i played it for 100s of hours it is my second favorite pc game the first is better than the second the online play is good to the game will be hard for beginers the quest were coo... ",
    "gameID": 0,
    "author": "daltonknittle"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2005-10-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "Bu da nedir boyle? Boyle bir sey bilen var mi?\nOyun dunyada en cok ilgi ceken oyun turunun efendisi, babasi kurucusu olarak sayilabilir. Cunku piyasaya cikmis ilk RPG oyunudur. Insanlar yepyeni bir tarzla karsilasmislard\u0026#305;r. Beni etkileyen nadir oyunlardan biridi... ",
    "gameID": 0,
    "author": "freakahmet"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-10-24T00:00:00.000Z",
    "score": 9.7,
    "comments": "The game that started it all!!\nThis was the very game that started the awesome series of Diablo and it\u0027s greatness of RPG. The skills and different kinds of characters to go against demons and the undead. The online is awesome is to have and pla... ",
    "gameID": 0,
    "author": "vegetaforever"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 3,
    "date": "2005-10-25T00:00:00.000Z",
    "score": 3.2,
    "comments": "Don\u0027t bother about Hellfire.\nOk, so you\u0027ve got: 1. Diablo, which is insane and cool 2. Diablo 2, which is not quite as insane but maybe more cool 3. Diablo LOD, which makes Diablo 2 even more cool. So who would bother about a little insignif... ",
    "gameID": 0,
    "author": "TheOneCow"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-02T00:00:00.000Z",
    "score": 6.5,
    "comments": "A little disappointed with how little this has to offer but still worth getting if into Diablo\nOoo how exciting my first review lol. Well I thought it best to start with the game I completed most recently which is Hellfire which to you people who don\u0027t know what this is, the expansion pack for Diablo. I have to sa... ",
    "gameID": 0,
    "author": "19liam86"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-04T00:00:00.000Z",
    "score": 9.6,
    "comments": "An amazing game that everyone should own! The only Role Playing game I have ever enjoyed from start to finish\nNow this game took me two attempts to complete not something i\u0027m proud of lol. The reason was I really fluffed it up first time round and sold basically everything and spent all my money on elixirs. I learnt from my mist... ",
    "gameID": 0,
    "author": "19liam86"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-12T00:00:00.000Z",
    "score": 8.7,
    "comments": "Diablo; Devil\nDiablo is one of those games where you just go \u0027Wow\u0027, it is just that good. Despite its four player multiplayer capabilities, and its OK graphics, this game was amazing when it came out. The ability to play as a mediev... ",
    "gameID": 0,
    "author": "fougera"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-17T00:00:00.000Z",
    "score": 9.2,
    "comments": "Sure, it may be old, but it\u0027s still a great game.\nDiablo is one of those PS games that remains a classic, even to this day. The gameplay is superb, with its completely randomised dungeons, items, and monsters. The graphics are beautiful, and the top-down view really add... ",
    "gameID": 0,
    "author": "Sa9jev"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-11-22T00:00:00.000Z",
    "score": 8.7,
    "comments": "Great, if only because it got Diablo II made\nDiablo is a creepy, intense action RPG that lacks depth to its combat system, and also lacks variety in its environments, and is saddled with a short single-player and virtually no story. In spite of these, it sets a hig... ",
    "gameID": 0,
    "author": "Akr321"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-22T00:00:00.000Z",
    "score": 9.1,
    "comments": "Innovative.\nThis is classified as a role playing game, but it really is much more than that. Most of the role playing games, such as star wars, knights of the old republic, are pretty dull and less of a game, more of a story. This... ",
    "gameID": 0,
    "author": "MrLaskowski"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-28T00:00:00.000Z",
    "score": 9.4,
    "comments": "Addiction... Addiction...\nI\u0027m writting this review almost 6 years after the fact. I saw that I never wrote a review for this game and found out that Diablo is probably the best game I ever Played in my life. I normally play a game only one time... ",
    "gameID": 0,
    "author": "viper_najem"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-29T00:00:00.000Z",
    "score": 9.0,
    "comments": "Old-School all the way..\nThis game is an instant classic. Up and running since 1996 Diablo was by far one of the pioneers of the mmorpg world. The game is free to play online which is a beautiful thing for someone who is low on mad money. Severa... ",
    "gameID": 0,
    "author": "Arob_2006"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-30T00:00:00.000Z",
    "score": 8.2,
    "comments": "a classic!\nIf you\u0027ve played Diablo 2 but never got around to playing the first one then you really have to see where it all began. The thing about the first game is that it truly has this evil atmosphere about the levels that was n... ",
    "gameID": 0,
    "author": "killer_marc"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Its the beginning of a new era...THE DIABLO ERA!!!\nTwo words!!! Masterful Classic. Diablo is a game where u take on a role of a warrior/rogue/sorcerer/monk to embark on a journey to destroy the lord of all evil...DIABLO!!! Develop by Blizzard Ent, whom r used to creat... ",
    "gameID": 0,
    "author": "Nezriq"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-06T00:00:00.000Z",
    "score": 9.6,
    "comments": "The best RPG game for PC. The End.\nDiablo is an unforgetable experience for any RPG PC gamer fan. It offers high addictive gameplay, awesome graphics, (for its time) easy to learn battle system, and cunning CG graphics. (for its time) The storyline is rea... ",
    "gameID": 0,
    "author": "Digital_DJ_00"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-09T00:00:00.000Z",
    "score": 8.7,
    "comments": "Its got a dark feel to it. Plenty of replay options and some deep, enjoyable gameplay mae Diablo a must own, classic RPG\nDiablo stands out as a classic amoun RPGs as the game that does everything right. The three player classes, the random levle generator, the dozens of ferocious monsters and the seemingly endless number of weapons and ite... ",
    "gameID": 0,
    "author": "Wej_accept_it"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "A very classical game, I can\u0027t believe I own this too! I just got it somehow lol! but yes every PC gamer should own this\nVery good game indeed, great storlyline, It\u0027s actually pretty deep... I love the Diablo series very much, I also own the latest Diablo gams too.. this game is really good for it\u0027s age.... the only downside to me is limit... ",
    "gameID": 0,
    "author": "LUBULA"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-12-26T00:00:00.000Z",
    "score": 6.4,
    "comments": "Not so bad, too short though.\nMan, you think diablo\u0027s dead... NO IT IS NOT!!! Hellfire is rare and those who play it, play it alone.... Guys, download the multiplayer mod.... Hellfire is the only add-on made by SIERRA (yes) for diablo made by Bliz... ",
    "gameID": 0,
    "author": "Darthnaevus"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-12-28T00:00:00.000Z",
    "score": 9.8,
    "comments": "Classic worth re-visiting!\nEvery now and then a great game needs to be grabbed right off the shelf, the dust blown off, and loaded up! This is one of those games. Wait you tell me you don’t have it?! Go search the barging bin and your local Wal-Ma... ",
    "gameID": 0,
    "author": "RollNpc"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-28T00:00:00.000Z",
    "score": 9.0,
    "comments": "Tremendous! This game is a classic and it\u0027s one of the best RPG games on the PS System and PC ever. Extremely Addictive.\nPrepare to set up a storage of low-nutriniotal food and drinks in your living room when you insert the disc into your PS for the first time.. You will need it! Sure, the controls are not absolutely the same as with a... ",
    "gameID": 0,
    "author": "zerkeer"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2005-12-31T00:00:00.000Z",
    "score": 6.5,
    "comments": "Hack \u0026 slash, hack \u0026 slack, repeat, repeat...\nI didn\u0027t see what the big deal over this game was all about. The graphics aren\u0027t mindblowing and the gameplay was simple, kill everything you can by left clicking as fast as you can. The story was credible and the magica... ",
    "gameID": 0,
    "author": "differentiation"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-01-05T00:00:00.000Z",
    "score": 7.1,
    "comments": "Despite the age, graphics, and mediocre sound, Diablo is a solid action RPG\nDIablo is Spanish for Satan. It is also a great game. It can be played online and offline, but at the same time it\u0027s got some problems. WIth starters, the graphics are overrated, along with it\u0027s music that plays, and it\u0027... ",
    "gameID": 0,
    "author": "zwulith"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2006-01-08T00:00:00.000Z",
    "score": 8.6,
    "comments": "Now this is gaming culture.\nEven though i completly hate diablo 2, this is a game that i really enjoy. this is definitly one of the \u0027\u0027golden oldies\u0027\u0027 of gaming. To start with, the gameplay is great, with random levels evertime you play (well, a... ",
    "gameID": 0,
    "author": "kiatebake"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-01-09T00:00:00.000Z",
    "score": 9.6,
    "comments": "\"Blizzard\u0027s Diablo, winner of GameSpot\u0027s PC Game of the Year, has finally made it onto the PlayStation.\"\nGamespot: Blizzard\u0027s Diablo, winner of GameSpot\u0027s PC Game of the Year for 1996, has finally made it onto the PlayStation. My thoughts exactly. This fun, but sadly forgettable, game is a well deserved winner of GS\u0027s PC... ",
    "gameID": 0,
    "author": "darkside5001"
  },
  {
    "helpfulCount": 24,
    "helpfulScore": 0,
    "date": "2006-01-14T00:00:00.000Z",
    "score": 1.8,
    "comments": "Eh its ok\nDon\u0027t know why people can get hyped up for such a terrible game. It is a repetitive hack n\u0027 slash oriented game. The game is also very boring online considering the fact that your best friend online named Ineverdie193749... ",
    "gameID": 0,
    "author": "slipknot9183"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-16T00:00:00.000Z",
    "score": 9.6,
    "comments": "The starting block of one of the greatest series ever and the father to some amazing games to come.\nThe starting block of one of the greatest series ever and the father to some amazing games to come. In Diablo you play as a warrio, sorcerer, or I forgot the other race lol. Basically your goal is to go through a really ... ",
    "gameID": 0,
    "author": "Vornagar"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-19T00:00:00.000Z",
    "score": 9.5,
    "comments": "Blood, gore, more blood, more gore, death...\nBefore Diablo, there was Rogue and Gauntlet, games that offered a particular innovation, but before the imperator Diablo of its genre, there was naught. When Diablo was released by Blizzard, it seemed to be a game simila... ",
    "gameID": 0,
    "author": "irulehexen"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "best game ever almost great rpg hack n slash best played online and for full version must buy classic\nthis game rock and you shouuld buy this game now best classic doom like opaclypse hack in slash of all time almost i give this game a 100% perfecT with a capital T T ya baby this game is so addicting and yet easy to hack... ",
    "gameID": 0,
    "author": "darkvengence14"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-25T00:00:00.000Z",
    "score": 9.6,
    "comments": "Diablo\nEvery now and then a game comes along that is so simple and addictive that it affects the way that video games are made forever. Games like SimCity, Populous, Dune II, and Doom all changed the face of computer gaming f... ",
    "gameID": 0,
    "author": "GamerPlayer914"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-27T00:00:00.000Z",
    "score": 9.0,
    "comments": "This is reaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaally good\nThis is a really cool game and if you like RPG games, you are just as much fool as me if you miss this game:D The graphics is really good ro be made in 1996 band the type of game play is really amazing too, it is true... ",
    "gameID": 0,
    "author": "snippey"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-29T00:00:00.000Z",
    "score": 9.2,
    "comments": "Simply put, fun, addicting, and with a sadistic plot.\nThe original Diablo created by Blizzard created one most popular hack and slash RPGs of all time. Diablo offers a diverse array of weapons, spells, armor that a player can utilize on their journey to hell to defeat the t... ",
    "gameID": 0,
    "author": "battousai188"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-29T00:00:00.000Z",
    "score": 9.8,
    "comments": "If you don\u0027t own this then pick it up now!\nSure this game is somewhat old... But its still one of the best PC games even to this date! The Graphics for this game at the time were simple but great! The Sound of this game is just as outstanding as well! This game h... ",
    "gameID": 0,
    "author": "ZabuzaR"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-31T00:00:00.000Z",
    "score": 9.2,
    "comments": "one of the 1st PC games I ever got,great experience \u0026 something all rpg fans should play, diablo started it all I think.\nThis is one of those games that everyone should at least try to play...and end up playing until you forget what time it is. There are only so many games that really revolutionized video games. Diablo did this ahead of th... ",
    "gameID": 0,
    "author": "CHAMPANERIA"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-05T00:00:00.000Z",
    "score": 9.5,
    "comments": "Diablo is such an inspiring game and will always live on top.\nDiablo is such a great PC game that everyone should know about.From the beautiful graphics to the environmental details,this game should be noticed for its great potential it has in it.This type of Hack-and-Slash game is... ",
    "gameID": 0,
    "author": "BestGame92"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "A wonderful and most delightful game.\nDiablo was the best RPG to ever come out. Period. Blizzard was a genius to make such a game and then make a sequel as well! But to stay on Diablo it was revolutionary! It changed gaming as we know it. By combining bad-as... ",
    "gameID": 0,
    "author": "Lord_DoDo56"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-06T00:00:00.000Z",
    "score": 8.8,
    "comments": "All-time classic\nDiablo will celebrate its tenth birthday this year. The amazing thing about this is the fact that it has lost none of its appeal during this time. While it is comprehensively put to shame in terms of length and character... ",
    "gameID": 0,
    "author": "A_Viper"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-02-17T00:00:00.000Z",
    "score": 9.4,
    "comments": "one more time i create 1 review for portuguese speakers!!! ;)\nDiablo é um jogo de computador, no estilo RPG, passado em época medieval. Produzido pela Blizzard North e distribuido pela Blizzard Entertainment, foi lançado em 1996. O objectivo deste primeiro jogo da série é, basicame... ",
    "gameID": 0,
    "author": "batata0987"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-18T00:00:00.000Z",
    "score": 8.5,
    "comments": "Simply put ... GREAT ...\nDiablo is one of the best games I own for the PC. It is deep and compelling and has excellent replay value. The graphics were good for the time and the sound and music is wonderful. Diablo is a point and click actio... ",
    "gameID": 0,
    "author": "jonathanfwlr"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 4,
    "date": "2006-02-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "Diablo simply put is one of the greatest games to ever grace the PC.\nThis game is very simple to play, it shouldnt be very hard to anyone and its so addictive, you just want to keep on playing it even afetr you are finished. Diablo changed PC gaming and Gaming in general forever. Diabl... ",
    "gameID": 0,
    "author": "darkplayer"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-02-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "awesome experience\nWhen this game was released years ago, it was a huge success, tough game reviews of magazines were not very enthusiastic about it, but Diablo was an immediate classic. The creators of the great Warcraft saga decided it w... ",
    "gameID": 0,
    "author": "GizmoSimo"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-02-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Awesomely Great\nDiablo 1, like all the others have made their mark on one of the best role-playing series without a doubt. Personally I think diablo 1 was blizzard\u0027s best of the series: 1. Because diablo was much more of a challenge,... ",
    "gameID": 0,
    "author": "Pepper919"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2006-02-22T00:00:00.000Z",
    "score": 9.6,
    "comments": "This is where it started for the big red guy, and although alot has happened since then, this game is strong\nOf course due to a completely overlapping updated sequel it\u0027s hard to keep this review in the modern context so I’ll do my best to go retro with this. Diablo was the type of game that, despite even initial high popula... ",
    "gameID": 0,
    "author": "Spincut"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 3,
    "date": "2006-02-23T00:00:00.000Z",
    "score": 7.6,
    "comments": "This game is not as good as Diablo 2.\nThis game has a two player mode and I think you can kill eachother, too. This game takes forever to save and eats up 2/3s of your memory card. This game is very hard compared to the second game. This game just has one bi... ",
    "gameID": 0,
    "author": "gameexaminer"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2006-02-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "Very enjoyable\nVisually, Diablo is stunning. The attention to detail and general ambiance immediately draws you into the game. Your character can interact with just about anything from doors to chests and towns folk to cows! Players... ",
    "gameID": 0,
    "author": "cid8807"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 5,
    "date": "2006-03-02T00:00:00.000Z",
    "score": 4.8,
    "comments": "Do you have anything better to do with your money? Than don\u0027t grab this expansion pack.\nHellfire might be one of the oddest expansion packs ever: It wasn\u0027t made by the company that made the original game. The results were disastrous. No one knows who it happened but, somehow Blizzard was too busy with Di... ",
    "gameID": 0,
    "author": "grasu"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-06T00:00:00.000Z",
    "score": 9.9,
    "comments": "Diablo is coming for you and you like it!!!\nDiablo and all of the following games rank among my all-time favorites on PC. With the ability to mix and match weapons, armor, and spells makes Diablo a must have and a truly classic game among other things. This game... ",
    "gameID": 0,
    "author": "TranquilSlogan"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-03-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is the best game of the 176 I\u0027ve played so far and it\u0027s been 7 years now\nI\u0027m writting this review almost 6 years after the fact. I saw that I never wrote a review for this game and found out that Diablo is probably the best game I ever Played in my life. I normally play a game only one time... ",
    "gameID": 0,
    "author": "jacobderosenoir"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-03-20T00:00:00.000Z",
    "score": 9.7,
    "comments": "Even by today\u0027s standards, this is a diamond in the rough.\nThis game practically established a very nice game genre; HACK AND SLASH. Some games might have come out before this one, but you can\u0027t argue that this game is a classic. You can choose between three simple character c... ",
    "gameID": 0,
    "author": "steff3121"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-03-27T00:00:00.000Z",
    "score": 7.8,
    "comments": "Lots of fun for it\u0027s time\nI first gave Diablo a spin on the Playstation as a rented game due to the buzz about it from all my PC friends. I didn\u0027t care for it. In fact, I think I played it for about 20 seconds and then took it back. In betwe... ",
    "gameID": 0,
    "author": "rdhnightwolf"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-03-30T00:00:00.000Z",
    "score": 9.0,
    "comments": "This is one of the best Old-School games out there.\nThe game starts off with you choosing a warrior. You have the choice between a fighter, an archer or a magician. Each warrior has their special abilities that you can use in battle (ex: the fighter has a skill that lets ... ",
    "gameID": 0,
    "author": "Bologa"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2006-04-12T00:00:00.000Z",
    "score": 9.8,
    "comments": "The game that stands tall with starcraft at the head of gaming perfection, diablo is a masterpiece and a classic\nI\u0027ll never forget the day i put diablo in my computer and installed it. it was my first game on computer, and i was very excited to see how good it really was. as soon as i played, i cast my doubts to the wind. it was th... ",
    "gameID": 0,
    "author": "Bahamut50"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-04-13T00:00:00.000Z",
    "score": 9.7,
    "comments": "The granddaddy of RPGs is superb,even today!\nDiablo is the game that all PC dungon crawlers are based on. It\u0027s the classic story about villagers rising up against the devil and his minions underground. Finding potions, killing hords of demons and zombies and goblin... ",
    "gameID": 0,
    "author": "BigC43"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-17T00:00:00.000Z",
    "score": 8.2,
    "comments": "What can I say other than \"The classics never die\"\nHas a good solid multi-player mode as well as a solid single player mode. The only thing I never liked about this series is the lack of options for what kind of character you can play. A warrior or mage or rogue come ... ",
    "gameID": 0,
    "author": "kitsune0"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-18T00:00:00.000Z",
    "score": 9.2,
    "comments": "Classic Games Truely Rock.\nThis game is truely a legend the sound graphics and the pure gameplay rock. This game was truely a legend when it came out and still is now. One of the best features of this game is the forever changing locations you go ... ",
    "gameID": 0,
    "author": "razor_bblade"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-04-23T00:00:00.000Z",
    "score": 9.2,
    "comments": "Amazing game with a good scheem.\nThe game is a masterpiece. Your main objective is to kill a hell-summoned demon named diablo. You need to fight a variety of bosses to get to him, and go deeper into a dungeon of a hell-rissen chapple which connects dire... ",
    "gameID": 0,
    "author": "puremage1209"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-04-24T00:00:00.000Z",
    "score": 9.7,
    "comments": "It is a good game \u0026 I think many people will like it .It was developed by blizzard in November 30, 1996 and was a hit.\nIt is a good game \u0026 I think many people will like it .It was developed by blizzard in November 30, 1996 and was a hit. there are three main characters-Warrior,rogue,sorcerer It is a fun game to play and there are man... ",
    "gameID": 0,
    "author": "04l27"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-04-26T00:00:00.000Z",
    "score": 9.3,
    "comments": "Diablo is one of the best games ever, too original and tremendously addictive\nDiablo is one of the best games ever. Original, fun, and may be the most addictive game that somebody create before it. The darkness of the thematic, the playmode, the characters, infinity weapons and armors, itmes; all ... ",
    "gameID": 0,
    "author": "Gilillo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-05-03T00:00:00.000Z",
    "score": 9.1,
    "comments": "Oldskool and very addicting!\nThis is one of those classic games that never becomes boring, no matter how many times you play it. I bought this game around November \u002705 (and never played it before!) but I instantly loved it and now it\u0027s one of my fa... ",
    "gameID": 0,
    "author": "mnorde"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2006-05-06T00:00:00.000Z",
    "score": 9.4,
    "comments": "The grandfather of hack-n-slash.\n:Good Idea: ·Beating evil demons and skeletons in dungeon after dungeon only to get to the mother of all demons, el Diablo. ·The random dungeon generator makes for some fun play since you probably won\u0027t travel a dungeo... ",
    "gameID": 0,
    "author": "Dinghy_Dog"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-05-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "IF YOU DONT OWN THIS GAME RUN DOWN TO YOUR LOCAL STORE AND GET IT this is one of the best games of all time BUY IT NOW!!\nthere is no better game to date. diablo is the classic that change RPG forever. authough made quite along time ago this game still holds it fire with many players getting time warped and playing for hours on end. ive spe... ",
    "gameID": 0,
    "author": "deathstrike00"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-05-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "Quite possibly the best game ever\nDiablo is one of the best games ever. Original, fun, and may be the most addictive game that somebody create before it. The darkness of the thematic, the playmode, the characters, infinity weapons and armors, itmes; all ... ",
    "gameID": 0,
    "author": "AcydRaine"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-05-14T00:00:00.000Z",
    "score": 8.5,
    "comments": "A very solid game\nThe series which I have played the longest is either Diablo or Warcraft. I have played both Diablo I and Diablo II to death, playing each of the characters at least 3 times, getting their feel. Here\u0027s what I found out ab... ",
    "gameID": 0,
    "author": "mr_nyuckles"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2006-05-17T00:00:00.000Z",
    "score": 7.3,
    "comments": "Best on multiplayer\nThe original Diablo, by Blizzard, is one of the first Blizzard Entertainment games i played. Very nice online play. However, it is a very old game, and the graphics arent the best, actually, they suck. Also, people on mu... ",
    "gameID": 0,
    "author": "I_Eat_Nails"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-05-20T00:00:00.000Z",
    "score": 9.4,
    "comments": "one of the best hack n slash RPG of all time very fun single player with and ok multiplayer if only the game was longer!\nDiablo is one of the best action RPG\u0027s of all time. It set the bar extremely high for all future action RPG that came after it and spawned numerous copy cats cough..cough... fate. Diablo is simply a maste... ",
    "gameID": 0,
    "author": "johnny27"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2006-05-27T00:00:00.000Z",
    "score": 9.4,
    "comments": "You wount want to leave your computer!\nThis game is so additive that you just will not want to quite graphics are not tha great but the game makes up for it self. The best part is everthing is random so you never know whats going to happen or what your going ... ",
    "gameID": 0,
    "author": "-Resident-Evil-"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-06-12T00:00:00.000Z",
    "score": 9.7,
    "comments": "Diablo I has the best replaybility I have ever seen in a PC game\nFirst off I\u0027ll start this off with a bit about the game then say things that I like and dislike about the game. Diablo has a good story, nice graphics (for when it was made) and has the best replayability I have ever ... ",
    "gameID": 0,
    "author": "dzms"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-06-18T00:00:00.000Z",
    "score": 9.6,
    "comments": "Love at first sight. Innovation is a beautiful thing.\nAh diablo. I don\u0027t know what spurred me to right this review, now that even Diablo II has been out for years. This is one of the finest games I have ever played. Diablo was innovative and addictive. The only downfal... ",
    "gameID": 0,
    "author": "Lysam"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-06-29T00:00:00.000Z",
    "score": 9.4,
    "comments": "If you like games you will willingly and happily give this game 40 hours of your life or more...\nLet\u0027s just start off by saying that if you don\u0027t have his game, something is wrong with you. This game start off by having you choose your character type between a warrior, mage or rogue. All three classes play very d... ",
    "gameID": 0,
    "author": "baelrrogg"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-07-02T00:00:00.000Z",
    "score": 8.7,
    "comments": "Today the game will look old, but the gameplay is still addictive and an interesting story makes this a real classic.\nGameplay: The gameplay is really simple, the only thing you will use is your mouse, and a couple of keys. You are constantly rewarded with new items, level up\u0027s and new spells and monsters to keep you entertained. The... ",
    "gameID": 0,
    "author": "Forgetthename"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-18T00:00:00.000Z",
    "score": 9.3,
    "comments": "Blizzards First True RPG-Gem\nBack when this game came out, people\u0027s jaws dropped in awe. It was amazing. Besides, what is cooler than leveling up on the way down to the fiery pits of hell to kill a Christian bad-ass? NOTHING. I never expected th... ",
    "gameID": 0,
    "author": "XDeragusX"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-07-21T00:00:00.000Z",
    "score": 9.8,
    "comments": "While now, so dated, the graphics actually hurt ones eyes to look at, this game, in its day, was the best of the best.\nCertain games stand the test of time better than their peers. Diablo is one of them. With space as an ever shrinking resource in my room, every new game disk I buy gets its bulky jewel case and paperwork tossed the min... ",
    "gameID": 0,
    "author": "_50bmg"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2006-07-22T00:00:00.000Z",
    "score": 9.4,
    "comments": "A classic highly addictive dungeon crawling adventure...\nOk, Officially Diablo has been out there for ages and due to its incredible addictive gameplay it has become a instant classic and even a kind of a genre, people are often referring to games like “this is Diablo-like”. ... ",
    "gameID": 0,
    "author": "Charlie2688"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-22T00:00:00.000Z",
    "score": 9.3,
    "comments": "Blizzard Are Amazing They Can\u0027t Make A Bad Game. Diablo Is Amazing. Nuff Said.\nDiablo For PC. Diablo is not all that new anymore, in fact Diablo II has been on the shelves for some time. And after playing the sequeli felt quite motivated to conjure up this review of the thing that started it all... ",
    "gameID": 0,
    "author": "gta11"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 6,
    "date": "2006-07-23T00:00:00.000Z",
    "score": 9.8,
    "comments": "The fact that Diablo can be so addicting even 10 years after it\u0027s release really says something about the game.\n*Please keep note that some characteristic in the game (graphics, sound, and even gameplay at times) are all graded based on the standards at the time of release. If you find any inaccuracies, have any suggestions, or ev... ",
    "gameID": 0,
    "author": "zub1"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-07-28T00:00:00.000Z",
    "score": 8.9,
    "comments": "Huge array of weaponry, items, monsters, quests, it never gets dull.\nDiablo starts out by you having to choose one man or woman who must save the small little town that has been plagued by Diablo and his minions. There are three main characters the wizard, The warrior, The rogue. They eac... ",
    "gameID": 0,
    "author": "megafeck"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-29T00:00:00.000Z",
    "score": 9.9,
    "comments": "One of the best if not THE best rpg yet\nthis is my first review so sorry if its bad Diablo one of the best rpgs of all time if not the best it has unlimited weapons and armor and u\u0027ll never get board cause the maps allways change each game u play that reall... ",
    "gameID": 0,
    "author": "Taloskai"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-08-04T00:00:00.000Z",
    "score": 9.3,
    "comments": "A must own for PC.\nThis is the kind of good RPG needed for PC. Blood, evil, and addicting gameplay. Diablo has it unlike most RPG\u0027s. This is a game that a person should have if they own a PC, even a Windows 95/98. Trust me, I\u0027ve played it ... ",
    "gameID": 0,
    "author": "Dunnie91"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-08-04T00:00:00.000Z",
    "score": 9.6,
    "comments": "Diablo is a classic, and a FANTASTIC one as well.\nDiablo is one of the first RPG\u0027s i\u0027ve tried, and for its time it was a fantastic game, and is still great even today. While Diablo II after my oppinion has pretty much flopped in it, the first one while still be remember... ",
    "gameID": 0,
    "author": "mand_450"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-08-06T00:00:00.000Z",
    "score": 9.8,
    "comments": "\"You need to play it!\"\nEverybody needs to play Diablo to understand the beginning of modern games. The game has no major bug, just like all the products of Blizzard. Easy and fun to play. Extremely recommended. The voices of characters and e... ",
    "gameID": 0,
    "author": "Alonedog"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-08-13T00:00:00.000Z",
    "score": 9.4,
    "comments": "This was a great game.\nDiablo has some very good things going for it. One, its simple. Point and click and thats where you attack with both ranged and melee attacks, move to and pick up items. Two, the interface is simple. items stack in yo... ",
    "gameID": 0,
    "author": "nobeaner"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-08-31T00:00:00.000Z",
    "score": 9.4,
    "comments": "Sets the tone.\nGame-play: This games is extremely easy to learn. All you have to do is talk to the people in the town and explore the dungeon, killing everything in your way and collecting all the items you find. The difficulty increa... ",
    "gameID": 0,
    "author": "jm4847"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-09-02T00:00:00.000Z",
    "score": 9.3,
    "comments": "A very unique and renovating game to start of a new era.\nThe game that had a hand in starting the hack and slash genre and on-line play for retail RPGs. Play as one of three character classes; Warrior, Mage or Rogue. Extensive replay value; missions change with every new g... ",
    "gameID": 0,
    "author": "curtizio"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 6,
    "date": "2006-09-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "Diablo - A must have. It is a gaming experience no one should leave behind. It is one of the best games of all time.\nFirst of all let\u0027s start with the title: Diablo What can you tell? It has something to do with the darkness or demons. When I first bought it the first impression I had was terrorizing. I was about 10 years old and... ",
    "gameID": 0,
    "author": "Franknight"
  },
  {
    "helpfulCount": 65,
    "helpfulScore": 6,
    "date": "2006-09-08T00:00:00.000Z",
    "score": 1.4,
    "comments": "A Church with 484675865 levels????\nI have to say, Diablo was saved when they made the second. The first was horrible top say the least. I do not know what Blizzard was thing when making the whole entire game take place in a church that goes underground FO... ",
    "gameID": 0,
    "author": "Shacks210"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-09-13T00:00:00.000Z",
    "score": 9.1,
    "comments": "Traversing the dungeons of diablo\u0027s lair is creepy and exciting.\nDiablo is a role playing game that pits your character against diablo and all of his sinister abominations. When you first start the game you\u0027re given the choice of 3 characters to choose from: warrior, rogue and sorcere... ",
    "gameID": 0,
    "author": "nimmow"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2006-10-09T00:00:00.000Z",
    "score": 9.6,
    "comments": "The start of a genre, a milestone, classic written all over it etc..\nThis game is obviously one of the all time classics. And it’s fun to write a review about this game in this day of time; that’s because one can compare it now with more recent games and look what was really unique about ... ",
    "gameID": 0,
    "author": "Marco1402"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-10-26T00:00:00.000Z",
    "score": 9.4,
    "comments": "god i love this game\nThis really is one of those games that really is a breath of fresh air, it outdid all games that were out around its time, and i wouldnt be suprised if it broke all their sales records as well. This game, compared to now... ",
    "gameID": 0,
    "author": "jamez504"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-11-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the greatest games of the 90\u0027s, quite possibly one of the greatest games ever.\nAhhh...Diablo. Thinking of this game brings flashbacks of neglecting my high school homework, and pulling all-nighters. I started playing Diablo back in 2000, 4 years after it had already come out. Once the Tristram t... ",
    "gameID": 0,
    "author": "ICEMAN803"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-11-22T00:00:00.000Z",
    "score": 8.4,
    "comments": "Diablo with upgrades!\nHellfire is basically just an expansion pack to the famous game known as Diablo. Hellfire adds some cool new features to Diablo. These features include items\u0027 spells\u0027 levels\u0027 monsters and other cool features. In addition... ",
    "gameID": 0,
    "author": "MickeySteroid"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-11-22T00:00:00.000Z",
    "score": 8.4,
    "comments": "Fight the SEXY forces of darkness as you watch your demonic foes perish in hell!\nCarebears deluxe! Wait I am talking about the wrong game aren\u0027t I? Diablo is a roleplaying adventure game that you can give a great customization to your created character. There are 3 classes available to choose from... ",
    "gameID": 0,
    "author": "MickeySteroid"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2006-11-27T00:00:00.000Z",
    "score": 7.8,
    "comments": "fun\nPros: decent story, fun game play, free, lots of cool items, multiplayer, easy to understand, cheap. Cons: the graphics aren\u0027t very good its not very hard to get past though, not much sound, needed more plot, lots of ... ",
    "gameID": 0,
    "author": "justheretodl124"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-12-30T00:00:00.000Z",
    "score": 9.3,
    "comments": "Dioblo for PC\nThis is a very fun game and has a legend to it\u0027s name and has to be one of the most addicting games of the time and still is one of the most. The over and over hack and slash is just so amazing and addicting it\u0027s not eve... ",
    "gameID": 0,
    "author": "c_w_16"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-01-06T00:00:00.000Z",
    "score": 8.9,
    "comments": "Hellishly fun. And there is no better enemy death animation than that of the goatmen.\nIt\u0027s an old game but it\u0027s still fun to play once in a while. While the graphics are nothing spectacular, the gameplay is extremely riveting. Killing a few of the lower level monsters are really satisfying and though it g... ",
    "gameID": 0,
    "author": "umbracascade"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-01-19T00:00:00.000Z",
    "score": 9.6,
    "comments": "Must Have Game This Year\nThis Game is Whacked.Off the charts in this date of release.What other PC games are cool in this year?(1996)some are good,but this game rocks,it shapes the gaming world once more.This game can set a time bomb that can\u0027t ... ",
    "gameID": 0,
    "author": "BearWonderer"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-01-20T00:00:00.000Z",
    "score": 9.9,
    "comments": "You should own Diablo. It is easily one of the best games of its type.\n1996 was a good year for video games. It was the year Quake was released. It was one ofthe best first-person shooters of all time. If I were to play it, I think that I’d love it. Civilization II was also released. It was... ",
    "gameID": 0,
    "author": "Goliath_unit"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-01-23T00:00:00.000Z",
    "score": 8.7,
    "comments": "A can\u0027t miss adventure\nFor me this was really like playing two games. The single player dungeon was a treat to play. The hack and slash adventure was addictive with intense game play and interesting background music and effects. The lower d... ",
    "gameID": 0,
    "author": "kingrich06"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-02-11T00:00:00.000Z",
    "score": 8.5,
    "comments": "Diablo is a great action RPG with a good deal of replayability.\nBlizzard Entertainment is practically a household name in the gaming industry. One of the series\u0027 that Blizzard is most known for is Diablo, and the original Diablo is without a doubt worthy of being called one of Blizza... ",
    "gameID": 0,
    "author": "Talonfire"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-03-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "If you\u0027ve played Diablo, reading my review will simply be a confirmation of something you already know: this game rocks.\nDiablo, in my opinion, is the first completely successful combination of role-playing and real-time action to hit the PC. There have been successful RPGs and great action games, but never a combination that played so eas... ",
    "gameID": 0,
    "author": "darussell1958"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-03-15T00:00:00.000Z",
    "score": 8.8,
    "comments": "Enter a world where creatures lurk in the shadows and feed on the fallen. That world is Diablo!\nI got this game as a surprise from my parents when I was somewhere around 8. As soon as I played it, it was love at first, but that happens often. The gameplay was like many dungeon crawlers. You go around killing thi... ",
    "gameID": 0,
    "author": "Cyrax-Sektor"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2007-03-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "A landmark revolutionary shift in the greatness of gaming!\nDiablo is an instant classic not just for being an epic title but more so for the immediate effect it had on revolutionizing the direction of gaming. Randomly generated dungeons, items, and quests allowed for massive re... ",
    "gameID": 0,
    "author": "-Saigo-"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2007-03-31T00:00:00.000Z",
    "score": 6.8,
    "comments": "I would remember Diablo much more fondly had I not enjoyed the second one so much more.\nDiablo is, without a doubt, a revolutionary game. It found a way to make monotonous hack and slash not seem all that monotonous, and managed to spawn a sequel that is still, to this day, my favorite multiplayer online g... ",
    "gameID": 0,
    "author": "walrusgod"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-04-10T00:00:00.000Z",
    "score": 9.2,
    "comments": "In it\u0027s day: AWESOME Today: weak sauce\nThis game was one of the first games i ever bought for the PC. i only did because my friends were playing it so much. My life was forever changed the day i brought it home, mostly in the sense that everythign else in th... ",
    "gameID": 0,
    "author": "ryguybond"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-04-11T00:00:00.000Z",
    "score": 9.4,
    "comments": "This is still one of the greatest games out there, (which is why it was rated higher than W.O.W.)\nIf you have played this game, you know what im talking about, this game is amazing despite its looks. Considering the fact that this game was made 11 years ago, the graphics are somewhat decent, they have a gba type of ... ",
    "gameID": 0,
    "author": "theperson717"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-04-15T00:00:00.000Z",
    "score": 9.0,
    "comments": "Probably the hardest game i ever played and finaly scary or atleast some what.\nalthough its graphics arent surprisingly good for its time the gameplay and adventure you willl expeirience in this game is just absolutley stunning. let me start with the beggining blizzard always makes great cinematics... ",
    "gameID": 0,
    "author": "Marshalldbdx"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-04-16T00:00:00.000Z",
    "score": 9.1,
    "comments": "Engrossing action, simple set of controls and interesting level designing makes it a very addictive game.\nDiablo is one of the few RPG I really enjoyed so far. I normally dread RPGs because the kick start time takes too long, plus controls can be quite cumbersome. Diablo makers understands gamers like me and designed it in s... ",
    "gameID": 0,
    "author": "sharier"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-04-18T00:00:00.000Z",
    "score": 9.4,
    "comments": "Very fun; one of the most influential and important RPGs in gaming history\nI cannot believe this game has been out for a decade, and it still sorta feels like I got it yesterday. Even though it isn\u0027t anything special by today\u0027s standards, many modern RPGs wouldn\u0027t exist if it weren\u0027t for the Di... ",
    "gameID": 0,
    "author": "koolmankris"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2007-04-26T00:00:00.000Z",
    "score": 7.4,
    "comments": "Intresting RPG game though RPGs are not quite my thing depending on what the topic is.\nGameplay: That game was Diablo, is based on the premise that you have to exorcise demons from a church, you embark on a giant dungeon crawl spanning many floors and sidequests. So the controls is pretty basic you use the... ",
    "gameID": 0,
    "author": "RedneckGamer87"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-04-26T00:00:00.000Z",
    "score": 7.5,
    "comments": "Good RPG game but not my type of gameplaying experience but it depends on the topic then I\u0027ll play it.\nGameplay: That game was Diablo, is based on the premise that you have to exorcise demons from a church, you embark on a giant dungeon crawl spanning many floors and sidequests. So the controls is pretty basic but it\u0027s no... ",
    "gameID": 0,
    "author": "RedneckGamer87"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-04-26T00:00:00.000Z",
    "score": 8.1,
    "comments": "Good RPG game but not quite my type of gaming style depending on what it is.\nGameplay: That game was Diablo, is based on the premise that you have to exorcise demons from a church, you embark on a giant dungeon crawl spanning many floors and sidequests. So the controls is pretty basic you use the... ",
    "gameID": 0,
    "author": "RedneckGamer87"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-04-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "Incredible\nHa Ha Ha this is my first Rpg game I played, I`ve stayed up nights and nights and this game really worth to play. For that time was a good graphic an excellent story it was just amazing. I`m sorry that I didn`t have the ... ",
    "gameID": 0,
    "author": "emi_nem_313"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-04-30T00:00:00.000Z",
    "score": 9.6,
    "comments": "Evil draws close.....\nDiablo, was released during the mid 90\u0027s and has proven to be a classic in RPG gaming. Diablo is another edition to the Blizzard collection, the same company that has brought Warcraft1,2 and the forgotten Lost Vikings.... ",
    "gameID": 0,
    "author": "Beefycake"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-05-04T00:00:00.000Z",
    "score": 9.4,
    "comments": "Nostalgia anyone? Diablo redefined a genre.\nThis was one of the first games that really brought me into computer gaming when I was in third grade. I remember playing the demo at my friends house after school and getting totally hooked on the action. Suffice to ... ",
    "gameID": 0,
    "author": "ZeshiO"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-05-12T00:00:00.000Z",
    "score": 8.2,
    "comments": "The Mouse Killer...\nWe\u0027ve all done it. You went to the check out counter in the local grubby used computer parts place, and bought three, used, mice. Cheap. It\u0027s because when you played Diablo you click spammed EVERYTHING like there was ... ",
    "gameID": 0,
    "author": "WeyrCat"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-05-12T00:00:00.000Z",
    "score": 9.2,
    "comments": "Blizzard\u0027s Materpiece...... Greatest game in this genre\nDiablo where one of the first games I played on pc, with Doom of course. Lets say thinks about the wonder Story: You are a warrior / archer [best class] / mage that live in the city of Tristram. One day the High-Pr... ",
    "gameID": 0,
    "author": "TheSephiroth"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-05-19T00:00:00.000Z",
    "score": 9.3,
    "comments": "The good, the Bad, the revoulution.\nTake a little time to think right now. Have you ever played an \u0026quot;Action role-playing game\u0026quot; before? You know, Dungeon siege, Sacred, that sorta thing? Did you like it? You owe it all to Diablo. The first born of ... ",
    "gameID": 0,
    "author": "Hex008"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2007-05-26T00:00:00.000Z",
    "score": 8.0,
    "comments": "heh i sucked at diablo...thought other people didnot like it..but i didnt know it was THIS good\ni sucked when i first played it...peroid...i didnt expect it to get a 9.6....the corpses never disappear....but if its a blizzard game i keep playing...warrior sucks my friend sugggested me playing with sorcerer and it w... ",
    "gameID": 0,
    "author": "S0mEGuY12"
  },
  {
    "helpfulCount": 33,
    "helpfulScore": 3,
    "date": "2007-06-04T00:00:00.000Z",
    "score": 2.8,
    "comments": "Disappointing, to say the least.\nI bought this game after a couple years of playing Diablo II (which is one of my favorite games ever, by the way), and I was thoroughly disappointed. It\u0027s entirely possible that that\u0027s just because I was obviously hol... ",
    "gameID": 0,
    "author": "wizardmon5"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-06-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "Excellent game\nA great game for the time it was made, there are only 3 classes in this one, but i purchased the expansion hellfire, The classes are not equal, thats one of the flaws of the game, but if you use sorceror your pretty sure... ",
    "gameID": 0,
    "author": "steelsoldier666"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-06-08T00:00:00.000Z",
    "score": 9.3,
    "comments": "The Godfather of hack\u0027n\u0027slash.\nIt\u0027s an old game now in terms of graphics and gameplay depth, but Diablo is proudly the pioneer of the genre - \u0026quot;Hack\u0027n\u0027Slash\u0026quot;. This is the game that hooks gamers to spend so much time on such a simple premise, ... ",
    "gameID": 0,
    "author": "KingLim"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-07-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the greatest games ever :D\nWhere o Where to start about this game... it\u0027s just so good it dazzles me to this day. I\u0027m still playing this game witch is an achivement in it\u0027s own right, I\u0027ll play most games like 2 hours and throw it away into a corn... ",
    "gameID": 0,
    "author": "KillswitchNL"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-07-16T00:00:00.000Z",
    "score": 9.2,
    "comments": "One of Blizzard\u0027s finest pieces of work.\n+ Very, very addictive and fun. + Graphics only use 256 colors and look how well they came out. - Game is a bit difficult after a while. May not appeal to learners. - Hacking sometimes sticks and is almost impossible ... ",
    "gameID": 0,
    "author": "DryvBy2"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-07-22T00:00:00.000Z",
    "score": 9.1,
    "comments": "An intense and action packed game worth its age. The game was made in 1996 or so. (I forgot) It was the first of its kin\nThe game has fun gameplay, horrific monsters and various quests. The game is one in which you click and move. Such easy controls. but, it is as expected. Ultimately the games goal is to lead you to fight Diablo. The game... ",
    "gameID": 0,
    "author": "SpectralDoubt"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-08-05T00:00:00.000Z",
    "score": 9.3,
    "comments": "with this game you can play the rouge the sorceoror or the warrrior and your duty is to...\nwith this game you can play the rouge the sorceoror or the warrrior and your duty is to destroy the demonic creatures that dwell within your town, i havent played this game for a while but i remember my guy was like a le... ",
    "gameID": 0,
    "author": "theKJ0012guy"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-08-06T00:00:00.000Z",
    "score": 9.6,
    "comments": "The epitome of Dungeon Crawlers.\nA long time ago, on a PC far far away, I had gotten my hands on the first demo of Diablo, by the legendary blizzard, and had immediately fallen in love with the game. Hopefully, you\u0027ll get the same feeling if you happen ... ",
    "gameID": 0,
    "author": "VitaExodus"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2007-08-07T00:00:00.000Z",
    "score": 9.8,
    "comments": "the best 2palyer RPG co-op game ever.\nyou can spend endless hours in this game, and have so much fun. but you can only pick 3 classes, warrior, hunter and wizard still, if you have the old ps console(or ps2 or ps3, don\u0027t know if they can play this game), t... ",
    "gameID": 0,
    "author": "okki44"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2007-08-20T00:00:00.000Z",
    "score": 7.5,
    "comments": "If you haven\u0027t played this game, find yourself a new rock to live under!\nthis is the game that (i know this sounds cheesey) took the world by storm ,BLAH i can\u0027t believe i just said that.... such a cliche, but hey , thats exactly what it did. addictive, innovative, freakin awesome, please,... ",
    "gameID": 0,
    "author": "CaptainBlaze"
  },
  {
    "helpfulCount": 46,
    "helpfulScore": 3,
    "date": "2007-08-24T00:00:00.000Z",
    "score": 1.0,
    "comments": "OLD game\nWhen i got my diablo battle chest i was so dissipointed proboly becasue the fact that it was so old but for old games from about 11 years old its sorta good My review for this game is stop drop it androll it over to the ... ",
    "gameID": 0,
    "author": "UntoldLegendMan"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2007-08-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "Diablo is a dark fantasy-themed hack and slash action-adventure game developed by Blizzard North. This games is awesome!\nStory The story of Diablo is based on the premise of a war between Heaven and Hell. The town of Tristram has come under attack by demons, and the player must save the town and, in effect, the world, by ridding it of t... ",
    "gameID": 0,
    "author": "bigb89"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-09-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "Awesome PC game! An oldie, but definetly one of the best.\nDespite that this is now considered a very dated game by today\u0027s standards, it still reflects as one of the finest RPG dungeon crawlers I\u0027ve played. It has great replay value, especially if you own it with the expansion ... ",
    "gameID": 0,
    "author": "mp3delicious"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 0,
    "date": "2007-09-12T00:00:00.000Z",
    "score": 7.0,
    "comments": "Not a game I would play today.\nI was too little when this game had its release. And I played Diablo II first. I just thought you should know why I won\u0027t give this game so much praise it probably deserves. I could probably play this again, if me and... ",
    "gameID": 0,
    "author": "_Horde"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-09-15T00:00:00.000Z",
    "score": 8.0,
    "comments": "Classic RPG Hack and Slash fun.\nI have been playing both Diablo as well as Diablo: Lord of Destruction for years. I have noticed that a lot of today\u0027s gamers tend to discount the original because it doesn\u0027t look as pretty and doesn\u0027t have the variety o... ",
    "gameID": 0,
    "author": "lokikitty"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 4,
    "date": "2007-09-24T00:00:00.000Z",
    "score": 7.0,
    "comments": "Its a OK game.\nI surprised on how high diablo was rated. Diablo has OK graphics. OK gameplay. OK sound. And basically ok everything. After you played diablo for awhile it starts getting boring. Its a good game but theres NO WAY i could... ",
    "gameID": 0,
    "author": "Jacob72993"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2007-09-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the greatest games ever made. Probably the father of all RPG games.\nThis game just changed the way of seeing RPG game for ever and if you look on the modern games you will notice that the trade screens and text ir dialogues are all based on this game. Easily one of the greatest games eve... ",
    "gameID": 0,
    "author": "Pablo_SL"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2007-10-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "Diablo is the first Action Role-Playing title, but it does not mean that it\u0027s a dated game even after all these years.\nDiablo is the first Action-RPG in the gaming history. While some RPG games back in 1996 already featured real-time combats, Diablo shows up with a new genre. Call it Hack \u0027n Slash or Action Role-Playing, which are differ... ",
    "gameID": 0,
    "author": "ChristianKiss"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2007-10-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is the best game ever to be released by BLIZZARD\nIve finished this game more than fifteen times and i cant get enough of it. The story is great the graphics are pretty good too. it has awesome items and the characters are the classic ones Mage Ranger Warrior my favouri... ",
    "gameID": 0,
    "author": "Dalmanimous"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2007-10-31T00:00:00.000Z",
    "score": 9.5,
    "comments": "If you don\u0027t mind dated graphics, then this game is absolutely flawless.\nThis game is truly a instant classic. Back in the day it was like the OoT for the PC. Meaning it was a breakthrough and everyone loved it! The Vast Areas to explore, the leveling up, all the weapons and armor, and all th... ",
    "gameID": 0,
    "author": "xMeHRuNeSDaGoNx"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-10-31T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best in everytime and everywhere\nIt is certainly old but unforgettable classic. I am still playing it time to time and whenever I play I go to the journey to past with my memories. All those manas, weapons, music are excellent. Storyline is the best I h... ",
    "gameID": 0,
    "author": "cenneli"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-11-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "All praises to Diablo, lord of the RPG genre.\nTo summarize what I think about this magnificent game I would have to say that it is a masterpiece of its genre, grandfather, patriarch of the action RPG games to follow. I\u0027ve played Diablo II firstly and found it prett... ",
    "gameID": 0,
    "author": "nichavgo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-11-11T00:00:00.000Z",
    "score": 9.0,
    "comments": "One of the almighty leaders of the Golden Age of Role Playing Games, Diablo is possibly the best RPG of the 90s.\nGameplay--9/10 -------------------- Diablo sports the classic hack-and-slash system popularized…well, Diablo actually did a decent job of making this system popular on its own. With 3 different unique classes, the repl... ",
    "gameID": 0,
    "author": "akazergling2"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2007-11-14T00:00:00.000Z",
    "score": 7.5,
    "comments": "Best of it\u0027s time!\nVery short, but addictive game. Horrible graphics, ok music, but great for it\u0027s time. Gameplay was a little buggy. The story was definitly unique. The items were scarce, and things to do as missions go were few. Th... ",
    "gameID": 0,
    "author": "wizoforb"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-11-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "Simple yet complex. It reinvented its genere such that all following RPG\u0027s drew upon in some form.\nWhen Diablo came out, the role playing scene was pretty stagnant. What it did for RPG\u0027s was kindle a new life into the genre. The main factor that put it above the rest of the games at the time, were the varieties and co... ",
    "gameID": 0,
    "author": "FireBird228"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-12-07T00:00:00.000Z",
    "score": 9.5,
    "comments": "Diablo is hands down one of the best action role playing games to ever hit the PC.\nA good way to start off this review is to turn back the clock to November, 1996. Ahhh, the was back when PC gaming was still in its youth. One of the more popular PC game developers was Blizzard Entertainment. They were ... ",
    "gameID": 0,
    "author": "spiderman120988"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-12-08T00:00:00.000Z",
    "score": 9.0,
    "comments": "Provided the early concept for Diablo II and World of Warcraft in gameplay.\nDiablo was a masterpeice of an old school dungeon run. It allowed you to pick between a Warrior, Rogue or Sorcerer. The class you picked had a big influence on the way the game had to be played as each class played out v... ",
    "gameID": 0,
    "author": "Mudcaked"
  },
  {
    "helpfulCount": 15,
    "helpfulScore": 5,
    "date": "2007-12-09T00:00:00.000Z",
    "score": 8.0,
    "comments": "This game has so much going for it, but suffers from one major flaw.\nWell, some of you may be wondering why I have given this an 8.0 when almost everyone else has given it 9.0-10. There are many things that would make this game superb but one thing that qualifies in my opinion as merely f... ",
    "gameID": 0,
    "author": "Benevolentbob"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-02-04T00:00:00.000Z",
    "score": 9.5,
    "comments": "Diablo-One of the best games ever!\nNow I\u0027m going to review a wonderful game, and one of my favorite games of all time, Blizzard Entertainment\u0027s classic, Diablo. The dark story of three people\u0027s journey into the heart of darkness evokes more emotion than a... ",
    "gameID": 0,
    "author": "mircea_calarasu"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-02-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "Randomly generated dungeons with the ring of medieval sorcery at it\u0027s finest.\nBack in 1996, very few people had heard of Blizzard entertainment. They had mild successes with Warcraft One but Warcraft Two seemed to open some eyes. By the time Diablo came out, everyone was listening to what this s... ",
    "gameID": 0,
    "author": "WinWalter"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2008-02-10T00:00:00.000Z",
    "score": 6.5,
    "comments": "An official expansion by another company makes for odd bedfellows.\nIt would be hard to argue that Diablo for the PC was not a runaway success. It sold millions of copies and the free play on the internet with random dungeons every time you went down to try to slay monster after monster... ",
    "gameID": 0,
    "author": "WinWalter"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-02-18T00:00:00.000Z",
    "score": 9.0,
    "comments": "Diablo 1 has revolutionize rpg in terms of gameplay.\nFirst the Good Things: Gameplay: Revolutionizing gameplay. Many customizations with ur characters. Sounds: Incredible sounds (back in that time) Graphics: Even though it was 2d-ish graphics the game looked very ... ",
    "gameID": 0,
    "author": "smokedbeef"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-02-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best hack-n-slash game, period.\nI remember getting Diablo as a Christmas gift back in \u002797, a year or two after it had first come out. At the time I was intrigued by the box graphics, and all the great reviews I had read about the game. At that time I h... ",
    "gameID": 0,
    "author": "dshaw62197"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2008-03-04T00:00:00.000Z",
    "score": 9.0,
    "comments": "OK\nThis game is pretty good for most of the \u0027\u0027 older generation\u0027\u0027 of gamers.. but I wouldn\u0027t recommend it to anyone under the age of 40 because most of the younger people have gotten to used to nice graphics. That bei... ",
    "gameID": 0,
    "author": "RPGamer1215"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-03-13T00:00:00.000Z",
    "score": 9.5,
    "comments": "The game that gave birth to the legendary war of Humans vs. Demons in an action role playing and purely demon slaying...\nChoosing different characters in Diablo with different moves and skill tree to level up, the role playing adventure game just reached quite a popularity over gamers. Although gameplay graphics are not that refined yet co... ",
    "gameID": 0,
    "author": "VHRS05"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-04-07T00:00:00.000Z",
    "score": 9.5,
    "comments": "It\u0027s the blue print for all RPG.\nIn fact it\u0027s the first RPG I ever played and so it seems to me that every following games follow the formula of Diablo. But I am sure many other players agree that this game has in it many features that a successful RPG ... ",
    "gameID": 0,
    "author": "Lovely_beauty"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 9,
    "date": "2008-04-12T00:00:00.000Z",
    "score": 9.5,
    "comments": "Simple and Addictive.\nDiablo is a simple RPG made by Blizzard, in 1996. The premise of the game is very simple, explore the depths of the church and kill all the monsters. Yet, the game manages to be very complex and satisfying, because the n... ",
    "gameID": 0,
    "author": "chandu83"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-04-13T00:00:00.000Z",
    "score": 8.5,
    "comments": "Diablo is what you would cool these days \"cool\" but it is actually very very entertaining. great multiplayer.\nDiablo was a masterpeice of an old school dungeon run. It allowed you to pick between a Warrior, Rogue or Sorcerer. The class you picked had a big influence on the way the game had to be played as each class played out v... ",
    "gameID": 0,
    "author": "_EXCON_"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-04-18T00:00:00.000Z",
    "score": 8.0,
    "comments": "This game is great but slow at start\nThis game is very fun to play especially online with your friends or anyone across the world and play side by side. The one problem is, is that the game starts off a little slow. Basically you are in a dungeon for awhi... ",
    "gameID": 0,
    "author": "KyleStilkey"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-04-27T00:00:00.000Z",
    "score": 9.5,
    "comments": "Awsome Dungeon Crawler! Very Addictive Gameplay!!\nA lot of people will debate whether or not this game is better on the PC or PS1, well in my opinion i like the ps1 version more because i find using a controller is a lot easier to use the a mouse and keyboard. As i wrot... ",
    "gameID": 0,
    "author": "pantera_86TB"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-05-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Diablo a Devil of a game\nDiablo was released on Nov, 30, 1996 and soon became one of the greatest RPG of its time. The game was extremely addicting and repayable due to the dynamic dungeons and vast customizable characters. Diablo has three main... ",
    "gameID": 0,
    "author": "krondor13"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-05-29T00:00:00.000Z",
    "score": 8.0,
    "comments": "Just what the doctor ordered!\nFirst off, i would like to point out that there are numerous rpgs out there. In fact, there are probably just to numerous to count. What we have here is an a port of an already popular pc game. For those who are in the ... ",
    "gameID": 0,
    "author": "waggs44"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2008-06-12T00:00:00.000Z",
    "score": 9.5,
    "comments": "A good game for 1996\nDiablo is a dark fantasy-themed action role-playing game developed by Blizzard North and released by Blizzard Entertainment on January 2, 1997. Set in the fictional Kingdom of Khanduras (located in the Diablo series f... ",
    "gameID": 0,
    "author": "FireBirdPheonix"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-06-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "Diablo 1, one of the best rpg ever created (Full Review Inside)\nDiablo 1 is one of the most amazing rpg ever created, it is so addicting that in this year the game is still fun, I mean so many years have passed but still the game manages to stay fun and good, many people still like i... ",
    "gameID": 0,
    "author": "biggamefreak"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-07-04T00:00:00.000Z",
    "score": 9.0,
    "comments": "After so many years, still hold the bar for many dark RPG adventure games.\nAfter so many years Diablo still holds it\u0027s title gained back in 1996 as one of the worlds greatest dark hack n\u0027 slash RPG adventure game. Where is graphics have dated and arent worth much. Still, does not hold me or ... ",
    "gameID": 0,
    "author": "downsider"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-07-05T00:00:00.000Z",
    "score": 9.5,
    "comments": "Diablo (hacking the review)\nthis is a cool RPG game, all the artifacts you find and the monsters you kill...all I\u0027am saying is that if you like old skool games, RPG and just waving your sword around and hacking them to pieces (one blow ane kill an... ",
    "gameID": 0,
    "author": "akarrash"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-07-07T00:00:00.000Z",
    "score": 8.0,
    "comments": "The beginning of obsession\nI almost felt guilty in my cubicle playing Diablo. Almost.... Many people call this game Diablo I but I know its just \"Diablo\". The graphics were alright but the music and the sound effects, simply powerful. The co... ",
    "gameID": 0,
    "author": "hsedai"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-07-08T00:00:00.000Z",
    "score": 9.5,
    "comments": "More addictive than chocolate flavoured crack. Will always be getting regular rotation in my CD drive til i die...\nMan...Diablo. What can you say about a game that took over about 2-3 years of your life? The amazing thing upon first play was that i could not believe how overrated it was...\"WTF?! You just run around and left click on ... ",
    "gameID": 0,
    "author": "KidKombo"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2008-07-23T00:00:00.000Z",
    "score": 8.0,
    "comments": "This add-on extends the life of one of the best RPG Action games ever released.\nDeveloped in 1997 by Synergistic Soft., Hellfire is a great add-on to Blizzard\u0027s Diablo. If you don\u0027t know, Diablo is a RPG Action that the player will mostly left-click a target to attack with the controlled character. ... ",
    "gameID": 0,
    "author": "ChristianKiss"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-07-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "SS Free\u0027s review of Diablo\nDiablo is possibly the best RPG ever made. Diablo changed the way RPGs are all-together. Diablo was the first Battle.net game ever released, there are four downisdes to Diablo however: there is no stat tracking, Blizza... ",
    "gameID": 0,
    "author": "xgmx"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-09-01T00:00:00.000Z",
    "score": 9.0,
    "comments": "Diablo is an amazing game and definitely a classic.\nI was a huge fan of Diablo 2 back in the day, but one thing that\u0027s always bothered me is that I never played through the original Diablo! So I finally decided to buy it and to be honest I was very impressed considering ... ",
    "gameID": 0,
    "author": "death919"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 0,
    "date": "2008-09-12T00:00:00.000Z",
    "score": 7.0,
    "comments": "Diablo is a really old game.\nDiablo is a really old game and loading it on to your PC these days won\u0027t really keep you playing for very long. Unless you have a burning desire or a friend has somehow challenged your gaming skill, then playing Diablo ... ",
    "gameID": 0,
    "author": "spadeslie"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-09-13T00:00:00.000Z",
    "score": 8.0,
    "comments": "A little short, but maybe that\u0027s because I\u0027m too used to games like Oblivion.\nDiablo is an extremely addictive game, sadly I feel it was cut a little short. After picking it up rather cheap, I had finished it within the span of 2 days and immediately proceeded to begin another character. I expe... ",
    "gameID": 0,
    "author": "bxela"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-09-16T00:00:00.000Z",
    "score": 8.5,
    "comments": "My first impression of it was that it looked OLD, but it\u0027s very fun to play through over and over again.\nThe first thing modern PC gamers will notice about Diablo is that it looks terrible compared to newer games. Watching a 30 second clip of the game would make it seem really boring. It isn\u0027t even very deep. It\u0027s a very si... ",
    "gameID": 0,
    "author": "EACHNAMEISTAKEN"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 5,
    "date": "2008-10-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "The one, the only, the king of action RPGs.\nGameplay: 9 Graphics: 10 Sounds: 10 Value: 9 Tilt: 9 Actual score: 9.2 As technology improves from year to year it seems that video games are starting to get more complex as it feels that the impediment of techno... ",
    "gameID": 0,
    "author": "Azghouls"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-10-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "A dark,addicting slash and bash rpg that has set some of the standards for more modern games.\nDiablo is a classic that even through all these years,has shown no wear and tear on its popularity. Still to this date there are still plenty of people playing this game on battle.net with other adventurers. The story... ",
    "gameID": 0,
    "author": "rpgNerd321"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-10-15T00:00:00.000Z",
    "score": 9.0,
    "comments": "GG,It\u0027s good It\u0027s real good.\nNow I bought this game,Cept I didn\u0027t get the memory card so I been playing Hardcore like on d2 it\u0027s a great game though one of the oonly problems I seen 1 player has a grip of quests while 2 player has 2 quests that Ikno... ",
    "gameID": 0,
    "author": "Ubergosuprogg"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-10-28T00:00:00.000Z",
    "score": 8.5,
    "comments": "THE original Hack and Slash\nOk so maybe this wasn\u0027t the original Hack and Slash adventure but damn it was good. It had some great characters and some awesome quests to undertake. The random levels made replayability a must in this game. While th... ",
    "gameID": 0,
    "author": "darth_sibbs"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-11-02T00:00:00.000Z",
    "score": 9.5,
    "comments": "THE BEGINNING OF THE MEGA DIABOLICAL SERIES! THE BIG DADDY OF ALL RPG\u0027S\nThis is the game that paved the path for me onto hardcore gaming. The best RPG ever is a must for any player who is a fan of RPGs or is new to RPGs. What is more unique about the game is it\u0027s unique story. The story that... ",
    "gameID": 0,
    "author": "rohitmitra5752"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-11-14T00:00:00.000Z",
    "score": 9.0,
    "comments": "The template for Hack \u0027n\u0027 Slash Action RPGs. Great for its time. A modern review.\nTHE PAST In its time it was a highly addictive game. The atmospheric music, gothic-horror scenery, smoothly animated characters and monsters, the simple gameplay mechanics; it all contributed to the engrossing nature ... ",
    "gameID": 0,
    "author": "Torsive"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2008-11-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "Maybe it is a little late but I wanted to write my first review on gamespot for the best game ever.\nSimply, it is the best :) Totally addicting and brilliant story. When I first played it, it astonished me and took my breath away. I might try to find that cd and install it again. This game had the best cinematics of... ",
    "gameID": 0,
    "author": "kaiowasdeath"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-12-14T00:00:00.000Z",
    "score": 9.5,
    "comments": "Diablo is definately the best RPG ever to be developed.\nSome games are not recognized and underestimated by the time they are released, but with the passing of the years the pure artistry and the titans clash remain and are praised. Diablo is a characteristic example. The ... ",
    "gameID": 0,
    "author": "fandom888"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-12-26T00:00:00.000Z",
    "score": 9.5,
    "comments": "Not only had this game revolutionaty gameplay but also a very original story that still stands completly unmatched.\nThis game really had revolutionary gameplay, its is a very addictive Action-RPG where you collect new weapons and spells and advance through the levels but I probably dont need to further explain the hack-n-slash concept... ",
    "gameID": 0,
    "author": "GalenMyra"
  },
  {
    "helpfulCount": 14,
    "helpfulScore": 13,
    "date": "2009-01-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "One of the Best Action-RPGs ever to grace a console.\nDiablo - Playstation Other Platforms: PC Expansions: Hellfire - only PC Sequels: Diablo II and Diablo II: Lord of Destruction - also only PC Publisher: Electronic Arts Developer: Climax Release Date: 1998 Genre:... ",
    "gameID": 0,
    "author": "Paully3433"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2009-01-08T00:00:00.000Z",
    "score": 9.5,
    "comments": "Not into Online Multiplayer? THIS is the expansion pack for you!\nI\u0027ve played the original Diablo for quite some time. Then I played it briefly online. I got tired of cheaters. And BOTS !! Then I was given a copy of Hellfire. I haven\u0027t been back to the original version of Diabl... ",
    "gameID": 0,
    "author": "theobsessiveone"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2009-02-08T00:00:00.000Z",
    "score": 8.5,
    "comments": "Hacking and slashing and looting: there are few things better!\nThis classic and influential RPG is far too addictive to be healthy. Though, Diablo has a pretty simple premise and gameplay mechanics, the constant upgrades to your inventory, the bountiful looting, a bevy of myriad mon... ",
    "gameID": 0,
    "author": "dan6433"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-02-12T00:00:00.000Z",
    "score": 9.5,
    "comments": "Diablo is one of the best PC games made, and you have no excuse for not having played it.\nBlizzard took the hack/slash genre up a notch or two with its creative and always fun to play Diablo. In this game you control one of three main classes in a journey through a monastery that acts itself as a gate into h... ",
    "gameID": 0,
    "author": "wreckem406"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2009-02-27T00:00:00.000Z",
    "score": 6.5,
    "comments": "Take up your arms and defeat Diablo for the nth time if you want to take advantage of Hellfire\u0027s features.\nGameplay: 8 Graphics: 8 Sounds: 6 Value: 6 Story: 5 Note: The above stats are a representation of Hellfire and not Diablo hence the time spent is only in relation to the newer Hellfire quests. There are not man... ",
    "gameID": 0,
    "author": "Azghouls"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2009-03-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "You can\u0027t say you are an RPG gamer without having played this game.\nWhat could possibly be more scary than facing the evil himself? Diablo brings out one of the most glorious quest ever made: Defeat the Dark Lord. This game was the beginning of the classic RPG games. With storyfull ques... ",
    "gameID": 0,
    "author": "pk86"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2009-03-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "Para mim, nenhum game supera Diablo, anos e anos jogando, e sei q há algo q ainda não vi...\nSimplesmente o melhor jogo no estilo, \"e também no meu ranking geral\" na minha opinião. Atmosfera incrível, excelente som, jogabilidade impressionante. Joguei \"e ainda jogo às vezes\" durante anos, sempre encontrando iten... ",
    "gameID": 0,
    "author": "ivanfidelis"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2009-04-06T00:00:00.000Z",
    "score": 9.0,
    "comments": "Muito bom! Excelente conversão para PSOne!\nMuito bom! Excelente conversão para PSOne! - O gráfico é um pouco fraco, concordo, mas é só ativar a opção de SUAVIZAR GRÁFICOS do PS2 que fica muito bom! - Todos os itens do original estão presentes (incluindo os únic... ",
    "gameID": 0,
    "author": "Rochester_FS"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2009-04-12T00:00:00.000Z",
    "score": 8.5,
    "comments": "For some reason i liked first Diablo always more than the second. Wth?\nIt is definitely creepier and harder, than it\u0027s sequel. Even some \"death animations\" are better looking. There\u0027s not much new to tell here, because, probably, everyone knows this game. It is extremely popular? And \"Diab... ",
    "gameID": 0,
    "author": "Cmpunmu3"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 4,
    "date": "2009-05-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "Have fun with Na-Krul in his hellish crypt!\nHellfire is an unofficial expansion for Diablo - unofficial because it isn\u0027t made by Blizzard. I\u0027ll assume readers are already familiar with the original game, otherwise I may find I\u0027m repeating myself (from my Diablo re... ",
    "gameID": 0,
    "author": "sequekhan"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-05-29T00:00:00.000Z",
    "score": 9.3,
    "comments": "My first Blizzard addiction...\nI just bough my very first PC and went to see a cousin of mine which had just got some new games to show me. I remember what he said then: \"Check this one out! You can fight demons with swords and stuff\" I got my eyes w... ",
    "gameID": 0,
    "author": "flyercho"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-06-03T00:00:00.000Z",
    "score": 9.0,
    "comments": "This game changed the gaming world forever for the good.\nThis game has been out for a long time now. Back when it was released, the world had not seen a dungeon crawler of that caliber. Nowadays, the graphics and sound capabilities of modern computers has leant themselves to... ",
    "gameID": 0,
    "author": "Deadelm007"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2009-06-15T00:00:00.000Z",
    "score": 7.0,
    "comments": "Repetitive and old for these days prefer gameburger\nDiablo is old and repetitive compared to newer games. Watching a 30 second clip of the game would make it seem really boring. It isn\u0027t even very deep. It\u0027s a very simple game that puts very simple concepts together to ma... ",
    "gameID": 0,
    "author": "Newestech"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 3,
    "date": "2009-06-15T00:00:00.000Z",
    "score": 7.0,
    "comments": "A game now outdated to the same degree that it was once ahead of its time: hugely.\nDiablo is a great game and for historical purposes alone I recently played it from top to bottom. But besides nostalgia, that\u0027s pretty much the only reason left to explore the world of the original Diablo. Look at the... ",
    "gameID": 0,
    "author": "CaseyMJones"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-07-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Diablo is one of those games that have such great things about it ,it can actually be hard to explain how good it is.\nDIABLO REVIEW This game by blizzard is by far one of the great action RPGs i have ever played, not only that one of the best games i have ever played.The graphics are great for its time and looking back you can give a... ",
    "gameID": 0,
    "author": "RetroRPGamer"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-07-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "If you haven\u0027t played it, why not? BUY IT NOW!!!\nIf you\u0027re reading this, the chances are that you haven\u0027t played Diablo. If that is the case let me save you some time. BUY IT NOW! It\u0027s unarguably the greatest game ever, and, in a time when pc games seemed to be running... ",
    "gameID": 0,
    "author": "DrVlad"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-08-08T00:00:00.000Z",
    "score": 9.5,
    "comments": "This game is a great game, but it has it\u0027s flaws, however it still is a must-buy to any Diablo -fan. A classic game!\nFirst off; I\u0027ve always been a Diablo -fan and this was one of the first games I ever lent \u0026 played, I remember fighting Butcher back in the days, but he was so difficult for me to beat. Okay, after a long time; I boug... ",
    "gameID": 0,
    "author": "TevoxZi"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-08-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best RPG game ever, hands down!\nFirst of all this game truly deserves the word \u0027EPIC\u0027. Why? Well because it is incredibly fun! This was the first true RPG I played. I played it all the time on the PSX when it first came out. With all honestly I play... ",
    "gameID": 0,
    "author": "netsoj"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2009-09-28T00:00:00.000Z",
    "score": 9.5,
    "comments": "Even up to 2009, Diablo still keeps a fair share of people nailed and ramming their mousebuttons.\nLet me tell you, I have been playing this probably since it came out, if only the demo. Of course, later on, prices drop, and long time ago I got my hands on the full deal. No regrets. I won\u0027t compare graphics and sou... ",
    "gameID": 0,
    "author": "RJtheShadow"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-10-08T00:00:00.000Z",
    "score": 9.0,
    "comments": "Simple but killing demons has never been so much fun!\nDiablo whilst not huge on storyline is a great lot of fun. Not alot of skill required as all you do is click to move and attack and use any items you have. The graphics arn\u0027t fantastic but for a game released in 1996 you... ",
    "gameID": 0,
    "author": "Danny--T"
  },
  {
    "helpfulCount": 28,
    "helpfulScore": 2,
    "date": "2009-10-27T00:00:00.000Z",
    "score": 6.0,
    "comments": "The fastest way to a carpial tunnel. NOT a real RPG.\nI never understood the hype. I didn\u0027t found that Diablo deserved the best points of all the games out there. It is plain boring after the second level, it is all the same with biggers monsters. Only because you need to l... ",
    "gameID": 0,
    "author": "gabo0123"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2009-11-28T00:00:00.000Z",
    "score": 9.5,
    "comments": "quite simply one of the best RPGs ever\nDiablo is one of the finest experiences to be had on the PC for RPG fans. It combines huge, randomly generated levels and randomly generated just about everything else to bring together a truly unique, highly replayable ... ",
    "gameID": 0,
    "author": "adrian114458"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2010-01-23T00:00:00.000Z",
    "score": 9.5,
    "comments": "Diablo is one of those original and revolutionary games that only comes around once every 5 or 10 years.\nDiablo is one of those original and revolutionary games that only comes around every 5 or 10 years. It has created a new style of gameplay that has been copied by many great games in the years since it has come out. Di... ",
    "gameID": 0,
    "author": "WorthBlood312"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2010-01-30T00:00:00.000Z",
    "score": 9.5,
    "comments": "Ahh, the memories...\nOne can\u0027t deny that Diablo revolutionized the way an RPG was played. Up until its release, Final Fantasy was pretty much the benchmark and accepted method for going about designing an RPG. This was the first game to thro... ",
    "gameID": 0,
    "author": "newkillerstar27"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 1,
    "date": "2010-02-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "Diablo is the best game ever made, Period.\nRarely do you find a game where all the pieces fit. I have played many games over the years. So many have been deleted from my hard drive and my mind but this game stays fresh as the first time I ever played it. I was... ",
    "gameID": 0,
    "author": "paintedson1"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2010-05-17T00:00:00.000Z",
    "score": 9.5,
    "comments": "beyond all expectations\nHello my friend, stay a while and listen... magic words. I take time to write a review on this game, altough is is a bit late, but I belive that it deserves a mention of honor, since it is one of the best games ever c... ",
    "gameID": 0,
    "author": "etchcorp"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 3,
    "date": "2010-07-25T00:00:00.000Z",
    "score": 9.0,
    "comments": "Blizzard shows off its multitudes of game development talent with this virtually flawless gem of an RPG.\nWhile there had been earlier action-packed (if they could be called that) role-playing games like Xanadu and the earlier Golden Axe games, they did not make shock-waves among RPG fans beyond the game system that they wer... ",
    "gameID": 0,
    "author": "Gelugon_baat"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2010-07-28T00:00:00.000Z",
    "score": 9.0,
    "comments": "for once gamespot is right.\nYOU SHOULD OWN A COPY. anybody who doesn\u0027t own a copy or know what diablo is is not a true gamer! this is a classic..a masterpiece..this is DIABLO..i inherited it from my father when i was 8 (long time ago)..i would spen... ",
    "gameID": 0,
    "author": "axelx666"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2010-08-02T00:00:00.000Z",
    "score": 8.0,
    "comments": "Although some of its additions appear not fully integrated, Hellfire still adds much to the main Diablo game.\nThe first Diablo is a very, very great game, but it has small, minor flaws that detract from the experience. Hellfire is an expansion that seeks to repair these flaws, and more. It also appends the main game with additio... ",
    "gameID": 0,
    "author": "Gelugon_baat"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2010-08-11T00:00:00.000Z",
    "score": 9.5,
    "comments": "Ahh.. This game brings just good memories!\nI think it was back in 1996 when i first played the demo version of diablo. In my opinion the best thing in diablo was that mood!! It was something unforgettable. I remember my first time playing it, I lived still in... ",
    "gameID": 0,
    "author": "TheVVipeRR"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2010-08-12T00:00:00.000Z",
    "score": 8.0,
    "comments": "Diablo Was revolution in it\u0027s time, but looks a bit outdated now. and a truly superb game never gets outdated.\nGood things about this game: 1. Gameplay is more addictive than heroin. 2.Creating a new subgenre for RPG\u0027s.[action RPG] 3.Great atmosphere. 4.Classes are completely different. 5.very challenging gameplay. 6,Awesom... ",
    "gameID": 0,
    "author": "herzalot"
  },
  {
    "helpfulCount": 26,
    "helpfulScore": 5,
    "date": "2010-09-15T00:00:00.000Z",
    "score": 7.5,
    "comments": "In 1996,i would\u0027ve given this game a 9.5...BUT,it\u0027s 2010.\nI admire the dedication of any player who still considers Diablo fun,or recommends it.I bought this game in early 97\u0027...along with my blazingly fast compaq 233mhz.That old compaq is worthless now...you know what i\u0027m goin... ",
    "gameID": 0,
    "author": "noblepuker"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2010-09-20T00:00:00.000Z",
    "score": 9.0,
    "comments": "Probably the Best Rpg I\u0027ve ever played besides runescape and or World of Warcraft\nOboy oboy oboy, were to start. Well i\u0027ll just first start off with this is an instant must own classic rpg of the century. It may not be as good as the second or the third one (soon to come out i hope), but it gets the j... ",
    "gameID": 0,
    "author": "handedtoo2"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2010-11-14T00:00:00.000Z",
    "score": 9.5,
    "comments": "THE hack and slash game!\nI still remember when i was younger and played this, i had so much fun so many hours spend trying to level my character to make him the best of the best! So after talking with my friends for a while i decided to return.... ",
    "gameID": 0,
    "author": "KalDurenik"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2010-11-25T00:00:00.000Z",
    "score": 7.5,
    "comments": "A classic PC game comes to the PS1, but doesn\u0027t quite translate the same.\nThis classic PC game comes to the PS1. Overall the transition looks good but there were a few flaws and nitpicks I had with this. First, the game saves take up nearly an entire memory card on it\u0027s own. PS1 memory card... ",
    "gameID": 0,
    "author": "LynnTerra"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-02-01T00:00:00.000Z",
    "score": 9.0,
    "comments": "for the time when this game was made it was a masterpiece, spent more time than I care to guess on it.\nNot much to say here as most have already played this game, but for 1996, this game was epic and one of the only good games of it\u0027s time. Granted it hads it\u0027s faults, but overall it was a very fun and addicting game. ... ",
    "gameID": 0,
    "author": "boomer0901"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-02-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "15 years later it is still a great game.\nI initially received this game as a gift about 8 years ago. I still love it. I own a PS3 and an XBOX 360 and i can say that to this day this is still one of my favorite games. When i look at a game that is a few years ol... ",
    "gameID": 0,
    "author": "dportal2006"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-03-31T00:00:00.000Z",
    "score": 9.5,
    "comments": "A Hell of a Game: \"I\u0027m on a highway to Hell!I\u0027m on a Highway to Hell!\"\ndark...gothic...sinister...scary...frightening...moody...legendary...this are the words that decribe diablo,the king of hack \u0026 slash rpg\u0027s.unbeatable at this chapter.probably the biggest omg of the 90\u0027s after the omg pro... ",
    "gameID": 0,
    "author": "snes_vs_ps1"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-04-13T00:00:00.000Z",
    "score": 9.5,
    "comments": "Still and always will be one of my favorites!\nI am no pro at reviews, actually my first, sorry if it isn\u0027t great. Diablo for the Ps1 is to my standards today a great game, with tons of replay value. Playing as the Warrior right now is a blast, hack n slash has ... ",
    "gameID": 0,
    "author": "240185521134887306932137534460"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2011-08-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "\"AAAHH, FRESH MEAT\" *holds cleaver aloft and starts running at you*\nI\u0027m an old hand at RPGs. If I had to name the game that I liked most out of all - the one that I keep coming back to for the sheer pleasure of playing - then Diablo would take first place, shared only with Diablo II LoD.... ",
    "gameID": 0,
    "author": "sequekhan"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-11-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "After so many years, I still remember this game with fondness\nNo doubt one of games I played the must in my life, incredible replayable, I could never get bored. This game was so revolutionary that up to this day we say \"Diablo style game\". It\u0027s a classic that a player from today w... ",
    "gameID": 0,
    "author": "DeyvsonMC"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-12-18T00:00:00.000Z",
    "score": 9.5,
    "comments": "The best game for the PC.\nThis is the best game for the PC. I\u0027ve played the sequels but still the original is the best. It\u0027s been more than 15 years since it\u0027s release, but this game can still get you hooked for hours and hours. I can still get t... ",
    "gameID": 0,
    "author": "Velocity_man"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 2,
    "date": "2012-02-26T00:00:00.000Z",
    "score": 6.5,
    "comments": "Diablo is one of those rare gems that didn\u0027t impress me.\nDiablo is a fun and extremely addictive game. At first. Towards the end, Diablo becomes quite repetitive and tedious. Grumble grumble snow witches grumble grumble hell spawn grumble grumble. Gameplay 6.5/10 Sim... ",
    "gameID": 0,
    "author": "dahaoleboy69"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-04-05T00:00:00.000Z",
    "score": 9.5,
    "comments": "\"Ahhhhh... fresh meat!\"\nGood: -Practically defined the hack-and-slash genre by successfully implementing a random dungeon system, endless hordes of monsters, and a wide variety of loot. -One of the best video game soundtracks ever. The song f... ",
    "gameID": 0,
    "author": "miracalious"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-04-28T00:00:00.000Z",
    "score": 9.5,
    "comments": "One of the best RPG / Hack and Slash games ever and it does really live up to the expectation...\nStory: The story isn\u0027t anything very complicated. You\u0027re a hero who just got to the town of Tristram and you find out that the town has a strong evil force inside the Cathedral. Has you move on in the game, you find ou... ",
    "gameID": 0,
    "author": "warr10r94"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-05-01T00:00:00.000Z",
    "score": 9.0,
    "comments": "If you call yourself a gamer you should play this game\nLet me start this review by saying that I miss my copy of Diablo and Diablo II. These two games were really ground breaking for the profusely apathetic 90\u0027s. Thinking back, other than The Simpsons, Married with Children ... ",
    "gameID": 0,
    "author": "lukehitchins"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-06-14T00:00:00.000Z",
    "score": 9.5,
    "comments": "Diablo 1...the spark that caused the dungeon crawling inferno.\nDiablo1 is the spark that caused the dungeon crawling inferno. The game is very simple, entertaining and addictive, its hack and slash dungeon crawling that will utterly send your mouse into oblivion from clicking on dem... ",
    "gameID": 0,
    "author": "StankyTubeSocks"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-07-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "What an experience!!!!!!!\nI still remember when I first played, it was a demo. The creepy music got to me instantly, the creepy town too. Was probably one of my first games, and as a kid you get terribly impressed when one of your first experi... ",
    "gameID": 0,
    "author": "ciorlandenis"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 0,
    "date": "2012-08-08T00:00:00.000Z",
    "score": 6.0,
    "comments": "review 72\nhello this review is for the gamer who died after 40 hours of diablo 3 for 40 hours without any breaks or sleeping or naps or eating. 2 days with that.now i cant review diablo 3 because it is new maybe new game junk c... ",
    "gameID": 0,
    "author": "classicgamejunk"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2012-08-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "Diablo \u0026#963;\u0026#964;\u0026#959; Playstation; Hurray!!!\n\u0026#932;\u0026#959; Diablo, \u0026#964;\u0026#959; \u0026#960;\u0026#945;\u0026#963;\u0026#943;\u0026#947;\u0026#957;\u0026#969;\u0026#963;\u0026#964;\u0026#959; game \u0026#964;\u0026#951;\u0026#962; Blizzard \u0026#947;\u0026#953;\u0026#945; \u0026#964;\u0026#945; PC, \u0026#942;\u0026#961;\u0026#952;\u0026#949; \u0026#949;\u0026#960;\u0026#953;\u0026#964;\u0026#941;\u0026... ",
    "gameID": 0,
    "author": "Gialeko"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-09-07T00:00:00.000Z",
    "score": 6.5,
    "comments": "Not the best expansion pack Diablo could get.\nIt doesn\u0027t matter if you have played Diablo or not or what\u0027s your opinion about it. You can\u0027t deny the fact that it\u0027s one of the most influential PC games ever released. By tweaking the formula of roguelike genre and mak... ",
    "gameID": 0,
    "author": "herzalot"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-12-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Diablo is DAMN ADDICTING\nI have To Say that Diablo for Pc is just one of those games that kept you in addiction of roaming around looting bodies, slashing demons, interactiving with people and MORE SLASHING and MAGIC. I\u0027d Tell you It really awe... ",
    "gameID": 0,
    "author": "nightmuffin1"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2017-01-08T00:00:00.000Z",
    "score": 9.0,
    "comments": "Diablo\nhttp://katiejurek.comDiablo is an extremely classic dark fantasy dungeon crawling game. Creating a genre that was like no other before it, it is one of the fathers of modern games, and especially of hack-and-slash dungeo... ",
    "gameID": 0,
    "author": "katiejurek"
  }
]
