[
  {
    "helpfulCount": 9,
    "helpfulScore": 2,
    "date": "2003-10-16T00:00:00.000Z",
    "score": 6.0,
    "comments": "This game just didn\u0027t do much for me. It has almost 0 replay value, in my opinion, because of the small differences between the characters. It\u0027s also much too hard in the beginning. I\u0027ve never played online, which may increase its replay value. Instead I find Diablo II a vast improvement (though, I guess, not as groundbreaking) over the original. I recommend it highly.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 16,
    "helpfulScore": 1,
    "date": "2004-07-11T00:00:00.000Z",
    "score": 4.0,
    "comments": "Boring. Played three levels and then I quit.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2004-11-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best game ever.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2004-11-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "Basically, this game is a whole lot better than anything made recently. The levels are built uniquely each time you play - something that makes the play less linear than most of the new games, too... A classic worthy of its name.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2004-12-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "When I Played Diablo in 2000 It Took me back to my D\u0026D days.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 3,
    "date": "2005-02-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "Oh man, diablo 2 was the worst game ever... Diablo 1 owns it hard. Seriously, diablo 2 was 100 times more boring than 1.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-07-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game took the carrot system to new heights. Many hours wasted/valuably used in front of my PC.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-12-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "D2 was much better then D1 but hey if u like it better not my fault :-P. I think the Expansion is the best i play like 60 hours a week{seruisly}.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 16,
    "helpfulScore": 1,
    "date": "2006-05-09T00:00:00.000Z",
    "score": 0.0,
    "comments": "Boring. Played three levels and then I quit.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 18,
    "helpfulScore": 0,
    "date": "2006-09-12T00:00:00.000Z",
    "score": 0.0,
    "comments": "This game is simply awful and extremelly naive! The graphics and gameplay aer totally feable. It is difficult to me to understand why this game received such high ratings. The score about the Devil and hell and its title translated to spanish seems to be a bad taste joke.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-11-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "I still play this game, ten years after it was made. It was a groundbreaking game when it was first introduced. I still have not found all the items I want.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-03-31T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is a classic; it was groundbreaking in a myriad of different ways. The people who rated it a zero are probably 12 year old little boys.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-04-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "Perhaps the only downside of the game is the lack of quests. For every diablo fan -- go visit Diablo Evolution at http://www.diablo-evolution.com it\u0027s a very interesting site with TONS of info about the content which didn\u0027t made it and they also feature a playable crash-prone version giving you an expeirence of those old unreleased versions. P.S. That\u0027s not an advertisement. ;)",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-05-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "Diablo is a game that oozes with atmosphere even today. You will get a great sense of struggling against very palpable forces of evil, while learning about the history of the region from the locals, each with their own endearing personality, wonderfully voice acted. Diablo is the rare game that features a robust history and story that still leaves just enough for the imagination - and at Diablo is a game that oozes with atmosphere even today. You will get a great sense of struggling against very palpable forces of evil, while learning about the history of the region from the locals, each with their own endearing personality, wonderfully voice acted. Diablo is the rare game that features a robust history and story that still leaves just enough for the imagination - and at the same time does not require such knowledge to enjoy the pure action elements. Diablo is noteworthy for its liberal use of classes, featuring only three that give the player predispositions rather than classes, the only static aspect is the limit of stats (a Warrior having a higher Strength limit than the Mage and inverse for Magic for example), the starting skill, character sprite and voice. More so, if you meet the requirements for an item or spell, you can wield or learn it, regardless of class. A mage can theoretically wield a warhammer and command fire and lightning at will, while a Rogue can more skillfully fire a bow, set up a firewall, and a Warrior would be most lethal with a sword but not hesistant to cast Mana Shield to preserve himself for melee encounters. Diablo unfortunately has aged, and where that is most visible is not in the graphics, but in the interface. Diablo2 far outstrips the original when it comes to managing inventory, selling/buying items, and most crucial, accuracy of character control. Despite these limitations however, the excellent ambiance, the present yet reserved story mixed with the satisfying feedback of slaughtering demons and truly feeling they are demons, lends more than any technology ever could. Diablo is still worth playing to this day, if you can overcome a few inherent flaws.… ",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-07-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "A perfect game, even today. It\u0027s very dark (though not very scary) and the gameplay is awesome. Besides Diablo 2 and maybe Titan Quest, no game has ever done hack-and-slash RPG action better than this. Thosa, who gave the game a 0 said that he only played 3 levels and quit, made Thosa sound incredibly stupid, which I hope he isn\u0027t. If you play Diablo, you have to understand that A perfect game, even today. It\u0027s very dark (though not very scary) and the gameplay is awesome. Besides Diablo 2 and maybe Titan Quest, no game has ever done hack-and-slash RPG action better than this. Thosa, who gave the game a 0 said that he only played 3 levels and quit, made Thosa sound incredibly stupid, which I hope he isn\u0027t. If you play Diablo, you have to understand that this game was made 11 years ago, so I found one reviewers remark that the graphics were feeble so funny. And second, you don\u0027t need good graphics to make a good game, which today\u0027s youth are obsessed about. Speaking of which, the reviews who gave it a zero, must be younger than 12 years old. They must be 8 years old and terrified of games that are rated Mature. I can\u0027t stop playing this game and the sequel. Death to the reviews who have it a zero!… ",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-07-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best games i have ever played in my life. You could even try to compare it to some of today\u0027s kind of games, and see it is just awesome. Very cool story, and the graphics(for his time) were complement to the whole dark ambient and its music. For those who say \"The score about the Devil and hell and its title translated to spanish seems to be a bad taste joke\", muerete hijoOne of the best games i have ever played in my life. You could even try to compare it to some of today\u0027s kind of games, and see it is just awesome. Very cool story, and the graphics(for his time) were complement to the whole dark ambient and its music. For those who say \"The score about the Devil and hell and its title translated to spanish seems to be a bad taste joke\", muerete hijo de la gran maraka.… ",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-08-11T00:00:00.000Z",
    "score": 8.0,
    "comments": "I would have to give this a 7.5 to 8 and going down the more add-ons you keep introducing. Nothing seems to get upgraded, and the weapons configurations seem so random and difficult to figure out. Also the cube recipies...come on get real.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 0,
    "date": "2007-11-28T00:00:00.000Z",
    "score": 0.0,
    "comments": "Diablo is an amazing game. Never before - or after - a game could be just as retarded as a MMORPG while still being single-player! It brings you all the boringness of grinding monsters and doing monster killing quests you find in, say, World of Warcrap, MINUS the fake social interaction! Thanks, Blizzard, for nothing!",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 31,
    "helpfulScore": 2,
    "date": "2008-01-08T00:00:00.000Z",
    "score": 0.0,
    "comments": "Diablo is hack and slash... done... well... better. No longer do you have long winded fights and few enemys to deal with (Or longwinded fights and MANY enemys to deal with) Diablo is made for quick and merciless slaughter... I look at these reviews and I see nolstalgic people, and retards. Neither are acceptable. Diablo isn\u0027t the GOD game, it doesn\u0027t trump all other games 12 Diablo is hack and slash... done... well... better. No longer do you have long winded fights and few enemys to deal with (Or longwinded fights and MANY enemys to deal with) Diablo is made for quick and merciless slaughter... I look at these reviews and I see nolstalgic people, and retards. Neither are acceptable. Diablo isn\u0027t the GOD game, it doesn\u0027t trump all other games 12 years running... but it WAS good in it\u0027s era. Not great, GOOD... And Diablo isn\u0027t the WORST game, Graphics is only 1/10th of a game and Diablo pumped some impressive visuals at it\u0027s time. Now why would I rate something so low that I praise so highly? Because alll you nolstagic brats have gotten on my nerves. Diablo is not the God Game... it may have revolutionized the genre, but rating a game on it\u0027s historical footnotes alone is stupid.… ",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 31,
    "helpfulScore": 2,
    "date": "2008-02-18T00:00:00.000Z",
    "score": 1.0,
    "comments": "A terrible game. The only place that is safe is a very small town with around 10 people. The sorceror is useless because he can\u0027t recharge mana. He must buy potions to recharge it, and they are expensive like hell. The game is extremely hard to play, with a boss in the second level that could kill me in 3 or 4 hits. The ending is very short and makes you feel like you wasted all your A terrible game. The only place that is safe is a very small town with around 10 people. The sorceror is useless because he can\u0027t recharge mana. He must buy potions to recharge it, and they are expensive like hell. The game is extremely hard to play, with a boss in the second level that could kill me in 3 or 4 hits. The ending is very short and makes you feel like you wasted all your time beating this stupid game. The levels are all underground and don\u0027t look much different from each other. They seemed to have made it very dark and gothic, yet it doesn\u0027t even scare you. Its a shame they made it this way, it has a great story, music, and ideas. Its hard to make a gothic game with a great story and let is go to waste, but Diablo rises to the challenge.… ",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-03-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "I\u0027m still playing diablo 11 years later... It\u0027s my favorite game of all time. It has great replay value, mood, and awesome item randomization. I wish more modern games would go back to the root of gaming and devolop a game like this with updated(not necessarily 3d) graphics and bug fixes. Diablo was rife with bugs. I would pay 1000 dollars for a decent game, but they don\u0027t I\u0027m still playing diablo 11 years later... It\u0027s my favorite game of all time. It has great replay value, mood, and awesome item randomization. I wish more modern games would go back to the root of gaming and devolop a game like this with updated(not necessarily 3d) graphics and bug fixes. Diablo was rife with bugs. I would pay 1000 dollars for a decent game, but they don\u0027t make them too often. If Diablo was updated and they fixed the glitches/bugs, and kept the style but at the same time updated the graphics, I would pay 1000 dollars for it. Basically, if this game was remade today with all the new fancy technology, it would rate around 97. Cheers.… ",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-03-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "Unbeatable atmosphere and storyline, combined with the best graphics of its day. Diablo was and is a true classic.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-01-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "A great game for its time, sure people complain about how the levels all look the same but truely the are not, they are randomly generated dungeons which give you some of the best replayability. It was a ten for its day and age, and I have a feeling it\u0027s comming back with Diablo 3, all for what Ghast said, 96-98 if they remade it with new models, textures, and more customizable classes...",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2009-02-26T00:00:00.000Z",
    "score": 8.0,
    "comments": "This game was a great game in its time, but compared to the games now a days, this game is nothing. And to those who keep giving it 0s, if you didn\u0027t play it in its multiplayer prime (yes it had a prime) you shouldn\u0027t really post bad thing about it.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-05-22T00:00:00.000Z",
    "score": 9.0,
    "comments": "Its a real shame some people give this game a 0 or a 1 because of their hatred of a challenge. I can understand the frustration that Diablo can cause for new players, ESPECIALLY new RPG players. This older game does not coddle you in any way, and becasue of that many people may find the game \"unplayable\" For those people i would recomend perhaps Fable or one of the many other RPGs around Its a real shame some people give this game a 0 or a 1 because of their hatred of a challenge. I can understand the frustration that Diablo can cause for new players, ESPECIALLY new RPG players. This older game does not coddle you in any way, and becasue of that many people may find the game \"unplayable\" For those people i would recomend perhaps Fable or one of the many other RPGs around that hold your hand the whole time. Now onto the game. Diablo for its time was unsurpased. I remember getting this game as a child and playing it for days and days, usually in a fit of rage because i had progressed to far down into the lvls before properly clearing them out therefor causing me to be underlvled and geared, BUT that\u0027s whats is so great about diablo. THere is no guard telling you to \"TURN BACK YOU ARE TO WEAK!\", no, instead you are faced with challenges. Graphics for the time were amazing but now of course are outdated, however they are decent enough where it is not distracting. The music is INCREDIBLE! One thing I will give Blizzard credit for is their AMAZING audio. The item system is great, the random item generation makes for a fun challenge to deck yourselft out, even main quest rewards are random, which can be disappointing when you get that nice new armor for your warrior that doesnt do much for him, however the game is easy enough to replay through and compile your gear. The only reason why I didnt give this game a 10 is the bugs. While mostly fixed now, infact last time I played through a year ago i didn\u0027t have any problems except random crashes (Vista didn\u0027t like it, had no problem on XP) The game originally shipped with some nasty bugs also blizzard was the first to discover the wonders of internet hacks and the horrible effects they had on their games. So, to summarize, If you like a challenging game where you are forced to actually use judgment and enjoy hack and slash rpgs, then diablo is for you! If you one of the masses(I\u0027m talking to you, all you people who think Halo and GTA are amazing revolutionary games.) and you hate a game that will challenge you and let you fail then your better off playing Fable or WoW WOTLK.… ",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-07-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "Ugh really all the people that rated this 0 or 1 really ought to actually try to play this game! I mean it is pretty brutal when it comes to fights but it is still an absolutely amazing! You can not find a better Hack \u0027n\u0027 Slash/RPG. I bide my time for Diablo 3.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 0,
    "date": "2009-09-03T00:00:00.000Z",
    "score": 0.0,
    "comments": "A game about painstakingly maneuvering a cookie cutter character at 2 miles per hour through a dungeon, hopelessly attempting to hit guys that teleport away from you the second you reach them, and mashing buttons 1-8 to heal yourself from the 500 fireballs flying in your direction at every moment. Think \"Raiden\" or \"Raptor\" or something of that sort, only you move in slow motion and the A game about painstakingly maneuvering a cookie cutter character at 2 miles per hour through a dungeon, hopelessly attempting to hit guys that teleport away from you the second you reach them, and mashing buttons 1-8 to heal yourself from the 500 fireballs flying in your direction at every moment. Think \"Raiden\" or \"Raptor\" or something of that sort, only you move in slow motion and the enemies move in fast forward. Warrior is basically the only class that can survive the beating that you will no doubt endure because you can\u0027t manually dodge, the rogue is the only class that can successfully hit the enemies due to her ranged abilities, and the sorceror is just there as a comedy option basically. So essentially you have 3 broken derivative classes that have no hope of surviving the game, even if you do everything possible to level up, unless you use 1000 healing items and plenty of saving and loading in the process. Gameplay consists of clicking stuff, and standing around corners waiting to bonk enemies. A true classic.… ",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-10-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is quite a legend, i spent many days playing this title and i never got bored. Diablo hasn\u0027t got the best graphics especially these days, but the atmosphere is outstanding. Personally i don\u0027t understand guys that rated this game with 1 or 0. I suppose that they\u0027re a bunch of retards or kids jerking off in front of WoW or other dumm MMORPG. Hey boys! This game is This game is quite a legend, i spent many days playing this title and i never got bored. Diablo hasn\u0027t got the best graphics especially these days, but the atmosphere is outstanding. Personally i don\u0027t understand guys that rated this game with 1 or 0. I suppose that they\u0027re a bunch of retards or kids jerking off in front of WoW or other dumm MMORPG. Hey boys! This game is not about lvling and and skilling your characters, it\u0027s about a great story and challange. I used to play Diablo several times with the same hero to get top items from other quests (quests are a bit random too). Every single time it was the same fun. Screw the mass shit, hail to the legend - DIABLO!… ",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-10-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is a true classic. It may not have extraordinary gameplay or graphics, but it still brings you in for more. As another commenter stated the atmosphere is brilliant. There\u0027s nothing scarier than the screams that pierce the night as you get further down the cathedral, or the first time you hear The Butcher. @Steven H, you seriously didn\u0027t use the Sorceror right if you This game is a true classic. It may not have extraordinary gameplay or graphics, but it still brings you in for more. As another commenter stated the atmosphere is brilliant. There\u0027s nothing scarier than the screams that pierce the night as you get further down the cathedral, or the first time you hear The Butcher. @Steven H, you seriously didn\u0027t use the Sorceror right if you only saw it as a \"comedy option\". Sorceror is by far the most OP class in the game.… ",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-11-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "Great RPG! One of the best acclaimed role playing game ever invented! But the bad point is its quite easy to defeat Diablo, and its hard just to defeat the Warlord of Blood!",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-11-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "To anyone who would give Diablo a score of 0-2... you obviously have some issues with this genre of game. I don\u0027t know if you failed to take into account the release date or what... but for it\u0027s time and still to this day Diablo 1 is top tier in it\u0027s class. Hence why every game that even comes close to same system is compared to Diablo and Diablo II... why? because they To anyone who would give Diablo a score of 0-2... you obviously have some issues with this genre of game. I don\u0027t know if you failed to take into account the release date or what... but for it\u0027s time and still to this day Diablo 1 is top tier in it\u0027s class. Hence why every game that even comes close to same system is compared to Diablo and Diablo II... why? because they started the genre and are two of the best. Whoever is complaining because the game has a challenge? Go play 90% of the \"new\" RPG\u0027s and allow the game to coddle you and hold your hand the entire way never once really being confronted with a challenge, and afterward be awarded with some cliche\u0027 cinematic. It really makes me sad that you people would give a fantastic game a 0-2 because you are obviously way to under skilled to enjoy a true masterpiece of gaming. and for Griper, you can\u0027t rate a game a 0 because it\u0027s old. Rate it for it is... and when it was released, if people reading reviews aren\u0027t intelligent enough to understand that a game that was released in 1996 is going to be very dated, then god help them.… ",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2010-01-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "It\u0027s a great game, and not only that, it influenced a lot of other games with that same style. When I play Dragon Age, I think of Diablo.",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 21,
    "helpfulScore": 16,
    "date": "2010-04-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "I visited this site out of morbid curiosity. I can\u0027t understand how some people get so adamant over a mere game. But anyway, I love Diablo so much that I frequently have wet dreams over it and I have been known to masturbate while playing. Oh, and once I was so engrossed in the world of Diablo that I forgot to eat for about six days...I lost about ten kilos. No joke, man. And one I visited this site out of morbid curiosity. I can\u0027t understand how some people get so adamant over a mere game. But anyway, I love Diablo so much that I frequently have wet dreams over it and I have been known to masturbate while playing. Oh, and once I was so engrossed in the world of Diablo that I forgot to eat for about six days...I lost about ten kilos. No joke, man. And one time I felt so in love with the game that I couldn\u0027t help but lick the screen for a while. I\u0027m not proud of that. I know it\u0027s weird, but stranger things have been known to happen amongst game freaks.… ",
    "gameID": 0,
    "author": ""
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2011-03-24T00:00:00.000Z",
    "score": 9.0,
    "comments": "Not perfect, but for its time nearly a decade and a half ago this game was great. The mood and feel of this game surpasses its sequel, as does its music. However, I will knock a point off for the cheats that ran rampant and for the painfully slow walking despite giant maps.",
    "gameID": 0,
    "author": "Dracongo"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2011-05-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "The original Diablo not only ushered in an era of clickfest action-RPGs for the PC, it probably also helped revive interest in computer roleplaying games in general, though ironically action-RPGs eventually killed off hardcore RPGs five year later, with Arcanum being the final game of that era (that said, Diablo is not actually that far from the hardcore dungeon crawling RPGs like theThe original Diablo not only ushered in an era of clickfest action-RPGs for the PC, it probably also helped revive interest in computer roleplaying games in general, though ironically action-RPGs eventually killed off hardcore RPGs five year later, with Arcanum being the final game of that era (that said, Diablo is not actually that far from the hardcore dungeon crawling RPGs like the Icewind Dale and Might \u0026 Magic series). Diablo may not be as refined as later action-RPGs, nor as deep as the hardcore RPGs, but the gameplay still enjoyable, rewarding, and addictve, with a unique gothic fantasy setting, well-emphasized by the dark, heavy and genuinely creepy atmosphere permeates through the game, an atmosphere that was sadly and sorely lacking in Diablo II (which I consider to be an inferior game, for this reason). I\u0027d go as far to say that the original Diablo is one of the most atmospheric roleplaying games ever released - and atmosphere is very important for roleplaying games.… ",
    "gameID": 0,
    "author": "davengo"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2011-07-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "Wow i have to weight in here 8.1 come on guys shame of you little youngsters go play with you Wii. First of all this is an Action RPG which has a huge community now, the game was great then Diablo 2 is still great now with a relatively huge community for a decade old game and now we wait for Diablo 3 but that s neither here nor there. I will Admit this game is no fun now but back in theWow i have to weight in here 8.1 come on guys shame of you little youngsters go play with you Wii. First of all this is an Action RPG which has a huge community now, the game was great then Diablo 2 is still great now with a relatively huge community for a decade old game and now we wait for Diablo 3 but that s neither here nor there. I will Admit this game is no fun now but back in the day it was. \"Times change scores don\u0027t\" - Me… ",
    "gameID": 0,
    "author": "snowshreder"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2011-07-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "In reviewing Diablo you have remember that video games have developed A LOT over the years, games didnt just spontaneously become as functional and as complex as they are today and Diablo has contributed a step in the progress and evolution of its genre. Diablo 1 was a great game for its time and still holds up very well, its only our impatient side of being over spoilt modern gamers thatIn reviewing Diablo you have remember that video games have developed A LOT over the years, games didnt just spontaneously become as functional and as complex as they are today and Diablo has contributed a step in the progress and evolution of its genre. Diablo 1 was a great game for its time and still holds up very well, its only our impatient side of being over spoilt modern gamers that makes Diablo outdated, but when you stripe impatience aside Diablo becomes one of the timeless greats of the 90s. The design and service of Battle net is perhaps the most important and influence contribution that Diablo brought, the simple and addictive real time gameplay, the item/ loot system, stat character customisation are fantastic. The atmosphere is great (better than Diablo 2 and 3!), the simplicity and charm of the monster and environment design, the gothic story, the dark tones of despair, the random level generator all were original at its time and have since been copied and recopied in the industry today. Diablo is one of my favourites and a great and important game of its time.… ",
    "gameID": 0,
    "author": "davenbettridge"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2011-07-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "A great game for its time, sure people complain about how the levels all look the same but truely the are not, they are randomly generated dungeons which give you some of the best replayability. It was a ten for its day and age, and I have a feeling it\u0027s comming back with Diablo 3, all for what Ghast said, 96-98 if they remade it with new models, textures, and more customizable classes",
    "gameID": 0,
    "author": "Apollo"
  },
  {
    "helpfulCount": 23,
    "helpfulScore": 6,
    "date": "2011-08-28T00:00:00.000Z",
    "score": 6.0,
    "comments": "Okay, fans will kill me, but Diablo wasn\u0027t that great. I don\u0027t know how to explain this game. It\u0027s somewhat of a point-and-click-adventure without the adventure-typical riddles and storyline. Some sort of a Last Ninja clone in a fantasy-setting for a more casual audience. A low cost rpg without characters and variety (other than different styles of slaying). This is actually not the worstOkay, fans will kill me, but Diablo wasn\u0027t that great. I don\u0027t know how to explain this game. It\u0027s somewhat of a point-and-click-adventure without the adventure-typical riddles and storyline. Some sort of a Last Ninja clone in a fantasy-setting for a more casual audience. A low cost rpg without characters and variety (other than different styles of slaying). This is actually not the worst thing, if a game tries to be simple - however Diablo didn\u0027t want to be that simple. Cinematics, advertisement and pricing claim to be much more. The procedurally generated levels did not offer as much variety as expected.… ",
    "gameID": 0,
    "author": "badkarma"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2011-09-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "The original atmosphere. I loved this game, and though its getting old, it still brings me dark memories. I remember playing this in darkness and encountering Diablo for the first time *chills*. Play it now because you like the story line, and because you need the original scare!",
    "gameID": 0,
    "author": "Tramm"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2011-11-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "i can not believe that people call this a good game no its a great game the first in his class all other \"hack\u0026slash\" out there are base on this tiny game. People that review this game like Thosa vote 2 times a 4 and a 0 need to get a life. People like \"Griper below in the negative commend you find them need to get a **** slap. No stop the crap. If you dont like hack\u0026slash game dont botheri can not believe that people call this a good game no its a great game the first in his class all other \"hack\u0026slash\" out there are base on this tiny game. People that review this game like Thosa vote 2 times a 4 and a 0 need to get a life. People like \"Griper below in the negative commend you find them need to get a **** slap. No stop the crap. If you dont like hack\u0026slash game dont bother to even play it let alone to review it why because its lame and false to give false information about the game. Diablo was back in the days 1997 the hit simpel cd and you are good to go on your 4/86 with 33mhz and 4mb ram (dont forget the turbo mode) yah simple as that new people dont try this because so outdated style you will not like this horribly graphics for this age. Its like playing on your best pc the snes games or commodore game in the early games. For the fans of hack and slash games meet the king and try it,… ",
    "gameID": 0,
    "author": "Xextreem"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2011-11-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "When Diablo was released, it was the best RPG of its time. Even though there are only 3 characters does not take away from the gameplay. The dynamic maps are great, they ensure that every trip through the dungeon will be different. The sounds and music added greatly to the game. Diablo is, and probably will be one of the greatest games of all time.",
    "gameID": 0,
    "author": "TexasGamer"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2011-12-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of my all times favorite, back in the day i would spend hours and hours just trying to find good items, also it was the first game i played Online. The story was good and the gameplay fun and scary, no game up to this date can still beat the terror i feelt while entering the butcher room for the first time...",
    "gameID": 0,
    "author": "EtaYorius"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 3,
    "date": "2011-12-26T00:00:00.000Z",
    "score": 7.0,
    "comments": "Somehow, this game still holds up. Easily one of the most addictive games I\u0027ve ever played (besides Diablo 2), it\u0027s also one of the most mindless (at least if you play as a fighter). Pure point and click, hack and slash simplicity that somehow manages to stay fun throughout. I ended up wishing for a bit more depth near the end of the game, but that\u0027s where Diablo 2 comes in. On it\u0027s own,Somehow, this game still holds up. Easily one of the most addictive games I\u0027ve ever played (besides Diablo 2), it\u0027s also one of the most mindless (at least if you play as a fighter). Pure point and click, hack and slash simplicity that somehow manages to stay fun throughout. I ended up wishing for a bit more depth near the end of the game, but that\u0027s where Diablo 2 comes in. On it\u0027s own, this is still great fun.… ",
    "gameID": 0,
    "author": "Crimsonking58"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2011-12-31T00:00:00.000Z",
    "score": 10.0,
    "comments": "Released in 96 this game was the first of its kind and generally just as good as it gets. Enjoyed it for countless hours, even more with the hellfire addon and mods like varahya/khans. Judged by that it clearly was a 10/10 game even if i probably wouldnt pick it up again today for the same reasons i wouldnt pick up civilization 1 or duke nukem 3D again.",
    "gameID": 0,
    "author": "Kirase"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2012-02-21T00:00:00.000Z",
    "score": 7.0,
    "comments": "While diablo is a weaker \u0027game\u0027 than diablo 2. I think it has a superior atmosphere. However since most of what you do in this game is kill monsters, collect loot, sell loot, return to monsters - the atmospheric bleakness only shows it\u0027s stunning head on occasion. For it\u0027s time, this game blew my mind. Loot was presented so well, everything was so attractive, what the next floor wouldWhile diablo is a weaker \u0027game\u0027 than diablo 2. I think it has a superior atmosphere. However since most of what you do in this game is kill monsters, collect loot, sell loot, return to monsters - the atmospheric bleakness only shows it\u0027s stunning head on occasion. For it\u0027s time, this game blew my mind. Loot was presented so well, everything was so attractive, what the next floor would bring was a mystery of sorts.The online implementation was second-to-none. I sincerely miss the darkness and gothic morbid feeling of diablo 1. That said, diablo 2 did everything significantly better, and still retained enough of the atmosphere to make the entire package grander. And diablo 2 has a hell of a lot more lasting power due to the massive depth improvements over it\u0027s prequel.… ",
    "gameID": 0,
    "author": "whitespider999"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2012-03-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of THEE all time best games of all time! Diablo inspired perhaps countless games and not just games but great games. This game is endlessly fun to play and very very addictive even now. Randomly generated dungeon levels, dynamic ai, a plethora of weapons armor and items and 3 classes to choose from. This is a one of a kind and practically the first of its kind. A priceless gem of all ages!",
    "gameID": 0,
    "author": "eyEZix"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 11,
    "date": "2012-03-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "What can I say over 150 positive 7 mixed and 21 bad Diablo the game that changed everything. Diablo 3 out soon hope it is worth the wait .Chop chop .",
    "gameID": 0,
    "author": "Satanmos"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2012-05-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "sÃ¼perrrr gamee . i love you DÄ°ABLO. !!!!!!!!!!!!!!!!!!.......................................................................................................................",
    "gameID": 0,
    "author": "volkandrst"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2012-05-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "A revolutionary game for its time in all respects. Yes it had its share of bugs. The words town killed still engenders feelings of deep resentment among old time fans. Yes it does not compare to the richness of current gaming. Though its graphics are aged and outdated, the sound, voice acting and atmosphere are a morosely compelling as it ever was. Few will ever forget their firstA revolutionary game for its time in all respects. Yes it had its share of bugs. The words town killed still engenders feelings of deep resentment among old time fans. Yes it does not compare to the richness of current gaming. Though its graphics are aged and outdated, the sound, voice acting and atmosphere are a morosely compelling as it ever was. Few will ever forget their first meeting with the butcher or their battle with the Skeleton King. For many, myself included, it was their first foray into online multiplayer and it was good. It was not the saccharine world of nintendo, the slow turn based strategy games that dominated the PC scene then or the increasingly arcane 2d fighter. It was a dark and accessible world where anyone could enter but few would ever leave. We miss you Blizzard North and we will never forget this game.… ",
    "gameID": 0,
    "author": "wrongpassword"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-05-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "Probably the best one, and the most deserving of the name DIABLO. Intense atmosphere, the music and the refined graphics really create an unique atmosphere that was just partly replicated in Diablo 2, and completely forgotten in the crap afterwards.",
    "gameID": 0,
    "author": "ixvo"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2012-06-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "What more can I say about this game other than truely groundbreaking and amazing for its time. Diablo introduced me to the RPG franchise and have enjoyed my stay ever since.",
    "gameID": 0,
    "author": "lucidanarchy"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 4,
    "date": "2012-07-12T00:00:00.000Z",
    "score": 7.0,
    "comments": "Diablo was a great game for it\u0027s time: very original and entertaining to go deeper and deeper into the depths of caves, killing stuff with interesting skills. Pretty good!",
    "gameID": 0,
    "author": "sspamfilter"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 7,
    "date": "2012-07-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "I should really just sum this review up in two words: \"Diablo Clone.\" Wait, where did that come from? Oh yeah, it came from this game. If you have never heard of a Diablo clone, then you are pretty much a newb. Diablo copied the action sequences of some popular ASCII games, added in some stellar graphics and sound (for their time), and made a story that would make Lucifer himselfI should really just sum this review up in two words: \"Diablo Clone.\" Wait, where did that come from? Oh yeah, it came from this game. If you have never heard of a Diablo clone, then you are pretty much a newb. Diablo copied the action sequences of some popular ASCII games, added in some stellar graphics and sound (for their time), and made a story that would make Lucifer himself cringe. The game was simple, but also had some complexity. The level layouts were completely random. The item drops combined random item properties in a prefix-base-suffix setup in which each randomly generated section had a massive number of possibilities. Skills were not tied to classes, but were instead tied to books that you found on the way! You could be a warrior with fireballs or a wizard in Gothic Plate! Experiment all you wish! There was some great single player, multiplayer via LAN and B.net, and most importantly, wide open PKing to add layers of challenge to the game. This game revolutionized the ARPG genre, or perhaps even created it! For what it was in its day, there were very few games to challenge, let alone top it. For this reason, Diablo 1 gets my highest recommendations!… ",
    "gameID": 0,
    "author": "GREW50ME"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-08-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "When Blizzard made this game, they made a revolution to RPG world. Everything a real RPG gamer wants is in this game. Let\u0027s face it, RPG\u0027s were never about graphics, but how invested in your character, in your game, in your mission can game make you. And this game was, and still is one of the BEST games I\u0027ve ever played. Sadly, Diablo franchise started to deteriorate after this game.When Blizzard made this game, they made a revolution to RPG world. Everything a real RPG gamer wants is in this game. Let\u0027s face it, RPG\u0027s were never about graphics, but how invested in your character, in your game, in your mission can game make you. And this game was, and still is one of the BEST games I\u0027ve ever played. Sadly, Diablo franchise started to deteriorate after this game. Neither of the sequel lived up to this game. Diablo had a real story, and it was like a movie, a novel. Diablo 2 was here and there good, but had some flaws, such as no classic save game in singleplayer, but multiplayer solution to it, and Diablo 3 was a massive failure, Everything that was wrong with Diablo 2, they exaggareted it about 1000 times. Diablo 1 had both simplicity of gaming, and complexitiy of storytelling and questing. That\u0027s why Diablo, especiallly with Hellfire expansion is the game, that i play till this day...… ",
    "gameID": 0,
    "author": "MrWESS"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-12-01T00:00:00.000Z",
    "score": 8.0,
    "comments": "If you like this dungeon runner style, you will like Diablo. Aside from the lack of deep story, the action is fun. Playing a melee character, I found difficult as it seems you spend more time chasing enemies than actually attacking them. Once you switch to mage, it is a walk in the park. I ended up using one spell through the whole game, which shows how repetitive it can get. OneIf you like this dungeon runner style, you will like Diablo. Aside from the lack of deep story, the action is fun. Playing a melee character, I found difficult as it seems you spend more time chasing enemies than actually attacking them. Once you switch to mage, it is a walk in the park. I ended up using one spell through the whole game, which shows how repetitive it can get. One strong element in the game is the limited but fantastic music. There aren\u0027t many tracks, but they are very well done. Very similar to the recent Torchlight I game.… ",
    "gameID": 0,
    "author": "Jangle"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-12-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is a masterpiece. Best graphics for his time period. Story is superb and the sound is fine.The game includes a fantastic gameplay. This game changed the video games world- from RPG to action. This game is one of the best games ever, if not the best, this is absolutely the finest work of Blizzard Entertainment.",
    "gameID": 0,
    "author": "OmriPC"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2013-02-06T00:00:00.000Z",
    "score": 7.0,
    "comments": "I really love the people who judge this game a decade or more after it\u0027s release and hold it up to \"current\" standards and rank it badly. Yes it\u0027s a really old game today (or whenever you\u0027re reading this) but in its day it was legendary. That\u0027s not nostalgia talking, it\u0027s fact. While I do have fond memories of the game myself I do remember exactly what I thought of it at the time. A greatI really love the people who judge this game a decade or more after it\u0027s release and hold it up to \"current\" standards and rank it badly. Yes it\u0027s a really old game today (or whenever you\u0027re reading this) but in its day it was legendary. That\u0027s not nostalgia talking, it\u0027s fact. While I do have fond memories of the game myself I do remember exactly what I thought of it at the time. A great unique game that was extremely fun to play, but also a tad repetitive and without too much depth. Diablo 1 did change the scene and really gave birth to the modern Hack-n-Slash genre. Overall: While I dod have great respect for this game I also must look at it objectively and not just with nostalgia. A great game of it\u0027s age, but also a bit limited and rough around the edges.… ",
    "gameID": 0,
    "author": "Rox22"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "My favorite PC game of all time. Truly the most monumental and inspirational action dungeon crawler ever created. It was the game that paved the way for its genre to grow and one of the major reasons why Blizzard became among the greatest game developers of all time.",
    "gameID": 0,
    "author": "Mittsies"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "When I was a child, I played this game for over a year, over and over again. It is the apitami of good game play, and as such will be forever classified as the classic and original rpg of my life.",
    "gameID": 0,
    "author": "a9249"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2013-05-19T00:00:00.000Z",
    "score": 6.0,
    "comments": "It\u0027s a good game to most. In my opinion I never like the game play. I don\u0027t like point to move nor button mashing. Its very suspenseful with a fantastic story line. The music fits well into the game. Voice acting also was a great feature for the game.",
    "gameID": 0,
    "author": "Nickkix37"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2013-10-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "FlavioV. you\u0027re an useless retarded, together with the others who gave this game a low score. you useless idiot, did you realize that this game was released in 1996, almost 20 years ago and you\u0027re complaining for the graphics? useless retarded whiny human being. Retarded useless idiots.",
    "gameID": 0,
    "author": "MauroR"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-10-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "Diablo started my love for PC Games and i still play it today. if you haven`t played this game before i seriously recommend you do! A good 10 of 10 score in my part!",
    "gameID": 0,
    "author": "Shadowborn89"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-11-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best games I have ever played. Dark, evil, mysterious, adventurous, exciting and so much re-playability. Outstanding. Wish they still made games like this these days.",
    "gameID": 0,
    "author": "TommyTanker"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-02-23T00:00:00.000Z",
    "score": 8.0,
    "comments": "Diablo is one of the icons of games. It showed the world that the game does not have to be difficult to be good. As in those days was a good graphics and the music even better. Randomly generated underground-that\u0027s something!. It is a pity that the disposal were only three character classes (warrior, mage and rogue). The worst thing about this game is that it is a short ...",
    "gameID": 0,
    "author": "Watersson"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2014-04-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "All hail blizzard north the one and only true blizzard.DIABLO(1) is the best game in the world.Respect and best regards to north and Matt Ulman,Brevik and the rest... I can see what you see not— Vision milky, then eyes rot. When you turn, they will be gone, Whispering their hidden song. Then you see what cannot be— Shadows move where light should be. Out of darkness, out of mind,All hail blizzard north the one and only true blizzard.DIABLO(1) is the best game in the world.Respect and best regards to north and Matt Ulman,Brevik and the rest... I can see what you see not— Vision milky, then eyes rot. When you turn, they will be gone, Whispering their hidden song. Then you see what cannot be— Shadows move where light should be. Out of darkness, out of mind, Cast down into the Halls of the Blind.… ",
    "gameID": 0,
    "author": "verglia"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2014-07-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "Greatest game of all time. It\u0027s too bad that time has not been kind to Diablo. Original and great addictive gameplay that became the face of the hack and slash rpg genre.",
    "gameID": 0,
    "author": "JacobCleveland"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2014-07-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the most important games ever made. It is STILL scary if you play now. The butcher doesn\u0027t make me wet my pants like he did the first time anymore, but knowing that if you die, you\u0027re going to have to get all your stuff back is just nerve-racking. Possibly the most atmospheric RPG ever made. Or if that\u0027s going too far, then easily the best music. The only thing that makesOne of the most important games ever made. It is STILL scary if you play now. The butcher doesn\u0027t make me wet my pants like he did the first time anymore, but knowing that if you die, you\u0027re going to have to get all your stuff back is just nerve-racking. Possibly the most atmospheric RPG ever made. Or if that\u0027s going too far, then easily the best music. The only thing that makes it an adjustment to play today is the lack of run/walk. I play this at least once a year and have since it came out.… ",
    "gameID": 0,
    "author": "Zarniwooop"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-08-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "When first Diablo was released in 1996 it blew everyone\u0027s mind with it\u0027s beautiful visuals, fantastic music, dark atmosphere and incredibly fun and addictive gameplay. I loved and still love every bit of it. It still plays and holds up well until this day and it\u0027s by far the best from the trilogy imo. Just listening to the soundtrack and that music is just pure classic. 10/10",
    "gameID": 0,
    "author": "DeusXCom"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2014-08-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is best Diablo in series. This is how it should look like, exploring dungeon and not running on desert, because open area always look the same even if its random. Torchlight1 was also good game because it keep that style and atmosphere, where am just say best clone, not better game. D1 is best in own style.",
    "gameID": 0,
    "author": "koval321"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2014-09-27T00:00:00.000Z",
    "score": 8.0,
    "comments": "I can still re-install and play this game. That should really say something saying that my only real re-playable games are ff7 and xenogears other then that its truly hard for me to pick up and replay games. In its time it was great and frankly i still like to dupe (dupelicate items) and hax the hell out of it. its just good old fashion fun. Hell if a **** server was going id be on itI can still re-install and play this game. That should really say something saying that my only real re-playable games are ff7 and xenogears other then that its truly hard for me to pick up and replay games. In its time it was great and frankly i still like to dupe (dupelicate items) and hax the hell out of it. its just good old fashion fun. Hell if a **** server was going id be on it once in a while.… ",
    "gameID": 0,
    "author": "urieaal"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2014-10-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "I remember when I first played demo of first DIABLO. It was just amazing. Music was just perfect. Its way better than those in all new instalments. Dark, heavy atmosphere - again perfect. Innovative loot system. Even story was quite interresting. in 1996 gameplay was really perfect for me. For couple of years to come this was really one of my favourite titles. When I come back to this gameI remember when I first played demo of first DIABLO. It was just amazing. Music was just perfect. Its way better than those in all new instalments. Dark, heavy atmosphere - again perfect. Innovative loot system. Even story was quite interresting. in 1996 gameplay was really perfect for me. For couple of years to come this was really one of my favourite titles. When I come back to this game now it seems almost like some indie game, its so slow compared to D3. But it still is one of the most important game in gaming history.… ",
    "gameID": 0,
    "author": "Kaprawiec"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2014-11-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is the most atmospheric game ever made. Even Diablo 2 pales in comparison with this masterpiece. There is always a sense of dread and some of the monsters can actually become dangerous and feel like a real fight (something Diablo 3 completely lacks). There are some flaws like black deaths permanently screwing you up and wizard being totally overpowered but there are mods to fix that.",
    "gameID": 0,
    "author": "Floing"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2015-02-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "There may be a little nostalghia to my maximum rating, but I also believe this is a perfect casual game. - a simple, smooth and motivating gameplay - different playing styles through items and magic - enormous replay value - involving sound and story If you need to whack some time, this is it. Is it mobile already?",
    "gameID": 0,
    "author": "mcfry"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2015-06-12T00:00:00.000Z",
    "score": 8.0,
    "comments": "this is very fun arpg. graphics has aged well and gameplay is ok. It has some problems but it\u0027s no\u0027t bad like some kids in reviews say. Diablo 1 is fun nostalgic game.",
    "gameID": 0,
    "author": "retkimuna"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2015-10-20T00:00:00.000Z",
    "score": 9.0,
    "comments": "Best in the series, in my opinion. Had that dark, grim \u0027n grity feel. I lost interest in Diablo series since then. It just went arcade, caroonish. Not my preference.",
    "gameID": 0,
    "author": "Lotian"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2015-12-06T00:00:00.000Z",
    "score": 9.0,
    "comments": "Wow! What a game! Back then it was like \"Dude, you know Diablo?\" \"As if! It\u0027s like the best game EVVVA!\" :) Yeah, those were the times - the times when \"replayability\" actually meant playing the game a gazillion of times, until the CD became razor thin from constant reinstalls, until you could, like, run circles around bosses at character level 1 with your eyes closed, and still enjoyWow! What a game! Back then it was like \"Dude, you know Diablo?\" \"As if! It\u0027s like the best game EVVVA!\" :) Yeah, those were the times - the times when \"replayability\" actually meant playing the game a gazillion of times, until the CD became razor thin from constant reinstalls, until you could, like, run circles around bosses at character level 1 with your eyes closed, and still enjoy the game! THAT\u0027S REPLAYABILITY. And that was Diablo.… ",
    "gameID": 0,
    "author": "GolovA"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2015-12-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "Diablo 1 is still very much fun to play, also in multiplayer mode, 20 years after it was released. From today\u0027s perspective, it\u0027s basically simplified World of Warcraft, because Blizzard honed their concept of character and gear progression from Diablo 1 to Diablo 2 to World of Warcraft. The strongest feature of Diablo 1 is (and was at the time) its randomly generated dungeons.",
    "gameID": 0,
    "author": "iseeall"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2015-12-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "By 1996, everyone was tired of the dying, cliche, turn-based RPG formula. Diablo saved the genre by bringing it into real-time. Another triumph by Blizzard",
    "gameID": 0,
    "author": "jrh23"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2016-02-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "Great Game, loved it as a kid. For the time it had a great level of detail and diversity for the player. It really was groundbreaking at the time and Blizzard has continued to excel with the Diablo franchise",
    "gameID": 0,
    "author": "pvgirl93"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2016-03-27T00:00:00.000Z",
    "score": 9.0,
    "comments": "This game was completely impressive when it came out, the graphics, the music, the dungeon crawling, the combat system, it defined a genre and it was definetely very very exciting. Maybe if you play it nowadays and you\u0027re not an old-school player it feels a bit slow and rusty but it does definetely deserve all the praise it gets.",
    "gameID": 0,
    "author": "ThecriticGoD"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2016-07-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "No doubt one of games I played the must in my life, incredibly replayable, I could never get bored. This game was so revolutionary that up to this day we say \"Diablo style game\". It\u0027s a classic that a player from today world may not enjoy because of it\u0027s outdated graphics and a character growth system that is too simple. Even so, at the time, I couldn\u0027t believe such master piece. It\u0027sNo doubt one of games I played the must in my life, incredibly replayable, I could never get bored. This game was so revolutionary that up to this day we say \"Diablo style game\". It\u0027s a classic that a player from today world may not enjoy because of it\u0027s outdated graphics and a character growth system that is too simple. Even so, at the time, I couldn\u0027t believe such master piece. It\u0027s one of those addictive games, kill tons of sprites to develop the character until we are strong enough to kill the last boss. And them we are ready to do everything again, because dungeons are aleatory, different characters offer different game-plays and hack n\u0027 slash is so fun. Not to mention nice background story, go underground and kill the devil in that gothic environment, I felt medieval. It\u0027s a shame games don\u0027t use this kind of environment, orcs and elves can get really boring.… ",
    "gameID": 0,
    "author": "DeyvsonCaliman"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2016-11-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "A masterpiece, even though not perfect, I give it the perfect score as it was the first in its genre, I used to play this game as a kid and it was the scariest feeling. The colors have low contrast, everything is dark, the asmosphere is scary and adventurous. The music composer Matt Uelmen is a genius and so is the rest of the team. This game influenced hundreds of games in the followingA masterpiece, even though not perfect, I give it the perfect score as it was the first in its genre, I used to play this game as a kid and it was the scariest feeling. The colors have low contrast, everything is dark, the asmosphere is scary and adventurous. The music composer Matt Uelmen is a genius and so is the rest of the team. This game influenced hundreds of games in the following years in the gaming universe.… ",
    "gameID": 0,
    "author": "MasterCeddy"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2016-12-04T00:00:00.000Z",
    "score": 8.0,
    "comments": "Great game by Blizzard again, the game when it came out was difficult to master, but it was an enjoyable experience, and had several different ways that you could play, and there was a lot of replay ability.",
    "gameID": 0,
    "author": "Nel"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2016-12-15T00:00:00.000Z",
    "score": 8.0,
    "comments": "Now very dated, and \u0027in comparison\u0027 to modern titles seems like a laughable attempt at making a game. BUT - I think this game is among three that I will always hold to be \u0027top-level\u0027 games I still remember the nights poured into this game, I still remember the moments of tension and relief at achieving the various milestones of game play, killing certain bosses or surviving certainNow very dated, and \u0027in comparison\u0027 to modern titles seems like a laughable attempt at making a game. BUT - I think this game is among three that I will always hold to be \u0027top-level\u0027 games I still remember the nights poured into this game, I still remember the moments of tension and relief at achieving the various milestones of game play, killing certain bosses or surviving certain levels. And knowing now that this spawned a sequel which in my mind is still unsurpassed in the Action RPG genre - Diablo 2, that fact alone means that this game has to be recognised as part of the pinnacle of PC gaming. Even now I occasionally like to have a little nostalgia and install Diablo 1 just so I can take a big old dose of happy memories. I can\u0027t honestly say that anyone should go out and get this game now, but just want everyone to understand that even before today\u0027s vast game budgets, before the dedicated teams of artists and environment designers, before all of the impressiveness of modern gaming there were games like this that shone out because they provided fantastic experiences and enticing game play. Times have moved on, but my memories are better than a hundred new releases.… ",
    "gameID": 0,
    "author": "rich_pl"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2017-06-10T00:00:00.000Z",
    "score": 8.0,
    "comments": "Gran juego. Un clásico del RPG que definió varias de las mecanicas del género. El sistema de juego es algo elemental, pero engancha. La música y la mitología del juego son fascinantes, aunque la historia no se desarrolla del todo bien.",
    "gameID": 0,
    "author": "angelss_13"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2017-12-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "Excellent game, nothing like the trash diablo 3 we see today from blizzards mishaps. They need to re visit why diablo 1 and 2 were so much better than diablo 3.",
    "gameID": 0,
    "author": "TomCat86"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2017-12-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "The original diablo was a whole new style of gameplay for me and set the scene for all future point and click attack style games. Incredible story line as well.",
    "gameID": 0,
    "author": "nik_balani"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-01-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "Вероятно первая RPG которую я увидел в компьютерном клубе, и вероятно первая пройденная RPG на уже домашнем ПК. Незабываемое путешествие.",
    "gameID": 0,
    "author": "iddqd4"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-09-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "Diablo is a classic, on all perspectives, on all categories. It transcends time. I probably will play it again many times before i die.",
    "gameID": 0,
    "author": "Marcelo_Furtado"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-11-16T00:00:00.000Z",
    "score": 7.0,
    "comments": "Неплохая игра, но все было сделано через жопу, эти скилы по книжкам, посохи с зарядами, ой.",
    "gameID": 0,
    "author": "MillersWeeb"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-11-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "I remember asking my christian mother about things I had encountered in Diablo after playing it at a friends house, and how that made me really contemplate the grey areas of morality for years to come. Where the fallen really deserving their fate? Can a crown really hide a persons madness like that for real? Was it stupidity or nobility at display at the ending scene? The thick atmosphereI remember asking my christian mother about things I had encountered in Diablo after playing it at a friends house, and how that made me really contemplate the grey areas of morality for years to come. Where the fallen really deserving their fate? Can a crown really hide a persons madness like that for real? Was it stupidity or nobility at display at the ending scene? The thick atmosphere made my young imagination venture to places it had deep yearnings to shape and explore, and the poetry, the tales and books slingshot me into halls from which I had previously been blind...Experiencing Diablo was an honing of my soul, it was testing me on so many levels. Maybe the greatest trick the devil ever pulled, was convincing us that he was god.… ",
    "gameID": 0,
    "author": "Vradcly"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-03-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "Oh the music for Tristram Village \"Into Town\" is so perfect and the horror. You\u0027ll never know who\u0027s around the corner. Who can ever forget The Butcher \"Fresh Meat\" and the 16 levels, if I remember correctly and the legendary old man, Cain the Elder, with the wisest words in mankind\u0027s history \"Hello my friend, stay awhile and listen\". Three heroes are available, at that time it was enough,Oh the music for Tristram Village \"Into Town\" is so perfect and the horror. You\u0027ll never know who\u0027s around the corner. Who can ever forget The Butcher \"Fresh Meat\" and the 16 levels, if I remember correctly and the legendary old man, Cain the Elder, with the wisest words in mankind\u0027s history \"Hello my friend, stay awhile and listen\". Three heroes are available, at that time it was enough, so fine by me.… ",
    "gameID": 0,
    "author": "NightElves"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-04-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game started legendary series and after 23 YEARS, i still love this game.",
    "gameID": 0,
    "author": "eMeM"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-08-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "I visited this site out of morbid curiosity. I can\u0027t understand how some people get so adamant over a mere game. But anyway, I love Diablo so much that I frequently have wet dreams over it and I have been known to masturbate while playing. Oh, and once I was so engrossed in the world of Diablo that I forgot to eat for about six days...I lost about ten kilos. No joke, man. And one time II visited this site out of morbid curiosity. I can\u0027t understand how some people get so adamant over a mere game. But anyway, I love Diablo so much that I frequently have wet dreams over it and I have been known to masturbate while playing. Oh, and once I was so engrossed in the world of Diablo that I forgot to eat for about six days...I lost about ten kilos. No joke, man. And one time I felt so in love with the game that I couldn\u0027t help but lick the screen for a while. I\u0027m not proud of that. I know it\u0027s weird, but stranger things have been known to happen amongst game freaks.… ",
    "gameID": 0,
    "author": "jelikey"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-08-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "A lone hero arrives to a dismal village and receives the quest to explore a dreadful dungeon reaching from the accursed damp catacombs of a desecrated church down to the flaming depths of hell. This isn’t about raising numbers, it’s about going down all alone. The strong sense of place and momentum, a remarkably simple yet effective combat system and a prodigious soundtrack which cannotA lone hero arrives to a dismal village and receives the quest to explore a dreadful dungeon reaching from the accursed damp catacombs of a desecrated church down to the flaming depths of hell. This isn’t about raising numbers, it’s about going down all alone. The strong sense of place and momentum, a remarkably simple yet effective combat system and a prodigious soundtrack which cannot be complimented enough push the player into descending through walls of wailing demonic flesh until reaching Diablo himself -this is a horror tale with nightmarish sounds, grim visuals and a bare-bones RPG system fueling an aggressive gameplay more akin to id’s shooters than to anything else. Everything works like a clock, even that which taken by itself seems unfitting -such as the limited inventory and speed of the playable character- forces the player into constantly making relevant choices with both delayed and instant consequences (i.e. life or death), which account for the rather slim character building. As a proper masterpiece, Diablo is the father of a genre characterized by a brutal immediacy, set apart from the hordes of clones it spawned -a classic.… ",
    "gameID": 0,
    "author": "Joewashere"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is the game that started it all. This classic is one of the best games created. This is where the dungeon crawl and looter started. This game is a must have.",
    "gameID": 0,
    "author": "GurmpyCoolCat"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "better than diablo 2 and 3. the closest game is this game of course diablo 2 but wthout expension. diablo2 ex makes the serie like loot game kills the mood mostly. diablo1 was about first dark mood and music gameplay then the loot or items.",
    "gameID": 0,
    "author": "strangermoon"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-28T00:00:00.000Z",
    "score": 9.0,
    "comments": "At that time, Blizzard was able to make games that would become immortal classic for the many years. An interesting plot and game-play, but the second part, as it seemed to me, was much more significant for the history of the gaming industry. Still, it was very good game for its time.",
    "gameID": 0,
    "author": "SilverOrlov"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2020-02-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "Шедевр игровой индустрии, игра, которую повторить так и не смогли. Лучшая РПГ все времен и народов, в те года смотрелась изумительно! Врятли найдется игроман, который не слышал о ней. 10/10 Близарды молодцы!",
    "gameID": 0,
    "author": "Bloodnes"
  }
]
