[
  {
    "source": "http://www.gamesdomain.com/gdreview/zones/reviews/pc/jan97/diablo.html",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "A feast of atmospheric entertainment. While it might tire after a while, you\u0027ll likely get your money\u0027s worth long before that point, and moreso if you venture into the chaos that is Battle.net, where life takes on a whole new meaning and the hours slip mysteriously away. Diablo is a landmark game.",
    "gameID": 0,
    "author": "Yahoo!"
  },
  {
    "source": "http://www.avault.com/reviews/review_temp.asp?game\u003ddiablo\u0026page\u003d1",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "About as close to Hell as you\u0027re going to get - whether you believe in it or not. Everything about this game just rules and it will blow you away. The gameplay is the easiest I\u0027ve ever come across in an RPG which is just fantastic.",
    "gameID": 0,
    "author": "Adrenaline Vault"
  },
  {
    "source": "",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "Diablo is the perfect example of a game that transcends its genre.",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "http://www.game-revolution.com/games/pc/rpg/diablo.htm",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "The hundreds of beautifully rendered monstrosities, items and labyrinths will keep you on your toes for months. Blizzard is also one of the first software companies to offer FREE MULTI-PLAYER GAMING.",
    "gameID": 0,
    "author": "Game Revolution"
  },
  {
    "source": "http://www.justadventure.com/reviews/Diablo/Diablo.shtm",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "By far the shortest RPG I\u0027ve ever played. Surprisingly, this may be one of its strengths. An RPG that only takes about thirty hours (or much less if you are experienced) to play is easy to play again. And Diablo has serious replayability virtues. [Grade \u003d A+]",
    "gameID": 0,
    "author": "Just Adventure"
  },
  {
    "source": "http://www.gamezilla.com/review.aspx?review\u003d7066",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "Hands-down, the best game I\u0027ve seen in years...The fantastic design, intuitive gameplay, spectacular graphics, inspired music and sound effects, sheer number of monsters and unique items, and the free Battle.net service put Diablo at a high level of excellence that future releases may never reach.",
    "gameID": 0,
    "author": "Gamezilla!"
  },
  {
    "source": "http://www.gamespot.com/pc/rpg/diablo/review.html",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.6,
    "comments": "A title that combines the elegant simplicity of an action game and the addictive storyline of an adventure game with the personalization and exploratoration of an old-school RPG... The best game to come out in the past year, and you should own a copy. Period.",
    "gameID": 0,
    "author": "GameSpot"
  },
  {
    "source": "",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.0,
    "comments": "RPG fans have waited for this one for a long time, and they won\u0027t be disappointed. [March 1997, p.102]",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "http://www.pcgameworld.com/review.php/id/110/",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 8.6,
    "comments": "For a highly addictive, replayable game, facing the Lord of Terror is somewhat of an anti-climax. Provided you\u0027ve played as a Rogue and have the Bow of the Bear it\u0027s pretty simple to kill him off. Playing the Warrior though is a little harder.",
    "gameID": 0,
    "author": "PC Gameworld"
  },
  {
    "source": "http://www.elecplay.com/review.html?article\u003d1301\u0026full\u003d1",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 8.5,
    "comments": "While Diablo is easy to get into, it doesn\u0027t hold too much charm after you have put many hours into it. The action is not complex and can become very repetitive.",
    "gameID": 0,
    "author": "Electric Playground"
  },
  {
    "source": "http://www.allgame.com/cg/agg.dll?p\u003dagg\u0026SQL\u003dGRH||||||774",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 8.0,
    "comments": "If you\u0027re looking for an action RPG with medieval roots and influences, dark and moody settings, and unique game play, then run to your nearest retailer and pick up a copy of Diablo!",
    "gameID": 0,
    "author": "All Game Guide"
  },
  {
    "source": "http://www.cdmag.com/adventure_vault/diablo_review/article.html",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 8.0,
    "comments": "Despite the rather pale storyline (at least within the game itself), watered-down quests and a fair amount of necessary repetition, Diablo is a must for anyone interested in \"just plain fun.\" Action gamers and RPG-ers alike will be enthralled.",
    "gameID": 0,
    "author": "Computer Games Magazine"
  }
]
