[
  {
    "helpfulCount": 11,
    "helpfulScore": 2,
    "date": "2013-03-05T00:00:00.000Z",
    "score": 8.0,
    "comments": "Yes it has DRM but...lets be fair.\nWe all know having to be connected to play a game that isn\u0027t an MMO of some sort is unacceptable. I agree. That being said SimCity is actual a pretty fun game aside from smaller city maps then used to. Building a cit... ",
    "gameID": 0,
    "author": "Outsider1580"
  },
  {
    "helpfulCount": 16,
    "helpfulScore": 11,
    "date": "2013-03-05T00:00:00.000Z",
    "score": 1.0,
    "comments": "Required online to play singeplayer and you have to wait in a que to play. DRM always on. Microtransactions planned.\nDiablo 3 all over again, except worse. People waiting in ques for as long as 45 min to play SINGLE PLAYER. Always on DRM strikes again. I do feel this is necessary to a review, because this is terrible business prac... ",
    "gameID": 0,
    "author": "argotto"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 4,
    "date": "2013-03-05T00:00:00.000Z",
    "score": 9.0,
    "comments": "Beautiful and Stunning. Now with Multiplayer Options.\nI won\u0027t brag that i have play every sim game to date, i have not, but what i have been playing and following ever since is the first SimCity game. And now the latest incarnation is out. As expected like it\u0027s previous ... ",
    "gameID": 0,
    "author": "cyhac"
  },
  {
    "helpfulCount": 16,
    "helpfulScore": 11,
    "date": "2013-03-05T00:00:00.000Z",
    "score": 1.0,
    "comments": "WARNING: This game is online only! Don\u0027t be like me and find out after purchase. This is a rental, not a purchase.\nAs if they were unable to learn from the mistakes of those who came before them, EA decided to sully this poor game with a horrible DRM, turning it effectively into Digital Rental Media. You aren\u0027t purchasing the game- y... ",
    "gameID": 0,
    "author": "Tlesta"
  },
  {
    "helpfulCount": 19,
    "helpfulScore": 9,
    "date": "2013-03-05T00:00:00.000Z",
    "score": 8.5,
    "comments": "To original SimCity lovers and followers of the series throughout the years. Unsure if you should buy the new one?...\nIf you have been playing SimCity from it\u0027s conception and/or have been following the series over the years, no doubt losing many hours of sleep enjoying the original\u0027s successors, this review is for you. First off, as... ",
    "gameID": 0,
    "author": "Judicator75"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 4,
    "date": "2013-03-05T00:00:00.000Z",
    "score": 8.5,
    "comments": "It has its flaws but its still great fun.\nI decided to right this review after reading a few of the others, and honestly the others are not even really reviews. They seem to just be little angry kids and have no idea what kind of work it takes to put into a game... ",
    "gameID": 0,
    "author": "Kooken58"
  },
  {
    "helpfulCount": 22,
    "helpfulScore": 17,
    "date": "2013-03-05T00:00:00.000Z",
    "score": 1.0,
    "comments": "Limited city size, limited to online connection only, a free to play mentality that you have to pay 60 buck for.\nEven in single player mode you need to be connected, so playing on your laptop when traveling is a no-no unless you have accesses to decent free WiFi. Even at home now I could not play due to the fact that server reached... ",
    "gameID": 0,
    "author": "pharomarc"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 11,
    "date": "2013-03-05T00:00:00.000Z",
    "score": 1.0,
    "comments": "Always online DRM and corporate money grubbing ruins one of the best franchises to date.\nI\u0027m going to make this quick and snappy. Don\u0027t buy this game. Period. There is ZERO reason to buy this game. There is NOTHING that is good about it if you\u0027ve ever played Sim City before. Seriously, go play previous ... ",
    "gameID": 0,
    "author": "colt_a"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2013-03-05T00:00:00.000Z",
    "score": 1.5,
    "comments": "Great game, lots of fun IF you can get to play it.\nI am -not- a DRM hater. However, I am currently staring at a window that says in another 18 minutes I will be told if I have to wait yet another 20 minutes or not to possibly get into the game. I\u0027ve been waiting two hour... ",
    "gameID": 0,
    "author": "Mausolus"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 2,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 9.5,
    "comments": "Not a Chip on Shoulder Corporately Payed Hate Review to spite EA. I\u0027ve played now for last two days.\nOk. Yes there is DRM - like half the games I\u0027ve been playing now for the last year or two. So what. It\u0027s the wave of the future for pc games - get used to - it isn\u0027t going away nor is the Internet. Yes - the 1st da... ",
    "gameID": 0,
    "author": "jamenta8"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 4,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 4.0,
    "comments": "Always on DRM is one thing, but \"Servers Unavailable\" \u003d Cannot Play Game\nSimCity is horribly broken mainly because everyone must login to the EA/Maxis DRM Server and STAY ONLINE but most people simply CAN\u0027T. From what I have seen the DRM servers have been down or unavailable more than th... ",
    "gameID": 0,
    "author": "mrbobbster"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 3,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 2.0,
    "comments": "Loved first hour then tryed and play next day.........different story\nI played the game on the release day and it was great loved the graphics and the region type game. I spent a good four or five hours on the first day and i was very happy with the game. I was reading stuff online about h... ",
    "gameID": 0,
    "author": "BrendenW5"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 1.5,
    "comments": "EA should leave the gaming world\nHow many more games does EA have to butcher? You guys are horrible at your jobs. Please stop. I\u0027ve been waiting for this game for months. Now 2 days after launch, and I still cannot play due to your terrible decision... ",
    "gameID": 0,
    "author": "CrackDima"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 5.5,
    "comments": "Very addicting, even when I can\u0027t play. A review of the game as is, not as it will be one day from now. .\nSince the March 5h release date, I have been pleasantly surprised and at the same time frustrated by the new Sim City. Seeing as how EA has claimed that the game is an MMO and the terms of use forces us to sign that we ... ",
    "gameID": 0,
    "author": "G4mBi7"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 4.0,
    "comments": "EA Lives Down to Its Reputation\nHow do you mess up an easy win? Put EA in charge. I\u0027m an expert at all the SimCity series games. After playing the new SimCIty for a couple hours, I would say there are some good points but they are vastly over-shado... ",
    "gameID": 0,
    "author": "magnotm"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 7,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 1.0,
    "comments": "DO NOT BUY THIS GAME\nThis game is currently broken and is literally unplayable currently. It has been designed exceptionally poorly, as even to play privately, you must be logged in, and must be logged in TO THE SAME SERVER EACH AND EVERY T... ",
    "gameID": 0,
    "author": "nborst"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 6.0,
    "comments": "Server problems, lacking updates, and a clumsy UI mean this game is vastly over rated for its price.\nIts disappointing that in the 10 years since the last Sim City, EA havent really bothered to provide any serious updates to the game. SimCity feels more like an expansion pack than a new game. The gameplay is almost exac... ",
    "gameID": 0,
    "author": "tagteamdogg"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 1.0,
    "comments": "I have been playing this series since its inception. This used to be one of my favorite games... before EA.....\nFirst off... It\u0027s still broken. I have yet to actually make it into the game. At first I thought it was something I was doing wrong, or new game overloading and decided to stop trying to play on opening night. This ... ",
    "gameID": 0,
    "author": "Mtnmage"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 6.0,
    "comments": "Servers will be the death of this Title!!!!!!\nI have always loved SimCity to the core. After having been part of the betas, I thought the game would be ready for the launch. Two days in and I have yet to complete a region as the servers keep kicking me off or shut... ",
    "gameID": 0,
    "author": "ferrelg"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 2.5,
    "comments": "Great gameplay....Small map!! Take 45 min to use all space, then it become so hard to micro-manage!\nGreat gameplay....Small map!! Take 45 min to use all space, then it become so hard to micro-manage! Also.....very hard to login and a lot of disconnections that lead to a lot of work lost because the autosave in the clou... ",
    "gameID": 0,
    "author": "JoHnnY2999"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 4,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 1.0,
    "comments": "Biggest complaint before roll-out was online only play and then they couldn\u0027t make sure to get it right. WOW! Unplayable\nBiggest complaint before roll-out was online only play and then they couldn\u0027t make sure to get it right. WOW! Unplayable. The tutorial was caught in a loop, and I managed to start a city for about 5 minutes before the... ",
    "gameID": 0,
    "author": "sheffboyrd"
  },
  {
    "helpfulCount": 16,
    "helpfulScore": 9,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 9.0,
    "comments": "The DRM aside, SimCity is the best urban planning simulator out there.\nPros: -Addicting gameplay -Many different strategies available; every game is different -Humorous -Great music and sound -The density controlled by roadway type was a puzzling switch, but works great -Add-ons to... ",
    "gameID": 0,
    "author": "mtrem25"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 8,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 1.0,
    "comments": "EA\u0027s Online DRM has ruined everything.\nEA\u0027s Online DRM has ruined everything. Its ridiculous to require an Always Online DRM. When will EA ever learn. 3 hour wait times just to play a game? Once in, I saved, and had to run to the store. Got back 7 mins l... ",
    "gameID": 0,
    "author": "cptsparrow01"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 2,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 8.5,
    "comments": "If you look past the launch issues, SimCity is a fantastic game that will entertain you for hours.\nEarly on you may be reading about the countless issues with SimCity. How you have to have an internet connection for it to run, how the servers are bad, and how cities are small etc. First off the seervers being bad ... ",
    "gameID": 0,
    "author": "joeytheleo"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 6,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 1.0,
    "comments": "Don\u0027t waste your money\nIf you ask me to buy Simcity 2013 my answer is : No Don\u0027t waste your money. Maxis should improve this game. There are lots of problems. Until they release an update, it is better not to buy this game! There are also ... ",
    "gameID": 0,
    "author": "hsbbulut"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2013-03-06T00:00:00.000Z",
    "score": 5.5,
    "comments": "Small Maps, Small Maps, No Map Editor, Cannot Delete Your Cities, only Regions. Bad Start (Servers Malfunctioning)\nSmall Maps, Small Maps, No Map Editor, Cannot Delete Your Cities, only Regions. Bad Start (Servers Malfunctioning). I can go on about this forever, but it really is that simple. They took 3 steps forward but 4 steps b... ",
    "gameID": 0,
    "author": "jthotty"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 2.0,
    "comments": "Great Game. Worst Management.\nI personally appreciate what Maxis has been done for last two decades. Hence, I didn\u0027t hesitate to purchase this game paying $60. But, from the getgo, I couldn\u0027t even start - \"Can\u0027t connect server\" issue, even if it ... ",
    "gameID": 0,
    "author": "limminho"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 3.5,
    "comments": "SimCity Review 1: The endless wait\nToday Simcity launched in Belgium. And we have the same issues as all the Americans: We can\u0027t play because of the servers and DRM. Since I have the boxed version I could install the game very quickly, and I could fire... ",
    "gameID": 0,
    "author": "jamespareta"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.5,
    "comments": "EA is now officially on my crap list.\nYou release another broken game? I am so pissed right now. EA... you have now jumped the shark again... I will vote with my cash elsewhere. Problem with this stupid game is that it a complete waste of time. (all games ar... ",
    "gameID": 0,
    "author": "BootyWallace"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 1,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "This is an epic update to one of the best games ever. The new GlassBox engine adds an amazing level of realism. Amazing!\nIt has been more than 10 years since SimCity 4 and this update to SimCity is nothing short of epic. The new GlassBox engine adds a new level of realism to the game. The online play is just freakin\u0027 addicting. This adds a... ",
    "gameID": 0,
    "author": "garo420"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.5,
    "comments": "SimSh-itty. So many bugs with a disastrous \"always connected to a server DRM\". STAY AWAY FROM THIS GAME !\nThe game has a lot of problems. Only one of them actually matters. Never support always online DRM for a single player game !!! Games like that always end up having a bad single player part and make you have a headache b... ",
    "gameID": 0,
    "author": "Simplythebest12"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "Towns too small. Can\u0027t reload previous games. Actions are permanent.\nThe subject says it all... And this is IF you can even play the game, which has not been the case for the first 3 days of the rollout. They should at least call this game \"SimCity Online\". I think that would avoid... ",
    "gameID": 0,
    "author": "oakforest"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "Servers Full\nOnce again a company makes the big mistake to force the player to play online and then at the release date have not enough servers up. So we will read a lame excuse on how succesfull the release was and how they didnt e... ",
    "gameID": 0,
    "author": "Ronaldius"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "Don\u0027t spend your money on a game you can\u0027t play.\nEA screwed this up bad. It appears that their servers to collect your money are infinitely more robust than their game play servers. If you buy this game, be prepared to be unable to play it. You cannot play it at al... ",
    "gameID": 0,
    "author": "lee_144"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 2.0,
    "comments": "It\u0027s been three days since the release of Simcity, and for three days I\u0027ve been unable play the game.\nI honestly don\u0027t know where to begin with this review. First and foremost, I usually stay away from reviewing games. I also usually avoid pre-ordering them. In a sudden stroke of stupidity, I\u0027ve decided to review a ga... ",
    "gameID": 0,
    "author": "chrisrooR"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "EA cheating everyone.Dont waste ur money on this DRM based ****.Ask for a Refund while u still can\nEA proving that they just want money.they dont give a **** abt anything what the customer wants.not this game,every game of their is a cheat.But maxis has done a great job with the game.not even crossing the 1 mark for t... ",
    "gameID": 0,
    "author": "sh1990"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 5,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "An AWFUL test of your Patience.\nWell, there not much to say, this is an awful game. The fact that i spent 39.99$ on this pile of dung is unbelievable. Takes forever to start a game, and when you have started, randomly you lose all progress (due to cra... ",
    "gameID": 0,
    "author": "oyvgi77"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "DO NOT BUY THIS GAME.\nTrust EA to take a much loved franchise and ruin it with online DRM and pathetic server support. If you can connect to the servers you will find a buggy mess that appears built solely for multiplayer. The city build area... ",
    "gameID": 0,
    "author": "sconradp"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.5,
    "comments": "There is only one option left, SET THE DISK ALIGHT!\nIn a perfect world, a rebooted SimCity should have had me giddy with excitement. It should have left me with a tooth grin, but instead I\u0027ve had a coaster forced upon me. Always-online DRM has ruined a much-loved franchis... ",
    "gameID": 0,
    "author": "Xavidium"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "This is easily the worst game that I can not play!!\nIt is the worst game that I can not play. I have only been able to actually play this game for about 4 hours due to the numerous server issues. Then to top it off the 4 hours that I got to play the next time I logged i... ",
    "gameID": 0,
    "author": "GrazzRootz"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "Doesn\u0027t run, corporate scam.\nSwindled by EA once again, this time by releasing a title that doesn\u0027t even load because it\u0027s online only and their server\u0027s have been \u0027down\u0027 since launch. This game is worse than Diablo 3, lmao. Swindled by EA once ... ",
    "gameID": 0,
    "author": "TalonPimpin"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 4,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.5,
    "comments": "Very small size limit. Server errors. Gameplay too shallow. Don\u0027t be fooled by this \"award-winning\" game.\nI\u0027m expecting a huge upgrade from the Sim City franchise. And now all I get is a game that can handle only a village? Anyone who\u0027ll be playing this game and rates it higher must have played for only a few hours. The f... ",
    "gameID": 0,
    "author": "ken_archer17"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 3,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "Performance hiccups, but excellent SimCity\nMinus the launch issues with the servers, this game has surprisingly met my expectations for the SimCity franchise. The gameplay has a large amount of variety to it, managing utilities is a bit more complex than simpl... ",
    "gameID": 0,
    "author": "MrRazrWire"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "A Typical EA Disaster!\nThis newly released Electronic Arts game can not be fairly reviewed because it can not even be played properly! I have tried to play SimCity 5 for three long days to no avail! And God knows I tried. How did some of the o... ",
    "gameID": 0,
    "author": "deactivated-59ec9606113b1"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "The game simply does not work.\nThe game simply does not work. The online-only \"functionality\" effectively cripples the game since EA\u0027s servers cannot handle it. Hopefully they will fix this as a lot of customers are not too happy that EA won\u0027t wait to... ",
    "gameID": 0,
    "author": "Scrima"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "Does not work. This is ridiculous.\nIf you buy the game in disc, it won\u0027t work. You come high, trying to make it right, use your disc, installation, everything seems ok. Game doesn\u0027t work. Sheet. Updating graphics drivers... looking in forums for some fast... ",
    "gameID": 0,
    "author": "farasss30"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "game is ok graphically compared to other games out there. game play is easy and maps are small. No servers\ngame is ok graphically compared to other games out there. game play is easy and maps are small. No servers to play on!!!! why buy a game that you can\u0027t even play on. your city gets full within and hour or 2 causing you t... ",
    "gameID": 0,
    "author": "pslance"
  },
  {
    "helpfulCount": 14,
    "helpfulScore": 14,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 5.0,
    "comments": "Gaming companies just need to face the truth... We are not ready for always online single player DRM.\nI might as well not even bother discussing the actual game. Sim City 4 remains (unfortunately) by far the best city builder on the market. Yes, a 10 year old game still rocks. Hopefully the modding community will get the... ",
    "gameID": 0,
    "author": "karamazovnew"
  },
  {
    "helpfulCount": 16,
    "helpfulScore": 15,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "Arrogance in ignoring fan base AND our warnings. Complete Disaster\nWe wanted Large Maps, We GOT Tiny Maps. We wanted stand-alone capability We GOT Always Online Required We wanted MORE We GOT LESS We wanted a reasonable price We GOT OVER charged We wanted to be able to ma... ",
    "gameID": 0,
    "author": "fsleeper"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 5,
    "date": "2013-03-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "Having been a huge fan of the Sim City franchise I was really looking forward to this latest Sim City.\nHaving been a huge fan of the Sim City franchise I was really looking forward to this latest Sim City. Needless to say, that\u0027s the only Positive things I have to say about this game. The always on DRM and the fact you... ",
    "gameID": 0,
    "author": "wizeguy525"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 6,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 1.0,
    "comments": "What... was this?\nI\u0027ve waited a long time (A REALLY LONG TIME) to play another actual Sim City game. This one was quite a bit disappointing. Did not like that on launch day, the game was unavailable for play for a really long time. I d... ",
    "gameID": 0,
    "author": "WolfeBay"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 1.0,
    "comments": "been 5 days and i still havent been able to log in.. thanks EA\nI played 5 min. of the tutorial.. then got disconnected from server.. haven\u0027t been able to log in since.. EA wont refund my money.. never again EA.. never again.. i don\u0027t get why i need to be online to play a single play... ",
    "gameID": 0,
    "author": "MisterManoli"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 10,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 2.0,
    "comments": "Over-simplification, no strategy required, tiny cities (smaller than simcity 1), no replay value - gets boring fast.\nI have not been this disappointed in a game since Outpost was released in the 90s. This is a giant step backwards for the franchise. It is a very pretty game in which every fun or engaging aspect of the previous Si... ",
    "gameID": 0,
    "author": "skindawg"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 7,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 3.0,
    "comments": "Sim what? Certainly not City!\nBeing an old school gamer Simcity is one of those titles that just goes like home and apple pie. But this go around the always on DRM has made this umber popular title a flop. It broke my heart in so many ways to see suc... ",
    "gameID": 0,
    "author": "Lothos_Delion"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 1.0,
    "comments": "Broken, Completely Unplayable\nNever wrote a review before and not even sure if you could consider this a review but I feel it necessary to warn anyone who has not bought this game yet to stay away! After trying to log on since Tuesday now I have mad... ",
    "gameID": 0,
    "author": "Fred2884"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 1.0,
    "comments": "A game I was really excited about, results in extreme disappointment and anger towards EA. Shocking.\nThis has to be my most anticipated game release for several years, and yet another release that EA\u0027s greed has completely ruined. First of all, the game should not be server based anyway, anybody with half a degree of... ",
    "gameID": 0,
    "author": "Ryster092"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 0,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 8.0,
    "comments": "Amazing game, online DRM sucks but if you take that out its amazing.\nWOW 5.0 GAMESPOT WTF IS WRONG WITH YOU?! Sure the always online DRM is bs but the game is awesome. Once you are in and playing it does everything right. Ramps up the complexity giving you endless options. This compla... ",
    "gameID": 0,
    "author": "xSkUlLSmAsHeRx"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 1.0,
    "comments": "EA have the most experience with this type of DRM and yet still cant get it right.\nOnline activation to play/update a game I can live with. Add to that \"stick\" the \"carrot\" of online backup of save game and I am happy. Micropayments for upgrade (paying for the equivalent of cheat codes) is fine, but ... ",
    "gameID": 0,
    "author": "jeff_mh_smith"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 1.5,
    "comments": "79.99USD !\u003d 79.99Euro\n................................................................................................ ................................................................................................ Such a long wait for suc... ",
    "gameID": 0,
    "author": "AGNel"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 1.5,
    "comments": "As Far As Customer Experience, It Doesn\u0027t Get Much Worse Than This.\nI have always loved the previous Sim City games, and despite previous poor customer experiences I have had with EA, I shelled out the almost $60 for this. Now, 3 days later, after dozens of attempts on my different co... ",
    "gameID": 0,
    "author": "moby323moby323"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 1.0,
    "comments": "A definite no buy till patched\nThis review is simply here to be able to give a 1 to a total broken product both it\u0027s single player as well \"multiplayer\" part. Since Gamespot\u0027s review is relatively accurate I just leave it up to you to read that and... ",
    "gameID": 0,
    "author": "Nonameselected"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 3.0,
    "comments": "Most people would be fired for creating such useless crap!\nI had high hopes for this game, and yet I knew better once I installed it. The install went worse that trying to install Windows ME (and it doesn\u0027t run much better either). I figured that the person using the game could ... ",
    "gameID": 0,
    "author": "BenJostad"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 5.0,
    "comments": "Simcity it\u0027s not the greatest but it is fun!\nSimcity which did not get off to a good start because of server issues is still a good game once you get beyond that issue. However, making the game have a always online requirement hurts more than help. If people cannot... ",
    "gameID": 0,
    "author": "lonewolf1044"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 1.0,
    "comments": "Save your money! dont buy this garbage!\nEntirely disappointed by this game, ea, and maxis.. Dont buy this game, it will be a waste of your money. 10years of waiting, and this is what we got. boycott EA!! I have to make this a hundred word review? this gam... ",
    "gameID": 0,
    "author": "Hutchison5"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 1.0,
    "comments": "EA - you knew this game was broken and couldn\u0027t handle server demands before you released this game.\nBroken game that even if fixed, will never live up to its potential. I have already signed the petition to get my money back. http://www.change.org/petitions/electronic-arts-simcity-refund#share for those that are inter... ",
    "gameID": 0,
    "author": "WayneSikes49"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 6,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 1.5,
    "comments": "A brilliantly programmed game, completely ruined by the marketing department.\nThis is clearly a fantastic game, one that has had lots of thought put into every nuance, from the tilt-shift graphics to the crisp clean data overlays. You would think, looking at screenshots that this game was faultles... ",
    "gameID": 0,
    "author": "Xaiano"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 5.0,
    "comments": "You will be assimilated, resistance is futile….\nGood stuff: - Glass box engine has huge potential ---------------------------------------------------------------------- Stuff they could do to make Simcity (2014) GOTA material: - Single player offline (Duh)... ",
    "gameID": 0,
    "author": "usadefcon1"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 1.0,
    "comments": "This game has alot of potential but if EA was the mayor they would be voted out\nOnline only has turned out to be a total joke since it is unplayable most of the time. And when you can get in to the game it has so many bugs. Another issue is the size of your cities forcing you to create many small ... ",
    "gameID": 0,
    "author": "dr_david1"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 3.0,
    "comments": "There\u0027s potential but it isn\u0027t there yet\nSo far, according to Origin I\u0027ve spent 7 hours playing the game. It feels like only 5. Maybe it logs the number of times I\u0027ve tried to access the game as time played I don\u0027t know. The biggest problem so far is the fo... ",
    "gameID": 0,
    "author": "Adaram1050"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 3.5,
    "comments": "Broke, Busted, Blah\nOriginally, I was going to give the new SimCity a score of 9.0. Why? - The graphics are outstanding compared to the original. - The interface needs some work because I had a tendency for the map as I am trying to cli... ",
    "gameID": 0,
    "author": "SathMan"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 5,
    "date": "2013-03-08T00:00:00.000Z",
    "score": 4.5,
    "comments": "EA kills another great series.\nRemember Diablo 3? One of the first major releases that was unnecessary always online. That ended up being the first Blizzard game that failed to satisfy the majority of the brand\u0027s fanbase. So it was easy to expect that... ",
    "gameID": 0,
    "author": "Shane747"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 4,
    "date": "2013-03-09T00:00:00.000Z",
    "score": 1.0,
    "comments": "This is a new add to the disastrous sequence of bad experience games such as Sim City Societies and Spore. Too bad...\nThis is a new add to the disastrous sequence of bad experience games such as Sim City Societies (is it a Sim City game really?) and Spore (bugs, non-exciting middle game). It seems that Maxis has forgotten how to make go... ",
    "gameID": 0,
    "author": "intiniac"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2013-03-09T00:00:00.000Z",
    "score": 1.0,
    "comments": "Useless due to Required Internet ALWAYS\nUseless game that won\u0027t connect and when does always drops as internet has to be ALWAYS online 100% in order to play single player. Most useless waste of time and money which I can\u0027t get back. Servers have yet to come on... ",
    "gameID": 0,
    "author": "AmpedCanada"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2013-03-09T00:00:00.000Z",
    "score": 1.0,
    "comments": "Very dissapointing game :*(\nI\u0027m taking the server issues completely aside, cause IMO just this one thing should result in the closure of this worthless games corporation called EA / Maxis. /they simply cheated their clients, and than couldnt even s... ",
    "gameID": 0,
    "author": "michalekk"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2013-03-09T00:00:00.000Z",
    "score": 2.0,
    "comments": "Unbelievable, on-line DRM must die!\nYou can think that a game like this should be good but all the unfortunate fellows that paid and pre-ordered this game (which isn\u0027t cheap, not forgetting to mention that this was suppose to be a gold mine for EA with all... ",
    "gameID": 0,
    "author": "eFLASH"
  },
  {
    "helpfulCount": 16,
    "helpfulScore": 16,
    "date": "2013-03-09T00:00:00.000Z",
    "score": 4.5,
    "comments": "Six years in the making, makes it hard to believe they got it this wrong. I literally feel as though I lost a friend.\nI\u0027ve adored and played Sim City, 2000, 3000, and 4. Spent countless hours in each of them. One of my earliest PC games was the original Sim City. I loved them to death. Now, 2013 and six years since the release of ... ",
    "gameID": 0,
    "author": "Haliburtonn"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 1,
    "date": "2013-03-09T00:00:00.000Z",
    "score": 8.5,
    "comments": "sucks you couldn\u0027t log in cause mine worked...\ntake a dump on a game that you haven\u0027t even played yet. lol. I happen to be one of the fortunate ones who actually managed to load my city and didn\u0027t have a problem with it not working. my city saved, following day logge... ",
    "gameID": 0,
    "author": "julianque"
  },
  {
    "helpfulCount": 15,
    "helpfulScore": 12,
    "date": "2013-03-09T00:00:00.000Z",
    "score": 1.0,
    "comments": "Triple-A Scam Release\nThis game has been a complete disappointment as both a gamer and Simcity fan. The months leading up to release were nothing but hype and advertising to get you to pre-order. Even the beta was just a demo to get Youtub... ",
    "gameID": 0,
    "author": "GuardianProphet"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 6,
    "date": "2013-03-09T00:00:00.000Z",
    "score": 1.0,
    "comments": "Their servers are broken, making it impossible to play.\nIf this game was playable, offline, as a single player experience it would probably be just fine. As is, the EA servers are broken and if you know EA customer \"support\"...well, suffice it to say, I doubt they will be fi... ",
    "gameID": 0,
    "author": "Ursula23"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 3,
    "date": "2013-03-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "Great game, but those servers are driving me crazy!\nGuess what? If you\u0027d love to experience the nonstop thrills and excitement of SimCity, then please remove $60 from your bank and promptly pay someone to kick you repeatedly in the friggin\u0027 mouth. I find it incredibly ... ",
    "gameID": 0,
    "author": "callmealin"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 10,
    "date": "2013-03-10T00:00:00.000Z",
    "score": 1.0,
    "comments": "Complete garbage even once you get past the connectivity issues.\nThis game sucks. All of this complete **** about \"this game is great if you get around the server connectivity\" is 100% shill hype. 1. The plots are too small. Bottom line. Specialization is required because you can\u0027t... ",
    "gameID": 0,
    "author": "bijalba"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 0,
    "date": "2013-03-10T00:00:00.000Z",
    "score": 9.0,
    "comments": "Great Game, Held back by DRM\nWith all The Hate And bad reviews this game is getting, it\u0027s not looking well for SimCity I personally have not encountered any problems with the game upset the lack of updates within friends citys. I Live in Asia whe... ",
    "gameID": 0,
    "author": "MidNightStrikes"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 4,
    "date": "2013-03-10T00:00:00.000Z",
    "score": 1.0,
    "comments": "Pay money for half a broken horrible game. Then get sucked dry with constant micro transactions.-EA\u0027s business model.\nTypical EA bull. First, hype up game, launch it broken and with half the game missing. Also, let\u0027s throw in the worst kind of drm for good measure. They wonder why the company keeps losing money? Always on internet conne... ",
    "gameID": 0,
    "author": "Mommas_b_o_y"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 12,
    "date": "2013-03-10T00:00:00.000Z",
    "score": 5.0,
    "comments": "Why are we paying for a game we cant even own?\nThat\u0027s exactly what this is, we are paying to play on EA\u0027 S servers. We don\u0027t own the game when we buy it, especially feels less so to those of us who got the game digitally! The best thing they could have done is ma... ",
    "gameID": 0,
    "author": "greek5"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 6,
    "date": "2013-03-10T00:00:00.000Z",
    "score": 2.5,
    "comments": "The bottom line: SimCity is not good.\nThis game could have been something wonderful. The GlassBox engine looked like it would do the game justice. It looked, initially, like a huge step up from SimCity 4. In reality, it is the complete opposite. I knew early... ",
    "gameID": 0,
    "author": "unaminous"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 6,
    "date": "2013-03-10T00:00:00.000Z",
    "score": 6.0,
    "comments": "Forget DRM. Content wise, this is a passable yet disappointing game. A step back for the series in almost every way.\nI will choose to ignore the DRM and server issues that are stopping me from playing this game because even if the servers were running, I\u0027m not sure I would even want to play because the content is that disappointing. ... ",
    "gameID": 0,
    "author": "Stonecutters908"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 9,
    "date": "2013-03-10T00:00:00.000Z",
    "score": 1.0,
    "comments": "Always online + DRM is an instant fail for me\nFailing servers, false promises, small map sizes, etc. The launch of this game is as disappointing as the Mass Effect 3 ending. I loved playing Simcity, spent months playing previous versions, but this atrocity ruined m... ",
    "gameID": 0,
    "author": "expatriot"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 11,
    "date": "2013-03-10T00:00:00.000Z",
    "score": 1.0,
    "comments": "do not support this business\nat-launch server-side issues: can\u0027t connect, server can\u0027t handle load must wait in queue to play (like a wow server queue) can\u0027t play with friends can\u0027t play on cheetah speed, disabled disconnect \u003d partial/total los... ",
    "gameID": 0,
    "author": "wowgrandpa"
  },
  {
    "helpfulCount": 14,
    "helpfulScore": 3,
    "date": "2013-03-11T00:00:00.000Z",
    "score": 8.0,
    "comments": "Haven\u0027t had any server issues. Lots of fun, some things could be improved. The nerd rage over launch is overblown.\nI purchased the game on 3/9/13 and things have been good so far. The game looks great and I haven\u0027t had any stability issues. I don\u0027t care about DRM. Yes, I don\u0027t care about it... I have been playing this game and it ... ",
    "gameID": 0,
    "author": "IrrationalBeast"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 2,
    "date": "2013-03-11T00:00:00.000Z",
    "score": 1.0,
    "comments": "the game is very buggy, its completely a ripoff i want my money back i don\u0027t think this game is made by players for play\nthe game is very buggy, its completely a ripoff i want my money back i don\u0027t think this game is made by players for players. EA you are terrible at making games i don\u0027t know why i cant get a refund. the game is very b... ",
    "gameID": 0,
    "author": "Qoban"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 7,
    "date": "2013-03-11T00:00:00.000Z",
    "score": 1.5,
    "comments": "this is a pathetic, amateurish, failure.\nthis game is absolutely pathetic. It\u0027s probably the most amateurish effort I\u0027ve seen from an AAA game from a major publisher I\u0027ve ever seen. Every thing about this game is terrible; the interface, the loading times... ",
    "gameID": 0,
    "author": "TheLeftHandDoom"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-03-11T00:00:00.000Z",
    "score": 6.5,
    "comments": "A brilliant idea that has nearly been destroyed by ham-fisted marketing, bugs, and a disastrous launch.\nI\u0027m a SimCity fanboy, and I have been since the original release, so it was with no small amount of excitement that I awaited the reboot. When it works, its actually quite a good game. Visually spectacular with an am... ",
    "gameID": 0,
    "author": "kelanismoria"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2013-03-11T00:00:00.000Z",
    "score": 8.5,
    "comments": "Now that I\u0027m able to play...I\u0027m enjoying it!\nLast week I was only able to get on maybe twice, and would see the connection drop every five minutes. But during that time I saw a glimpse of the potential of the game. Now I\u0027m able to connect all the time and have be... ",
    "gameID": 0,
    "author": "ehubba"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2013-03-11T00:00:00.000Z",
    "score": 3.5,
    "comments": "The city building is perfect, but the limited space ruins everything.\nI\u0027ve always been very passionate about Sim City, to such a point I\u0027m now writing this quick review of mine since, well, this great game has an incredible flaw I could not believe in that I had to try 3 cities to see it. ... ",
    "gameID": 0,
    "author": "dadopado"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 7,
    "date": "2013-03-12T00:00:00.000Z",
    "score": 3.0,
    "comments": "Almost all the choices they made with this game are wrong.\nEverything was made with one intent in mind: Online. Didn\u0027t the utter failure of CitiesXL online teach them anything other than \"Don\u0027t charge for the service?\" The plot sizes are too small, forcing you to create mult... ",
    "gameID": 0,
    "author": "Zorched"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2013-03-12T00:00:00.000Z",
    "score": 7.5,
    "comments": "3 Major flaws away from being an instant classic.\nI\u0027m a long time Simcity addict and have cumulated thousands of hours playing all Simcity from my grandfather\u0027s nes console on their tv made of wood to the newer Simcity out 2 weeks ago. First, lets state the obvious ... ",
    "gameID": 0,
    "author": "simc1"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-03-13T00:00:00.000Z",
    "score": 6.5,
    "comments": "Ok, but definitely flawed.\nFor one, I do not think that Gamespot should have given the game a 5.0 out of 10. I think it is a better game than that. Yes, the server mess was an atrocity. However, the game is great idea, but has flaws in it\u0027s exe... ",
    "gameID": 0,
    "author": "johnfrat"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2013-03-13T00:00:00.000Z",
    "score": 1.0,
    "comments": "10 hours trying to start the game, could only create 1 city. Now 2 days later i cannot load my city anymore.\nIf you read the forum EA says its all about server capacity and another memo reveals most computing is done at the client site. It more and more clear that EA is not telling the truth about what really problem is. First ... ",
    "gameID": 0,
    "author": "Prmax"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-03-13T00:00:00.000Z",
    "score": 5.5,
    "comments": "Not Simcity 4\nWow, EA good job on ruining a great game. What compelled them to make this game Internet based? Why is my map so small? Why did I pay $60 or $90 to not be able to play it? EA has been bombarded by these questions, and ... ",
    "gameID": 0,
    "author": "213mug"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2013-03-13T00:00:00.000Z",
    "score": 2.5,
    "comments": "A brilliant game with amazing potential that has so many bugs that it is simply not playable.\nFirst thing that occurred after I bought the game were server issues. The ones which everybody has been reporting for the last. But even now, with most (not all, not nearly all) of the sever issues fixed we find the majo... ",
    "gameID": 0,
    "author": "Hentheden"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2013-03-14T00:00:00.000Z",
    "score": 1.0,
    "comments": "A Broken, unfinished game that had no business going on sale. Its almost impossible to connect and is required to play.\ni have had the game for a week now and i have only been able to play 20 minutes, as every time i try to play after work their servers are down or when they are up there is too many users for their one server here in AUS ... ",
    "gameID": 0,
    "author": "iamhelix"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2013-03-14T00:00:00.000Z",
    "score": 3.0,
    "comments": "I can\u0027t believe I let E.A. pull one over one me again! :-(\nWhat a waste of my time. I\u0027ve waited for this game since it was announced. I watched their videos telling me how great it was going to be, and what the engine could do. Now that it\u0027s out, I see some of those were outrigh... ",
    "gameID": 0,
    "author": "Wildman0420"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2013-03-14T00:00:00.000Z",
    "score": 6.0,
    "comments": "Very fun! In the future.\nBugs, extremely bad syncing and terrible issues haunt the coop possibilities of this game. The game by itself is quite addictive, fun, challenging and it always keeps going. But the many issues in the game itself, makes ... ",
    "gameID": 0,
    "author": "ShinobiMedic"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2013-03-14T00:00:00.000Z",
    "score": 2.0,
    "comments": "Broken rip-off! It pretends to simulate and does a decent job with the illusion... until you take a closer look.\nApart from the obvious server issues Sim City is also a simulation fail. Path-finding doesn\u0027t work; sims will use congested roads when neighboring roads are completely clear. Sims will also try to travel to the same plac... ",
    "gameID": 0,
    "author": "bumle"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 8,
    "date": "2013-03-15T00:00:00.000Z",
    "score": 1.0,
    "comments": "Playable but Pointless\nYes \"most\" of the server issues which prevented people from even being able to play the game are almost fixed. That having been said, once you spend any amount of time playing you quickly come to the realization that mos... ",
    "gameID": 0,
    "author": "Homer1955"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 2,
    "date": "2013-03-15T00:00:00.000Z",
    "score": 8.5,
    "comments": "Awful start, lots of server problems, but once you get to play, it\u0027s prety good.\nDay 1: Could not get on a server. Booo Day 2: I went on around 10:30 in the morning and I was able to complete the tutorial, but but not without server disconnects. At the end the game could not connect to a server a... ",
    "gameID": 0,
    "author": "lakere"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2013-03-15T00:00:00.000Z",
    "score": 1.5,
    "comments": "A fake simulation\nIt looks pretty neat on the surface, but once you realize nothing is really simulated, you\u0027ll come to the sad conclusion that EA has ripped you off once again. 1) RCI is no longer an equation. One could simply buil... ",
    "gameID": 0,
    "author": "ReikouOne"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 0,
    "date": "2013-03-16T00:00:00.000Z",
    "score": 7.5,
    "comments": "A flawed, fun and addictive game, Sim City epitomizes the immersive experience.\nWhen I was around ten years old, we didn\u0027t have a gaming computer. Sim City 2000 came out and it was all the rage. We did, however, have the original Sim City, so we installed it on our computer and I got lost for hour... ",
    "gameID": 0,
    "author": "Bad_Gamers83"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2013-03-16T00:00:00.000Z",
    "score": 7.5,
    "comments": "The game is online always, and requires to be on EA\u0027s servers... that crash alot. Makes the game un-playable.\nI was excited, a new Simcity to make Simcity 4 look like a game from the 1900s... but it didn\u0027t. It made Simcity 4 better than this new game. Where should I start- oh yes... the always online piracy protection. EA has ma... ",
    "gameID": 0,
    "author": "xDarockerx"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 5,
    "date": "2013-03-16T00:00:00.000Z",
    "score": 1.5,
    "comments": "LIES\nNothing but lies. Here is a simulation game that does not sim anything. LIE Here is a single player game forcing you to play online, for DRM reasons. TRUE Here is a game that stated you had to play online for cp... ",
    "gameID": 0,
    "author": "Emful"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 5,
    "date": "2013-03-16T00:00:00.000Z",
    "score": 1.0,
    "comments": "Broken, crazy DRM, claustrophobic maps (tiny). This is not the Sim City you were looking for, move along, move along.\nBroken, crazy DRM, claustrophobic maps (tiny). This is not the Sim City you were looking for, move along, move along. I am blown away by just how ignorant EA has become. Like most companies they are looking to make a ... ",
    "gameID": 0,
    "author": "Phakt"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2013-03-17T00:00:00.000Z",
    "score": 7.5,
    "comments": "The game two weeks later.\nI have had a lot of fun playing this game and I think it is better than the previous game by far. This game was unplayable the first week in launched however now that is not the case now. There are more than enough serve... ",
    "gameID": 0,
    "author": "keeper262"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-17T00:00:00.000Z",
    "score": 6.5,
    "comments": "The gameplay is just as good, if not better, than the past SimCity games. However, the maps are WAY TOO SMALL!\nThe game is fun and has some aspects that make you have to think like a real city planner. For example, the addition of natural resources was a great idea. If you decide to mine or drill, all of a sudden you have to ma... ",
    "gameID": 0,
    "author": "CoreyMisterMan"
  },
  {
    "helpfulCount": 16,
    "helpfulScore": 2,
    "date": "2013-03-17T00:00:00.000Z",
    "score": 6.0,
    "comments": "This game is good. I don\u0027t know why all the bad reviews.\nI don\u0027t have any of the bugs people are talking about. The game runs fine for me. I have some connection issues, but they haven\u0027t affected anything I\u0027ve wanted to do in the game. I\u0027m sure the server stuff will be fixed. ... ",
    "gameID": 0,
    "author": "twizzickle"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2013-03-17T00:00:00.000Z",
    "score": 3.0,
    "comments": "maps are extremely small making it not fun.\nI would give this game a 9.0 if the maps were bigger. The maps are unfortunately extremely tiny. It makes no sense. The lead game designer got distracted, daze, and confused by the popularity of The Sims game and want... ",
    "gameID": 0,
    "author": "xMAGOGxKruelgor"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-03-17T00:00:00.000Z",
    "score": 1.0,
    "comments": "Do not buy. Broken DRM, broken servers and a broken game. Shouldn\u0027t really have expected anything else from EA\nThose fine folks at EA ( Endless Aggravation ) have done it again. With absolutely no regard for their customers wishes and no thought given to even a hint of quality control, they release yet another broken cash cow on... ",
    "gameID": 0,
    "author": "stuka1000"
  },
  {
    "helpfulCount": 18,
    "helpfulScore": 4,
    "date": "2013-03-18T00:00:00.000Z",
    "score": 9.5,
    "comments": "Great game - worth the wait\nThe \"server issues\" are hardly the programmers fault. That\u0027s EA politics. The actual game is awesome, with immense detail and pleasant graphics. This is the SimCity I\u0027ve always wanted to play. Follow any sim, any car, an... ",
    "gameID": 0,
    "author": "vadmtom"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 7,
    "date": "2013-03-18T00:00:00.000Z",
    "score": 1.0,
    "comments": "Even without the always-on....its broken. Add on the always-on and its super-broken.\nIgnoring the launch issues AND the DRM/always-on, this game is bad. - It has save issues that fly in the face of anybody who has ever played any game like this. I have no idea how they thought it would fly. - It has... ",
    "gameID": 0,
    "author": "jaredh"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 4,
    "date": "2013-03-18T00:00:00.000Z",
    "score": 3.0,
    "comments": "Not a simulation, just glitz\nWorst game of the franchise right due to the broken AI/Simulation engine. Just a few of the issues: - pathfinding - education is poorly implemented (you do not need different levels, just one) - You don\u0027t need indust... ",
    "gameID": 0,
    "author": "zahinsa"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 3,
    "date": "2013-03-18T00:00:00.000Z",
    "score": 8.5,
    "comments": "This is a great game and deserves more applause than what it is getting\nThis is an incredible entry in the SimCity franchise. The visuals are amazing. The city feels so much more alive than it has in past games giving an incredible experience as a whole. The simulation isn\u0027t only a represent... ",
    "gameID": 0,
    "author": "jcove2050"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 7,
    "date": "2013-03-18T00:00:00.000Z",
    "score": 2.5,
    "comments": "Worst game release of the year, EA let down the original fans that made Sim City popular in the first place.\nWell where do I start? EA have done it again. This game, bluntly. Is the worst piece of corporate hogwash ever released. EA lied blatantly to their customers during the buildup to the games release, insisting that they ... ",
    "gameID": 0,
    "author": "jamesdvhunt"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 3,
    "date": "2013-03-18T00:00:00.000Z",
    "score": 8.5,
    "comments": "The Best City Builder In Years\nSimcity is a brilliant game that was dragged down by its servers at launch. Now that they are up and running a more placing review is in place. Simcity is a stunning city builder that is the best of recent years. The mai... ",
    "gameID": 0,
    "author": "Bannose"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2013-03-19T00:00:00.000Z",
    "score": 7.0,
    "comments": "Finally able to play without too much fear. It\u0027s not perfect % much could be done. Once you are in you\u0027re in for good.\nI was finally able to play SimCity last night for the first time with out major crashes, the game freezing or not being able to connect at all. Two weeks after launch. The game has many flaws to it in my eyes, and th... ",
    "gameID": 0,
    "author": "Release_182"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 5,
    "date": "2013-03-19T00:00:00.000Z",
    "score": 1.5,
    "comments": "For 60 to 80 dollars in 2013 you expect a quality product.\nInstead, you basically get a facebook game. 1. City size: Is a joke. You can maximize your city in basically 3 hours. This is really one of the biggest issues and flaws this game has. 2. Grid building: Due to the ... ",
    "gameID": 0,
    "author": "Shelledfade1"
  },
  {
    "helpfulCount": 16,
    "helpfulScore": 4,
    "date": "2013-03-20T00:00:00.000Z",
    "score": 8.0,
    "comments": "Easy to Play, Fun and Addicting, Amazing graphics, good controls, easy to play with others.\nThis game is amazing. If you can get on a server that isn\u0027t full it is a blast. I can\u0027t believe how much fun it is to create a city and watch it grow and expand. Even playing with others is easy and had to beat. The issu... ",
    "gameID": 0,
    "author": "bond007rq"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 3,
    "date": "2013-03-20T00:00:00.000Z",
    "score": 3.0,
    "comments": "Its like buying a car without an engine that requiers you to be online when you drive it!\nForgot for a second the fact that you\u0027ll be lucky to actually login and play the game when you purchase it. Lets assume that half the online features are not periodically turned off or don\u0027t work that are supposed to be... ",
    "gameID": 0,
    "author": "xguild"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2013-03-21T00:00:00.000Z",
    "score": 4.0,
    "comments": "EPIC FAIL.Want.refund.now.\nThe person who reviewed this game (bond007rq) and gave it a 8.0 is either new to this franchise or a crackhead. 8.0? Please.And one guy,gave it a 9.0 or something..Probably Charlie Sheen on another bender lol. Anyway,Ho... ",
    "gameID": 0,
    "author": "baclibra24"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 9,
    "date": "2013-03-21T00:00:00.000Z",
    "score": 1.5,
    "comments": "SimCity FAIL - You are Fired.\nWell I\u0027ve had the game now for a while, despite the gawd awful long wait it took to get the download to work, and the utter failure of EA support to help me out. I ended up having to buy a second license and then disput... ",
    "gameID": 0,
    "author": "Advocate"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 9,
    "date": "2013-03-21T00:00:00.000Z",
    "score": 1.0,
    "comments": "Is anyone out there as disillusioned with the new SimCity as I am?\nIs anyone out there as disillusioned with the new SimCity as I am? And no, not just because they impose the \"online only\" requirement that\u0027s hogged the servers since the game\u0027s release. Yes, online-only is a terrible w... ",
    "gameID": 0,
    "author": "Regionformer"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2013-03-23T00:00:00.000Z",
    "score": 2.0,
    "comments": "SimCity, y u no work?\nI thought EA\u0027s Sim titles were going downhill fast ever since their Facebook apps started being released (cash cows), but not this fast... With the apps, it made sense to be online. With SimCity games, you just don\u0027t me... ",
    "gameID": 0,
    "author": "rynn21"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 5,
    "date": "2013-03-26T00:00:00.000Z",
    "score": 8.0,
    "comments": "After a rocky start SimCity is proving to be the game we were promised.\nI picked this game up day one after participating in the beta and was extremely disappointed to find that it wasn\u0027t working properly. Now two weeks later I can say that I am in a position to give a solid opinion on the g... ",
    "gameID": 0,
    "author": "Avenger456"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 3,
    "date": "2013-03-26T00:00:00.000Z",
    "score": 8.5,
    "comments": "Yes this game has had a rough start, and DRM is the worst thing since Hitler but the game is getting better.\nI started playing Simcity way back in the be beginning, I think it was 1989 or something like that. I\u0027ve loved new versions every year they came out. One was always a improvement over the next. SimCity 4 was a amazing ga... ",
    "gameID": 0,
    "author": "RLJSlick"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2013-03-30T00:00:00.000Z",
    "score": 8.0,
    "comments": "Ive been able to play 29 Hours uninterrupted and its very very addicting, but has a lot of bugs. Quick Review.\nIf your reading this you know what SimCity is I hope, because i\u0027m skipping the usual intros and going to get to the guts. This game sucks........ you in fast. If your lucky enough to have a good connection. but W... ",
    "gameID": 0,
    "author": "IndependenceYou"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 3,
    "date": "2013-04-02T00:00:00.000Z",
    "score": 1.0,
    "comments": "I\u0027ve bought all series of SimCity except for this one. Thank God.\nLike my father use to say. It has dog ears, dog legs, and dog tail, what is it? Another broken Sim City game. Well EA, you didn\u0027t fool me this time. I didn\u0027t buy your \"game\". I experienced the horror of SimCity at my fri... ",
    "gameID": 0,
    "author": "Joselox7"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2013-04-02T00:00:00.000Z",
    "score": 1.0,
    "comments": "Simcity is another casualty of game series that should have just been played to its strengths.\nFew games have infuriated me so much yet also made me so apathetic. I was foolish enough to fall into the hype around this game, for months I had given it a passive glance but been convinced in the last month that maybe ... ",
    "gameID": 0,
    "author": "JPLazyNinja"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-04-03T00:00:00.000Z",
    "score": 5.0,
    "comments": "Could have been amazing - execution lets this game down.\nSimCity could have been amazing and a contender for Game of the Year. There are numerous fresh new ideas that make this game a marked improvement on predecessors. However the game is broken and the execution lets it do... ",
    "gameID": 0,
    "author": "mAj0rD"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-04-04T00:00:00.000Z",
    "score": 2.0,
    "comments": "Not considering the servers issues the game itself is fundamentally broken with no control of saving and erasing cities.\nHere is the scenario: In a region, you have 4 cities. They must work together to build a Great Work. One city save file gets corrupted beyond repairs (because of being forced to save online), another city gets obliterat... ",
    "gameID": 0,
    "author": "petit_chocobo"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-04-06T00:00:00.000Z",
    "score": 4.0,
    "comments": "Although I really do enjoy this game the bugs, limited amount of space to build and DRM break the game! We want offline!\nAlthough I really do enjoy this game, the bugs, limited amount of space to build and DRM break the game! We want an offline option for the game. Also, I would like to see a better path finding system. http://www.youtube... ",
    "gameID": 0,
    "author": "strenghs"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 5,
    "date": "2013-04-07T00:00:00.000Z",
    "score": 3.5,
    "comments": "Could\u0027ve been a stunner but it is severely broken\nOne month since it\u0027s release and the game is still severely broken. There have been a few patches to fix odd little things but there are SO many broken elements. The game is beautifully visually with great music and s... ",
    "gameID": 0,
    "author": "eas022"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2013-04-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "Everything is broken.\nPros - Beautiful graphic , connected cities, Having a lot potential of gameplay Cons - No subway and all other transport system! How can it be like this?? -Very limit city and gameplay, very small map -Can\u0027t edi... ",
    "gameID": 0,
    "author": "bscale"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 4,
    "date": "2013-04-12T00:00:00.000Z",
    "score": 2.0,
    "comments": "EA should be Ashamed of this game.\nFirst Impression: (Broken) I bought this game the night of the release, and you couldn\u0027t play due to high server volume and only a couple running servers. Then I waited almost 4 days to actually get a chance to log on. ... ",
    "gameID": 0,
    "author": "Justinsmobile"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 1,
    "date": "2013-04-13T00:00:00.000Z",
    "score": 6.5,
    "comments": "Server Sucks. Needs a offline mode.\nThe game itself is very fun and I find myself stuck to it. But I requires an online connection and the cities are saved on a server. THE SERVERS F#@%ING CRASH and sometimes they don\u0027t save my game when I quit. I do love ... ",
    "gameID": 0,
    "author": "money_nicholas"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 7,
    "date": "2013-04-14T00:00:00.000Z",
    "score": 1.5,
    "comments": "One month on, still broken. This game is a con.\nI won\u0027t even talk about the gameplay because there is no point. This game is broken. I have started 4 cities to date and each of them I have lost due to synchronisation errors with the server. Initially, they just roll b... ",
    "gameID": 0,
    "author": "pw2003"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2013-04-16T00:00:00.000Z",
    "score": 6.0,
    "comments": "Tut tut Maxis....\nIf you\u0027ve been a fan of Simcity from it\u0027s very humble beginnings, you would probably not have hesitated to try the latest addition to the series. It looks cute, sounds fun, and I mean, it\u0027s Simcity! But Unfortunately, it... ",
    "gameID": 0,
    "author": "J2TheB"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2013-04-22T00:00:00.000Z",
    "score": 2.0,
    "comments": "Random disasters destroys your hard work. My experience with this game is becoming more negative by the day.\nNice bases and visuals but that\u0027s it. Not being able to turn disasters off, it seems like it has been created for eight-year olds. After spending hours if not days building a city/region, it can disappear without any va... ",
    "gameID": 0,
    "author": "strange-emily"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2013-04-26T00:00:00.000Z",
    "score": 6.5,
    "comments": "A great game with a lot of issues.\nThe game was a nightmare to access at launch, but they\u0027ve since resolved most of the issues by adding more servers and regular updates. There are still some problems that need addressing including contradictory informati... ",
    "gameID": 0,
    "author": "rocketsatdawn"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-04-28T00:00:00.000Z",
    "score": 3.0,
    "comments": "If it only played as well as it looks...\nProbably one of the biggest letdowns of recent gaming history. - useless online only requirement is intolerable - didn\u0027t deliver on high level simulation promises (Sims behavior, traffic, services, etc) - misses on ... ",
    "gameID": 0,
    "author": "barrosbs"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2013-04-30T00:00:00.000Z",
    "score": 7.0,
    "comments": "Great management but too small cities\nI had been playing Sim City 3000 regularly for 10 years. I am literally hooked every single time I start that game because of my utmost love for economic planning and shiny buildings. This new Sim City thus became one of... ",
    "gameID": 0,
    "author": "ryuzaki57"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2013-05-19T00:00:00.000Z",
    "score": 1.0,
    "comments": "Disappointing - Spirit is broken\nMonths after a difficult launch, nothing has changed nor will change. Ridiculously small map size make the game absolutely boring and unplayable. If you played the previous SimCity version (2000, 3 and 4), do not buy... ",
    "gameID": 0,
    "author": "absolufab"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2013-05-24T00:00:00.000Z",
    "score": 8.0,
    "comments": "Why you hate this game so much.\nWhy everyone is hating the game so much,it is a good game,i only spent 5 hours in it but i really like it,the servers don\u0027t have any problem and the gameplay is incredible,multiplayer is ok too but much more fun when you... ",
    "gameID": 0,
    "author": "Bolt_Allan"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2013-05-27T00:00:00.000Z",
    "score": 5.0,
    "comments": "I tried ... I tried really hard to give it time and hope it\u0027ll improve ... but no!\nI\u0027m done trying to defend this game. You\u0027ve read all the reviews so won\u0027t get into it but here are the two issues I just can\u0027t get over no matter how much I\u0027ve tried to be patient: 1) Constant online activity. I was o... ",
    "gameID": 0,
    "author": "SkullLeader00"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-05-28T00:00:00.000Z",
    "score": 7.5,
    "comments": "Short of a few major glitches, it\u0027s a fun game\nI\u0027m starting to think SimCity is getting a raw deal now. When the game launched, I was in agreement with everyone else. The DRM was onerous, and the launch was a catastrophe because of it. And the city sizes were too ... ",
    "gameID": 0,
    "author": "samomluva"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2013-05-29T00:00:00.000Z",
    "score": 7.0,
    "comments": "Sim City offers an innovative interface and aims to simplify the management involved with city building.\nSim City (Post 4.0 Update Review) Sim City offers an innovative interface and aims to simplify the management involved with city building. After a roller coaster ride of a launch that was filled with commonly related ... ",
    "gameID": 0,
    "author": "d_kell411"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2013-06-11T00:00:00.000Z",
    "score": 1.0,
    "comments": "They just keep screwing you and screwing you.\nWhat\u0027s the most important part of reviewing a game? Well, being able to play it of course! I was so looking forward to reading the reviews from us lowly Mac users on today\u0027s release of the Mac version, only to find out o... ",
    "gameID": 0,
    "author": "TokeyPotter"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-06-11T00:00:00.000Z",
    "score": 2.5,
    "comments": "the worst in simcity franchise\nThis game is broken in almost every aspect and it should not be released in the first place. The requirement to be online every minute of game play made this game to be even worse. Fun stuffs that was available in previo... ",
    "gameID": 0,
    "author": "tik1234"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-07-06T00:00:00.000Z",
    "score": 1.0,
    "comments": "SimCity is something of a disaster.!!\nIt\u0027s just a shame that the game doesn\u0027t really offer any explanation why working with another person is more fun than working alone, and what if I don\u0027t have internet access, also why splitting things up is better than c... ",
    "gameID": 0,
    "author": "samesito"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-07-23T00:00:00.000Z",
    "score": 1.5,
    "comments": "Not the sequel I expected. Played it for 40+ hours but get disappointed by the small cities and online mode requirement.\nNot the sequel I expected. I played it for 40+ hours but get disappointed by the very small cities and opportunities. I don`t see the real benefits using this always online requirement. The social interactions are limite... ",
    "gameID": 0,
    "author": "qontrol2007"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-07-30T00:00:00.000Z",
    "score": 5.5,
    "comments": "It could have been great. It still isn\u0027t.\nLess than five months, and six updates later, SimCity is still not the game it promised to be. Initial launch issues aside, the game itself is fundamentally flawed and will likely never redeem itself, no matter how many ... ",
    "gameID": 0,
    "author": "xerxys_81"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-10-20T00:00:00.000Z",
    "score": 6.0,
    "comments": "A great game, but it is unfortunately dumbed down with tutorials and small maps\nSimcity is a sim where you try to build your own city from the ground up. It mostly consists of three zones. industrial, residiantial and commercial. Here you can build off parts of your city to your liking. You can als... ",
    "gameID": 0,
    "author": "the_last_ride"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-11-15T00:00:00.000Z",
    "score": 1.0,
    "comments": "Tragically Flawed\nThis could have been so good, and it\u0027s obvious that there is a great game hidden under the layers of DRM, online-requirement, in-game ads, and Origin. It\u0027s a real shame.I enjoy simulation games, still fire up Railroad t... ",
    "gameID": 0,
    "author": "DrDobalina"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-11-17T00:00:00.000Z",
    "score": 1.0,
    "comments": "$79.99 straight into the toilet... but I learned a valuable lesson from this release...\nI learned a valuable lesson from this release... (excluding MMOs), I will never ever buy a game that requires the server end to function. I threw down $79.99 on the \"extra special digital edition\". I\u0027m not going to get i... ",
    "gameID": 0,
    "author": "gregrout"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-11-20T00:00:00.000Z",
    "score": 9.0,
    "comments": "Why I love Sim City and others hate it.\nIf you\u0027re on the fence about whether you want to play Sim City or not, then take a seat and have a read. I will share with you my experiences in playing Sim City and why others hate it.So let\u0027s start off with the hate, w... ",
    "gameID": 0,
    "author": "MasterTheHero"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-12-14T00:00:00.000Z",
    "score": 7.0,
    "comments": "SimCity Review\nDawno nie widzieliśmy naprawdę dobrej strategii o zarządzaniu miastem. Maxis dał nam szansę zagrać w to, co tak długo oczekiwaliśmy. Nowe Sim owe Sim City posiada bardzo ładną grafikę, ogrom ciekawych element\u0026oacute;w. D... ",
    "gameID": 0,
    "author": "frast"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-04-09T00:00:00.000Z",
    "score": 1.0,
    "comments": "Just skip it!\nIt\u0027s an EA game so you know the standard procedure: Don\u0027t buy it.Don\u0027t buy it.Don\u0027t buy it.Don\u0027t buy it.Don\u0027t buy it.Don\u0027t buy it.Don\u0027t buy it.Don\u0027t buy it.Don\u0027t buy it.Don\u0027t buy it.Don\u0027t buy it.Don\u0027t buy it.Don\u0027t buy i... ",
    "gameID": 0,
    "author": "jacquelineferre"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-09-04T00:00:00.000Z",
    "score": 6.0,
    "comments": "Better than at the beginning\nSimCity is a great game serie. A game which allows you to manage an entire city from A to Z is something refreshing and smart. I played all of them and I\u0027m a real fan of SimCity 4.So when i heard that a new version would... ",
    "gameID": 0,
    "author": "amyedwards"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-12-20T00:00:00.000Z",
    "score": 3.0,
    "comments": "Beautiful, but fatally flawed\nSimCity is the most aesthetically stunning in the franchise so far. The level of detail is immaculate and a pleasure to watch. The mechanics behind every unit is very impressive. For example - it\u0027s very enjoyable to watc... ",
    "gameID": 0,
    "author": "alexlips"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2015-12-10T00:00:00.000Z",
    "score": 3.0,
    "comments": "If I was allowed to use curse words on this review...\nWow... E.A. you really Screwed the dog on this \"genius\" idea, huh? Well, we are going to take a different turn in reviews this time. I want to write a game review but, I can\u0027t.... why? because the servers are not respond... ",
    "gameID": 0,
    "author": "TheBlaklyon"
  }
]