[
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2010-08-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "Smashing super pixelated blocks couldn\u0027t be any funner.\nSimply put.The game is awesome.Don\u0027t need my review. GO BUY IT. There is nothing to wait for.This game is endless fun, and the best part is you craft the world into what you want it to be, or maybe the bad guys just kil... ",
    "gameID": 0,
    "author": "davidmonzon12"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 7,
    "date": "2010-09-06T00:00:00.000Z",
    "score": 6.0,
    "comments": "Great idea, just needs some direction\nSo, I\u0027ve made a couple of bases, and mined them as deep as I can to find the \"good stuff\". Built staircases down and fashioned several mine shafts off the main stairs. Discovered a few deep caverns, avoided some lava flo... ",
    "gameID": 0,
    "author": "Decker12"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2010-09-11T00:00:00.000Z",
    "score": 9.0,
    "comments": "Endless world makes for addicting gameplay.\n*Note: This review is specific to Minecraft Alpha (Survival mode). In Minecraft, your game begins in a nearly infinite world (almost 8x as large as Earth\u0027s surface, according to the website) around mid-morning. You h... ",
    "gameID": 0,
    "author": "suburbancactus"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2010-09-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "Very interesting and addictive adventure game.\nThis game is awesome. The graphics are perfect for the game because the creators wanted a little game but a complex one. I like the surviving thing and the fact that you can mine for Coal/Iron/Gold/Red-stone/Diamond etc... ",
    "gameID": 0,
    "author": "AikiRoM"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2010-09-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "Fun, addictive, old-school\nMinecraft is hard to describe. A player will start the game with nothing, plopped down into a procedurally generated level. Provided one doesn\u0027t look at a walk through the next few hours will be filled with exploration a... ",
    "gameID": 0,
    "author": "xabbott"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2010-09-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "Worth the money, and only in alpha. Hands down one of the best PC games I\u0027ve ever played. GREAT online community.\nI first heard about the game on Reddit about a year ago and bought it. It was sandbox mode only back then but I still loved it. I have recently returned to the World of Minecraft to find that Notch, the developer, has ... ",
    "gameID": 0,
    "author": "ZachSka87"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2010-09-16T00:00:00.000Z",
    "score": 9.5,
    "comments": "Adult Legos in your own massive, unique, emergent world.\nMinecraft is the best alpha of any game you\u0027ll ever play, ever. Sole developer (as of now) Notch has crafted an addictively simple formula: unique worlds with every new game, a simple and intuitive crafting system, and t... ",
    "gameID": 0,
    "author": "ClogGear"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2010-09-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "Minecraft is a work of art.\nAfter being placed in a random part of a truly randomly-generated world; which is often complete with glorious mountain ranges, deep caverns, and vast oceans; you\u0027re left to figure things out on your own. With your ba... ",
    "gameID": 0,
    "author": "esotericsean"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2010-09-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "Well worth the 10$\nI\u0027ll keep my review short and simple: Minecraft is cheap. It\u0027s full of potential. It does what few games succeed in doing. It makes manipulating the world around you 1. Challenging and 2. Pleasurable. It doesn\u0027t use a... ",
    "gameID": 0,
    "author": "ogto"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2010-09-22T00:00:00.000Z",
    "score": 9.5,
    "comments": "Minecraft, one of the best indie titles I have played in years.\nMinecraft is a game where you are given a world, your imagination, and the ability to let your creativity flourish. Never before have I played a game so enthralling, I have had this one game on my mind for days now and I... ",
    "gameID": 0,
    "author": "Cryaotic"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2010-09-29T00:00:00.000Z",
    "score": 9.5,
    "comments": "You\u0027ll seriously feel like a kid again.\nThere is something magical about Minecaft which draws you into an addictive gaming experience. It\u0027s sandbox game which emphasizes upon survival, resource gathering and most importantly, building. The game is so simple, g... ",
    "gameID": 0,
    "author": "furthing"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 7,
    "date": "2010-10-14T00:00:00.000Z",
    "score": 9.0,
    "comments": "Although the game has pixel graphics and no objectives at all, it is a masterpiece.\nAlthough the game has pixel graphics and no objectives at all, it is a masterpiece if you ask me. I saw the game review on youtube and fell in love instantly. Let\u0027s talk about the game. It is a pixel graphics sandbox... ",
    "gameID": 0,
    "author": "zakupower12"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 6,
    "date": "2010-10-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "Such brilliance! Had no idea blocks could be so fun.\nThis is on of the most genius games I\u0027ve every played. When first playing the free version, I didn\u0027t get what the big deal was. I thought the graphics were ugly as hell (and they are!), but when I bought it and started w... ",
    "gameID": 0,
    "author": "zaboon_"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2010-10-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Finally, a game without limitations. Looks bizzare, but incredible when you play. Best reviewed by simply trying it out.\nI have a feeling Minecraft is going to be a landmark in gaming history. Like most people, I started out by hearing a lot of hype, and slowly watching people around me become addicted. Eventually I had to find out why. ... ",
    "gameID": 0,
    "author": "libelle156"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2010-10-25T00:00:00.000Z",
    "score": 9.5,
    "comments": "With the ability to build anything, and the constant threat of it being destroyed, Minecraft is sure to please!\nIn Minecraft, the player, clad with any skin his mind can imagine and his computer can create, is dropped into a world of limitless creativity and wonderous formations of blocks. Any block your character destroys, he can... ",
    "gameID": 0,
    "author": "craigape"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2010-10-29T00:00:00.000Z",
    "score": 8.5,
    "comments": "MineCraft.....\"you Mine and you Craft!\" Very true \u003dD\nMineCraft; For a short legal (or illegal) download on to your PC (56.7 MegaBytes estimated) this is nothing short but addictive. Like the the name says MINE and CRAFT is really the whole element of the game. Somtim... ",
    "gameID": 0,
    "author": "pixel_freak"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2010-11-02T00:00:00.000Z",
    "score": 8.5,
    "comments": "Endless amounts of possibilities\nThe game is very simple at first. Do what you want. But after a little, when night falls, you start to realize what this is all about. There is no real story to this game, you make your own story and carve your own pa... ",
    "gameID": 0,
    "author": "KronosIII"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 11,
    "date": "2010-11-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "The game is only in Alpha, and it has more substance, style and overall brilliance than most polished games out there.\nWell, its been a while since Ive been active here on Gamespot. Why? Because Ive been playing Minecraft. As said in the Review deck, this game has more content and epicness than any game Ive ever played, and I mean th... ",
    "gameID": 0,
    "author": "DeanG642"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 4,
    "date": "2010-11-10T00:00:00.000Z",
    "score": 9.5,
    "comments": "PLAY AT OUR OWN RISK - dangeosly addicting!!!!!!!!!!!!\nThis game is amazing and adicting and its great in ALPHA i cant imagin it in full blown game Pros -addicting -can do a lot - ( i shall expand on that) build huge under ground mines - make humungues castles -make min... ",
    "gameID": 0,
    "author": "mike12348"
  },
  {
    "helpfulCount": 16,
    "helpfulScore": 7,
    "date": "2010-12-04T00:00:00.000Z",
    "score": 7.0,
    "comments": "Minecraft is ugly, simple to the point of being stupid, and horribly entertaining \u0026 addictive.\nLately I\u0027ve been hearing a lot about this little indie game that\u0027s making a big splash. Not really any reviews or anything concrete on the \u0027major\u0027 gaming sites but just a mention of it here and there – just enough to ge... ",
    "gameID": 0,
    "author": "RedAphex"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 3,
    "date": "2011-01-10T00:00:00.000Z",
    "score": 9.5,
    "comments": "This beats World of Warcraft\u0027s addiction meter by...OVER 9000!!\nDon\u0027t play this game if you have any sort of social life to worry about. The lego-style gameplay where you can literally build anything and anywhere will suck your life away. You want to build a floating palace in the... ",
    "gameID": 0,
    "author": "goku33339"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-01-21T00:00:00.000Z",
    "score": 8.0,
    "comments": "It\u0027s like crack, but with mining for precious ore, zombies, and exploding creepers.\nI became intrigued by Minecraft after reading a Penny Arcade comic detailing it\u0027s addictive properties. They were not wrong. *note* this admittedly short review is for survival mode only! Crafting is the heart of Min... ",
    "gameID": 0,
    "author": "sieg6529"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2011-01-24T00:00:00.000Z",
    "score": 9.5,
    "comments": "I pray this message gets through...\nI have been playing Minecraft for what can only seem like days now – time is of no significance. There is nothing left important to me but Minecraft. I have lost all sense of who I am. I don\u0027t even remember where I l... ",
    "gameID": 0,
    "author": "heidious_heid"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 4,
    "date": "2011-01-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "At first, Minecraft seems a little over-complicated, but the feeling of confusion is soon replaced with an addiction.\nWhen you first enter Minecraft, you\u0027ll be a little underwhelmed. Sure, the graphics are nice, very reminiscent of 8-bit, but without actually BEING 8-bit. If you\u0027re a graphics freak, you can download extra texture packs ... ",
    "gameID": 0,
    "author": "yx2vy"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-01-31T00:00:00.000Z",
    "score": 9.5,
    "comments": "I\u0027m addicted, dammit!\nI would never have even considered this game as an option to waste countless hours of my life away, that is until i kept reading articles about it in various gaming websites. I was curious so i took the plunge. To ... ",
    "gameID": 0,
    "author": "stevo367"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 7,
    "date": "2011-01-31T00:00:00.000Z",
    "score": 10.0,
    "comments": "I cry for help..\nI have been playing Minecraft for what can only seem like days now – time is of no significance. There is nothing left important to me but Minecraft. I have lost all sense of who I am. I don\u0027t even remember where I li... ",
    "gameID": 0,
    "author": "ThePedoBear"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2011-02-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "Minecraft is absolutely incredible.\nWhen first playing Minecraft, it takes a little while to understand the game. Because you will probably think \"What am I suppose to do?\" But trust me, once you understand the whole concept, get ready to get glued to you... ",
    "gameID": 0,
    "author": "skeleme"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-02-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "Its a massive hit for a reason, play it and hate your self for not tiring it sooner.\nI resisted playing minecraft for a while due to seeing it every where and just writhing it off as a lame indie game that people were making a big fuss over. But then I broke down and decided to try it to see what the big... ",
    "gameID": 0,
    "author": "LazyGamerX"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2011-02-14T00:00:00.000Z",
    "score": 9.5,
    "comments": "Pure Sandbox Play makes Minecraft a true classic.\n9.3 Very Open-Ended Play: With a variety of modes to play in, and a real sandbox-sty*le approach, Minecraft is about what you want to create Great Exploration: Sure, environments are limited, but there\u0027s few ga... ",
    "gameID": 0,
    "author": "TechnologoDoom"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-02-15T00:00:00.000Z",
    "score": 9.5,
    "comments": "Most Addictive game ever! Can\u0027t stop playing\nWhen you first see this game, your gonna think it\u0027s just nothing good, you mine....how boring is that... oh what\u0027s that! You can grab bits of dirt and pick it up wow so lame, that was most people I knows first Impression... ",
    "gameID": 0,
    "author": "joggyiscool"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-02-15T00:00:00.000Z",
    "score": 9.5,
    "comments": "Most Addictive game ever! Can\u0027t stop playing it!\nWhen you first see this game, your gonna think it\u0027s just nothing good, you mine....how boring is that... oh what\u0027s that! You can grab bits of dirt and pick it up wow so lame, that was most people I knows first Impression... ",
    "gameID": 0,
    "author": "joggyiscool"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-02-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game may look , lets say \"bad graphics\" and not fun , but I can tell you , It is...\nMinecraft is one of those games that , in 50 years time , will be talked about still , if a Minecraft 2 doesn\u0027t come out of course. It is a true Masterpiece and an Amazing game. It is the most creative and if you choose ... ",
    "gameID": 0,
    "author": "monk234"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-02-19T00:00:00.000Z",
    "score": 8.5,
    "comments": "Epic game of epic boxes. This game has all the boxy goodness you can want. If you want to build something.. here you go.\nVery confusing, but still has a very good feel to the way the game works. I would recommend it. But, It can be hard when trying to make a 3D object and wanted to make something inside of it, the camera messes up. Althoug... ",
    "gameID": 0,
    "author": "DiamondBake"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-02-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best game ever!\nBest game ever!Best game ever!Best game ever!Best game ever!Best game ever!Best game ever!Best game ever!Best game ever!Best game ever!Best game ever!Best game ever!Best game ever!Best game ever!Best game ever!Best game ... ",
    "gameID": 0,
    "author": "ZbRobi"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-02-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "A great game to play if you enjoy building with a bit of risk on the side.\nMinecraft. The name and its screenshots may not give the best impression. But I have to say this, if graphics are all you look for in a game, then you are missing out on many good games, old and new. Honestly, the \u0027gr... ",
    "gameID": 0,
    "author": "argotto"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-02-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "Very fun game, especially with friends. Just a nice change from your standard FPS and action RPG games.\nI don\u0027t think I have had this much fun with a game for 6 years. You look at it, and at first glance you ask yourself why you would even consider trying something so strange. Well I am telling you right now that you s... ",
    "gameID": 0,
    "author": "Freemont1982"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-02-22T00:00:00.000Z",
    "score": 9.5,
    "comments": "This game is like a drug wich you can\u0027t get away from. Watch some videos.Graphics may be blocks, but it still looks fine\nThis game, as I said, is like a drug. It will grow on you unlike any other game. The gameplay is simple, and the things you can do ingame is almost unlimited. In the game, all you do is harvest resources, and build with ... ",
    "gameID": 0,
    "author": "TisGameTime"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2011-02-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "WTF The Best Game Ever?\nWow this game looks all 8 bit and sucky i think I\u0027ll pass. HOLD IT RIGHT THERE SKEPTIC. Everyone i knew was like \"oooooh Minecraft is soooooooo awesome\" and so i research it and it looks like someone brought Legend of Ze... ",
    "gameID": 0,
    "author": "sonichunter99"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2011-02-28T00:00:00.000Z",
    "score": 9.0,
    "comments": "When you were a kid, have you ever wished for a game where you can build anything and do whatever? This is that game.\nBackground: I got a gift code from my best friend, and ever since I installed it, I\u0027ve been HOOKED on the game. Introduction: Minecraft. This word will be stuck in your head for a long time. This game is the gam... ",
    "gameID": 0,
    "author": "AznEvan"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 3,
    "date": "2011-03-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "Minecraft Review.....\nMinecraft Is Becoming Increasingly Popular Amongst Many People Across The Internet As Being A Free-Build World Game Similar To Garry\u0027s Mod, But With A Lot More Features And Challenges. You Start The Game In A Randomly Ge... ",
    "gameID": 0,
    "author": "GreatWhiteN0rth"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-03-03T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft is a game made of pixelated blocks, that manages to make an infinate world where you will live, die, and mine.\nMinecraft is exactly what the title says, a game where you mine and then craft. This may seem simple but there are atleast a hundred diferent things to make. Examples: -wooden door/iron door -about 40 weapons and too... ",
    "gameID": 0,
    "author": "parkurtommo"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-03-04T00:00:00.000Z",
    "score": 9.5,
    "comments": "Addiction and lots of fun guaranteed\nI\u0027ve been playing Minecraft for 5 months now and I\u0027m still addicted to it. Usually I stick to a game for a while, but Minecraft still attracts me. Probably because it has a very high creativity value: you can build what ... ",
    "gameID": 0,
    "author": "micknator"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2011-03-07T00:00:00.000Z",
    "score": 9.5,
    "comments": "Minecraft is an innovative and addicting experience that should be enjoyed by all.\nMinecraft is a rapidly growing video game sensation, before the full game is even released there are over 1.5 million copies of the beta sold. There is a reason for this, Minecraft is an indie game and a very good one at... ",
    "gameID": 0,
    "author": "Broken_K"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2011-03-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "Who says sandbox games can\u0027t be fun? This is a true masterpiece and is not to be underestimated.\nBehold the glorious work of Notch. Minecraft is probably the best sandbox game on the web, and for very good reasons, too. Minecraft certainly is a unique game, even if it is inspired by something called Infiminer. M... ",
    "gameID": 0,
    "author": "Bumblebee0228"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2011-03-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "Possibly the most addicting game I\u0027ve ever played, and I used to play World of Warcraft. Great job MojangAB!\nThe first time I saw this game played, I was confused. There were pixelated cows and pigs and chickens that pushed you off of cliffs. I was told that you must make a shelter of some sort at night, so in my tiny dirt hut ... ",
    "gameID": 0,
    "author": "merylwyn"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-03-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "Brilliant game. Fun and addictive.\nI have never played anything that is similar to Minecraft at all. I first found out about it on Youtube. My first impression of it was a game with bad graphics and pretty boring gameplay. As time went on, Minecraft g... ",
    "gameID": 0,
    "author": "Cegaiga"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2011-03-22T00:00:00.000Z",
    "score": 9.0,
    "comments": "Immersive. You would not believe that a game comprised entirely of blocks could do this. But Minecraft does just that.\nImmersive. You would not believe that a game comprised entirely of blocks could do this. But Minecraft does just that. It takes you in and doesn\u0027t let go. In fact it isn\u0027t even done its still in Beta. There is a free ... ",
    "gameID": 0,
    "author": "xallas"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-03-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "Minecraft may not be a graphical splendor, but it\u0027s endless worlds and everexpanding database make it a must-have.\nWhen I first Learned about Minecraft, I was hooked. My only reservation was that the graphics weren\u0027t as great as I wished them to be. But I quickly (almost instantly) got over it, due to the fact that the Minecraft worl... ",
    "gameID": 0,
    "author": "ndhcemployee"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-04-03T00:00:00.000Z",
    "score": 9.0,
    "comments": "MineCraft Review By GrandTheftKing1\nThis game is a wonderful game for the land of adventure and crafting. It is nice to play when there is some down time. The graphics arn\u0027t the best but this game is so addicting I love it. I have litterally played it for ... ",
    "gameID": 0,
    "author": "GrandTheftKing1"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-04-14T00:00:00.000Z",
    "score": 9.5,
    "comments": "Simple but ammazing\nMinecraft is no super graphic survival game nor will it blow your mind with its story (mainly because this is none) but it will make you think about staying alive as long as you can! As you start your new game you shou... ",
    "gameID": 0,
    "author": "Csonic6"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-04-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "Minecraft is a very amazing game, you will know why soon...\nMinecraft is a really fun game, You get to live in a world 8x bigger than the earth. You need to survive by building tools (sword, pickaxe etc.) and building a shelter so you can survive at night from monsters. there is ... ",
    "gameID": 0,
    "author": "Gameguy12450"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2011-04-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best sandbox game, perhaps the best indie game on the market today. Easy to run, incredibly addictive.\nIf Minecraft shows us anything, it\u0027s that while the fancy, modern, incredible graphics you\u0027ll see in games like Crysis 2 are helpful to a game, what makes a game good is how it plays and how innovative and unique the bas... ",
    "gameID": 0,
    "author": "gmboy902"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2011-04-27T00:00:00.000Z",
    "score": 9.0,
    "comments": "What the hell...why is this simple game so addicting?\nI\u0027m almost reluctant to assign a 9.0 to this game. It\u0027s so...simple. There\u0027s no story, there isn\u0027t even a decent combat system. B-but... But it doesn\u0027t matter. Sometimes, my review scores are elevated due to a pure-gu... ",
    "gameID": 0,
    "author": "antipunt1"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2011-05-20T00:00:00.000Z",
    "score": 9.0,
    "comments": "For anyone that enjoys building and exploring this games for you. That\u0027s it though just building and exploring.\nI\u0027m sure every gamer has heard of Minecraft at least. It\u0027s cheap and it\u0027s lo-fi yet their are hundreds of thousands of players. What makes this game so popular? Starting the game is the most difficult part. The map is... ",
    "gameID": 0,
    "author": "Magiquiz"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2011-05-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Minecraft... More like Epicraft!\nThis was surely the best sandbox I have ever played. You can build huge statues, houses, dig big mines, and kill some zombies in the process. Multiplayer is awesome too- I love going to mine with my friends. Updates come... ",
    "gameID": 0,
    "author": "rapsis2x2"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2011-05-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "the beauty of creation...\nminecraft is a wonderful little world. it\u0027s the first truly extensive editable virtual world where people can build (mostly) what is in their mind. the world is composed of little blocks. most games present player... ",
    "gameID": 0,
    "author": "just_nonplussed"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-06-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "If any game deserves a perfect score its this one.\nJust all i will say is that it is a game that will waste your time (in a good way) and you will never stop playing. Even though its in beta, there is nothing that i would change. Wondering what it is? Its an Indie style... ",
    "gameID": 0,
    "author": "jurassicpark787"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-06-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "An amazing game with lots of potential!\nThis game came out a while back, and is still in beta mode, but this should not put you off from buying it. For one it is gonna be cheaper, and two, it is simply great as it is, and with regular updates, it is set to bec... ",
    "gameID": 0,
    "author": "toyota786"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-06-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "Oh no, I\u0027m addicted!\nHave you ever wanted to do anything you want in a video game? Have you ever wanted to build a giant castle or anything you want? If you said yes to either of these questions, Minecraft is the perfect game for you! Let\u0027s ... ",
    "gameID": 0,
    "author": "sora123455"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2011-06-17T00:00:00.000Z",
    "score": 8.0,
    "comments": "MINECRAFT\nIn Minecraft you dig and destroy scenery to get items that you place around the world to defend your self from enemies that come at night. You start out with nothing except a pick-axe which you use to dig up sand, rock, ... ",
    "gameID": 0,
    "author": "RANDOMDUDE22"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 9,
    "date": "2011-06-19T00:00:00.000Z",
    "score": 8.0,
    "comments": "Intrepid exploration and soothing atmosphere make Minecraft something truly special.\nWhat is Minecraft really? How about a better question -- what isnt Minecraft? It\u0027s a sandbox game populated by animals, resources and all sorts of danger that culminates in a sprawling, 3D-world comprised of blocky polyg... ",
    "gameID": 0,
    "author": "charlie_killer"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2011-07-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "Awesome game, very hard to get bored of.\nIt\u0027s very addictive, it\u0027s like the world is yours to make. Almost feels like u r a god. Except u r a little blue miner guy. Sometimes it can be a little annoying that u don\u0027t find the resource u need but that\u0027s just part... ",
    "gameID": 0,
    "author": "choki5"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2011-07-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "To describe a massive game simply and in under 120 characters... Minecraft is big, unique, addicting, and amazing.\nI bought Minecraft back in August during it\u0027s Alpha stages. Ten months and the value has tripled. I payed $13.50, and have gotten well over 150 hours out of this game. It doesn\u0027t require a powerful PC to run, and is seri... ",
    "gameID": 0,
    "author": "robobobo717"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-07-13T00:00:00.000Z",
    "score": 9.5,
    "comments": "Brilliant, Immersive and So Much Fun\nOnce upon a time, there was a man named Marcus Persson. On the internet, he was known simply as Notch. Notch was rating indie games for a while and non really took off. One day, he played a game called Infiniminer. He th... ",
    "gameID": 0,
    "author": "lotire"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-07-13T00:00:00.000Z",
    "score": 8.0,
    "comments": "Cool, but misses a lot of stuff. Very complex, though.\nNice game, pretty complex and also simple. It still has a lot to do to make it 100% Extraordinary. The Redstone is pretty complex to use, just like any real electric circuits. Torches and repeaters can make just about an... ",
    "gameID": 0,
    "author": "Beimat"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-07-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "Why should you bye Minecraft?\nIf your were thinking about buying Minecraft go punch your self in the face for not buying it as soon as you herd about it. Notch has created this game with simple awesomeness. Its that simple you can just do the firs... ",
    "gameID": 0,
    "author": "mcgowan12345"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-07-29T00:00:00.000Z",
    "score": 9.5,
    "comments": "More than likely the number 1 game of the decade.\nThis game is probably the most diverse game to ever live. Hours can be invested into it without stop and many more hours will be invested into it. So much can be done with it to make it meet peoples needs. This game is m... ",
    "gameID": 0,
    "author": "blaze10002"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2011-08-09T00:00:00.000Z",
    "score": 9.5,
    "comments": "A very simple and addictive game about placing blocks :D\nThe game is exactly what it looks like. An old 8-bit styled game about placing blocks. Thats about as simple as i can make it for you. The game is all about imagination...or survival. it all depends on witch aspect you l... ",
    "gameID": 0,
    "author": "evilmaster2424"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-08-10T00:00:00.000Z",
    "score": 8.5,
    "comments": "Minecraft is a sandbox game which allows players to build constructions out of textured cubes in a 3D world.\nMinecraft is a sandbox game which allows players to build constructions out of textured cubes in a 3D world. You can create a house with textured cubes such as, stone,dirt,sand and what ever is on earth. You need to b... ",
    "gameID": 0,
    "author": "NINSSGG"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2011-08-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "I gotta say , amazing game , really , it\u0027s worth buying it !\nWell , at first i played a ripped single-player version of minecraft and wen i spent about 15 minutes playing that , I bought myself the real game (through their website) . The multy-player(purchased version) of the game... ",
    "gameID": 0,
    "author": "DBZ-Vegeta"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2011-08-19T00:00:00.000Z",
    "score": 9.5,
    "comments": "The most addicting game in the world.\nMinecraft is the most addicting game I have ever played. To think such a simple concept could become so much fun. Basically you get wood, build a house so you can avoid monsters at night, and you mine until you can get o... ",
    "gameID": 0,
    "author": "limonman32"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-08-30T00:00:00.000Z",
    "score": 9.5,
    "comments": "CAN\u0027T - STOP - PLAYING! Extremely recommended for those who like to exploit their complete imagination :\nIt is an awesome game, excellent for those who like to create stuff, quite fantastic for those who just like to dig, mine and collecting the basic resources. If you are the type of person who likes to create, build ... ",
    "gameID": 0,
    "author": "Johnyoak"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-09-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "It´s a great game ...\nIt´s a great game ! Very addictive ... Also you can do almost everything on the game ! I have only tried the Pc version but I´m planing on buying the Xbox 360 version ... arg areg earg et gdsfngvtrehgd fg teg dstg sdg et... ",
    "gameID": 0,
    "author": "palitumanuel"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-09-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "This Game made me luv myself :D\nthe best game ever the best game ever the best game ever the best game ever the best game ever the best game ever the best game ever the best game ever the best game ever the best game ever the best game ever... ",
    "gameID": 0,
    "author": "djames12345"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-09-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is Minecraft. MINECRAFT. If you aren\u0027t playing it in your gaming time... well, what ARE you doing?\nThe Good: Endless possibilities; Generated worlds are truly unique; Fun crafting system; Extended biomes truly make the game feel bigger; Combat is fast and frenzied - in a fun way. The Bad: Wait- there\u0027s a bad side t... ",
    "gameID": 0,
    "author": "Braveheart42"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2011-09-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "the reason to have a PC\nthis is the best pc game ever. i love the gameplay. at night bugs and creppers well try to eat you. but you can kill them. there is storm nights and there is sunny days. if you like to build this is the game for you. you... ",
    "gameID": 0,
    "author": "batito_basic"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2011-09-24T00:00:00.000Z",
    "score": 9.5,
    "comments": "My review! Please read if you\u0027re planing to buy it or don\u0027t know what it is.\nHello, this is my review for Minecraft. This game is a survival creative game where you build and survive against creatures spawning in the night. You can mine and dig all the way down to the bottom until you find ore... ",
    "gameID": 0,
    "author": "Littl3M0nst3r"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2011-09-26T00:00:00.000Z",
    "score": 8.5,
    "comments": "Great Fun, but Without Mods it\u0027s A Little Limited and Repetitive.\nMany have called this the most creative game ever, one person even said \"you can do anything in this game\". The creation is fun, but compared to a game like LittleBigPlanet 2 (or even 1) this games creation system is ver... ",
    "gameID": 0,
    "author": "lmaocarrots"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-09-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "MineCraft is a very addictive game you can play it forever but can sometimes get very hard.\nMineCraft is a game which can play forever as there seems to be no limits, but the graphics could be better, one thing that could be included is maybe more weapons or vehicles and the armour needs updating. The good thi... ",
    "gameID": 0,
    "author": "Caiza123456"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-09-30T00:00:00.000Z",
    "score": 9.0,
    "comments": "Great survival/sandbox game\nMinecraft is an open world game where you can do so much, If you want to get full enjoyment out of the game i recommend survival mode where in the day there\u0027s creepers and enderman\u0027s but in the night the monsters come ou... ",
    "gameID": 0,
    "author": "BONK-"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2011-10-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "Infinitely changing and diverse.\nMinecraft, basically, is what you want it to be. Want to run around dressed as Solid Snake building giant cobblestone penis\u0027? No problem. Minecraft is a totally immersing, creative and individual game. You\u0027ll have... ",
    "gameID": 0,
    "author": "SenorChunky"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 6,
    "date": "2011-10-09T00:00:00.000Z",
    "score": 8.5,
    "comments": "Gets boring after a long while.\nWhen you first start Minecraft, it\u0027s awesome and addicting. You can build just about anything you want out of blocks. That\u0027s about all you do, but it\u0027s really addicting for several months. But, after a while this game... ",
    "gameID": 0,
    "author": "dahaoleboy69"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-10-11T00:00:00.000Z",
    "score": 8.5,
    "comments": "Get it it\u0027s a master piece, and it\u0027s like legos let the imagination guide you.\nIts simple and funny, build a cave to live or a mansion or even a futuristic house anything is possible in this game I never see the ending world in this game actually I got lost on the Desert right after I go on a huge ... ",
    "gameID": 0,
    "author": "deadgodanubis"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-10-13T00:00:00.000Z",
    "score": 7.5,
    "comments": "Notch\u0027s new indie game sells great, but fun or not?\nThere are several schools of thought about minecraft at the moment. First thing to remember is that Minecraft is currently in Beta mode[at least it was when i wrote this], so it keeps changing progressively. This actuall... ",
    "gameID": 0,
    "author": "Whipperr"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-10-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "A game that promises to not let you be bored\nThis game is addictive and never gets boring. you have to modes: survival: Survive against the mob and eat to stay alive and craft. Creative: No lives and you have every block/item already so you can build what you wan... ",
    "gameID": 0,
    "author": "adski78"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-10-23T00:00:00.000Z",
    "score": 8.5,
    "comments": "Minecraft Scores 8.5/10\nMinecraft is a fantastic game where you can basically build what you want. It\u0027s made by Mojang, a small Indie developer, and has gone quite a ways since it first came out. What I love about Minecraft is that you can d... ",
    "gameID": 0,
    "author": "NewMeanings"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-10-29T00:00:00.000Z",
    "score": 8.5,
    "comments": "rating summary of minecraft classic\ngraphics-6/10 Minecraft may not have great graphics, but it is still a great game. If you are a graphics gamer than this is not the game for you. gameplay-8/10 Make buildings that come from your imagination and have f... ",
    "gameID": 0,
    "author": "mattdadrus"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-11-01T00:00:00.000Z",
    "score": 9.5,
    "comments": "Almost a perfect game! Room for lots of creativity and almost limitless! Too reliant on mods to keep it en\nClose to a perfect game I think! It gives you soooo much room for being creative with very little limit. There are a few small issues that keeps it from scoring a 10 for me... It requires a lot of new content to be en... ",
    "gameID": 0,
    "author": "LinkanBoy"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-11-03T00:00:00.000Z",
    "score": 8.5,
    "comments": "This little java based game shook the gaming world, and will go down in history.\nMinecraft, such a simple Idea. You can place blocks, destroy blocks, Collect Resources, and build structures. Or, to put in in a shorter text; you can mine, and you can craft. Minecraft is a Open world/Sandbox game ma... ",
    "gameID": 0,
    "author": "Giratina617"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-11-11T00:00:00.000Z",
    "score": 9.5,
    "comments": "Just pure fun...\nMinecraft is a game that really changes the meaning of sandbox by creating a huge world that you can do anything you like you have survival mode were you make your own items and have health and hunger and their is creati... ",
    "gameID": 0,
    "author": "avidgamer123"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-11-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "Immersive, Complex, Real Time, Creative Awesome\nOne of the greatest games I have ever played in terms of creativity exploration challenge and fun! Build entire cities, secret underground caverns, monolithic monuments. Destroy rival territories and engaged in PVP over ... ",
    "gameID": 0,
    "author": "Johnlmts"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-11-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "Minecraft is the definition of revolutionary\nBeing objective on Minecraft is almost impossible at this point. I\u0027ve played the game since November 2010 and I have probably spent 100\u0027s of hours in a game that to the casual observer is an ugly bunch of blocks. But t... ",
    "gameID": 0,
    "author": "Icky27"
  },
  {
    "helpfulCount": 43,
    "helpfulScore": 13,
    "date": "2011-11-24T00:00:00.000Z",
    "score": 3.0,
    "comments": "Serious..can we have the Windows 3.1 screensaver too? I mean serious my money tree is dead and I still tack on games.\nAbsolute crap..I gave this game 30-40 hours and its just nothing worth my time and I love game builders/sandbox games, graphics are the worst to date by any game and no I dont care about some opinions I\u0027ve heard about re... ",
    "gameID": 0,
    "author": "msilver67"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-11-25T00:00:00.000Z",
    "score": 9.0,
    "comments": "Every Minecraft user has a different experience.\nThe main purpose of this game is to survive through day and night cycles. In the day, you collect resources and at night you fend off monsters. There are three game modes, Survival, Creative and Hardcore. Survival is the... ",
    "gameID": 0,
    "author": "joker778"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-11-25T00:00:00.000Z",
    "score": 9.5,
    "comments": "Minecraft, an addicting fun game!\nYou can do just about anything in Minecraft. It\u0027s so fun and you can build anything. There are different game modes and skins and textures, and so much more. Minecraft is a game where you build and destroy blocks to crea... ",
    "gameID": 0,
    "author": "TopClassGamer"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-11-25T00:00:00.000Z",
    "score": 8.5,
    "comments": "Minecraft is one of the most revolutionary games of the 21st century, but it isn\u0027t without its flaws.\nMinecraft is the single most unique game I have ever played, one of the best, and certainly my most played game ever. Even after a year and a half of ownership, Minecraft is still the perfect outlet for my creativity. Mi... ",
    "gameID": 0,
    "author": "TBH717"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-11-25T00:00:00.000Z",
    "score": 9.5,
    "comments": "are you the person that likes to use there hands and create things with Lego? well then this is the game for you\nthis game is an adventuring game, a creative game, and an action game all mixed in 1! It consists of monsters swords Blocks and awesomeness ya this is an epic game. you could live anywhere like a forest, swap and a winte... ",
    "gameID": 0,
    "author": "MarkAndPizza"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-11-25T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft is one of my favorite PC games of all-time.\nMinecraft is a game that allows you to extend you creativity and your only limit is your imagination. This game has sucked many people in with it`s addictiveness and it`s awesomeness. Nevertheless, here is my review for... ",
    "gameID": 0,
    "author": "YummyFries"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2011-11-29T00:00:00.000Z",
    "score": 9.0,
    "comments": "This is the game for you, no matter what you like, there is something here for everybody in Minecraft\u0027s addicting world.\nIf you have been alive for the last year or so and haven\u0027t heard of Minecraft, you must be under a rock. Minecraft is a sandbox survival game set in a randomly generated blocky world for you to explore. The moment you ... ",
    "gameID": 0,
    "author": "Dogchair"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-11-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best games i have ever played! It has an amazing concept! A brilliant gameplay!\nThe game is so awesome! It has an epic combat system, a great amount of blocks a friendly community, a worth buying game, it has taken a year to make, and minecon was brilliant! Probably one of the most played games out ... ",
    "gameID": 0,
    "author": "danta4000"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-11-30T00:00:00.000Z",
    "score": 9.0,
    "comments": "Most amazing game have and probably will ever play!\nMinecraft is simply amazing, and if stunning graphics are your thing, Minecraft definately isn\u0027t, but in my opinion the game is beautifull in it\u0027s own way, by being extremely simple, most gamers look at the game and judg... ",
    "gameID": 0,
    "author": "lewismac2k"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2011-11-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best Indie Game. Ever. 10\nAbsolutely the best Indie game ever. You can easily lose hours and hours of your life, personal hygiene, sleep, etc to this game. If you haven\u0027t seen or heard of this game (what do you live under a rock?) the... ",
    "gameID": 0,
    "author": "robgraves2003"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-12-01T00:00:00.000Z",
    "score": 9.0,
    "comments": "Sign away your life, stock up on hot pockets and red bull, lock the doors, and over feed the cats.. its time to play MC!\nWithout a doubt Minecraft is one of my top five games of all time. Not since Tribes and Space Empires IV have I found a game that has engrossed me to the point of not sleeping for days on in. From my first map to my mo... ",
    "gameID": 0,
    "author": "Advocate"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-12-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "A Great and addictive game, you must try it.\nMy friend forced me to try Minecraft out and i wouldn\u0027t try it untill 3 months later and i just loved it. for the first 2 months i played almost non stop in my freetime and now still with all the awesome games coming out... ",
    "gameID": 0,
    "author": "Scrambles14427"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 3,
    "date": "2011-12-06T00:00:00.000Z",
    "score": 7.0,
    "comments": "Minecraft Review\nMinecraft is a sandbox game where you can build or do pretty much anything you want. The game starts off with you, the player, collecting materials to build a shelter for you to survive the night where monsters come out... ",
    "gameID": 0,
    "author": "nick_the_pokemo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-12-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "My first review on gamespot, for a game I have grown to love over due time.\nI was skeptical about this game at first, I read reviews and opinions and listened to many, many lectures from various friends. One day when I found myself with a bit of extra cash I decided to pay the fifteen dollars an... ",
    "gameID": 0,
    "author": "El-Monstruo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-12-11T00:00:00.000Z",
    "score": 9.5,
    "comments": "Minecraft is a game that lets you make the game. Minecraft doesn\u0027t rely on anything preset, you can make it do anything!\nI remember it like it was yesterday. My favorite thing to work on was the indie scene, and I checked it regularly. One day I went to the YouTube homepage and checked out the most watched. There was X\u0027s Adventures in Mine... ",
    "gameID": 0,
    "author": "superman3275"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-12-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best game on Planet Earth\nFrom mining diamonds to slaying creepers this game lives up to be the best indie game you will ever lay your eyes on. The reason you may ask, I think because you can build anything you can imagine. Its infinite world gen... ",
    "gameID": 0,
    "author": "thewaffleman45"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-12-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "AWESOME GAME\nAWESOME GAME AWESOME GAME AWESOME GAME AWESOME GAME AWESOME GAME AWESOME GAME AWESOME GAME AWESOME GAME . ITS A DRUG ITS A DRUG ITS A DRUG ITS A DRUG ITS A DRUG ITS A DRUG ITS A DRUG ITS A DRUG ITS A DRUG ITS A DRUG ITS ... ",
    "gameID": 0,
    "author": "tenergy"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-12-14T00:00:00.000Z",
    "score": 9.5,
    "comments": "All the blocks just form this way\nTHIS......This is the ONE sandbox game I\u0027ve been waiting for since first playing SimCity 2000 for the first time. There are NO limits to what you can or can\u0027t do in Minecraft. Everything is there for you, all you need is... ",
    "gameID": 0,
    "author": "Dagg3rFa1lz"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-12-14T00:00:00.000Z",
    "score": 9.0,
    "comments": "Unique and fun\nMinecraft, the game brought to life by your creativity, was first released on May 10th 2009. This was the first pre-alpha release and was a very basic idea at that time, but by 0.30 multiplayer had been added and alot of... ",
    "gameID": 0,
    "author": "MikeBr0wne"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2011-12-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "Every bit of fun you\u0027ve heard it to be.\nThe team at Mojang has put together an incredible place to play in. Going through Minecraft and discovering the layout of the land, the crafting recipes, the end of a particular cave, tunnel, or dungeon, or how to build... ",
    "gameID": 0,
    "author": "Xeroproject"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-12-16T00:00:00.000Z",
    "score": 9.5,
    "comments": "awesome game the best game i ever played awesome game the best game i ever played\nawesome awesome game the best game i ever played awesome game the best game i ever played awesome game the best game i ever played awesome game the best game i ever played awesome game the best game i ever played a... ",
    "gameID": 0,
    "author": "gytis345"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-12-19T00:00:00.000Z",
    "score": 9.5,
    "comments": "About as awesome as Team America destroying Kim Jong Il. Even though that technically didn\u0027t happen.\nSo it is telling me that I need to \"fill in this text review\" but my Review Deck sums everything up. So now I am sitting here drinking my maple syrup and Jack, in my igloo, and playing Minecraft. So there it is. Minecraf... ",
    "gameID": 0,
    "author": "Khrosse"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-12-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is incredible\nYou\u0027ve probably heard about minecraft, its the game everyone has been talking about. Well I recommend buying it right now you don\u0027t need this reveiw but ill write one any way. This game starts you off in a random place ... ",
    "gameID": 0,
    "author": "kjhorton25"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-12-21T00:00:00.000Z",
    "score": 9.0,
    "comments": "Great game, Great idea...\nMinecraft is one of the funnest games i have played in a long time. with a similar feel to lego it has a great feel to it. The style of the game is also unique and fun to experience. My only fault with this game is that ... ",
    "gameID": 0,
    "author": "avidgamer1"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 4,
    "date": "2011-12-28T00:00:00.000Z",
    "score": 9.5,
    "comments": "Monsters and castles and mines, oh my!\nAs most of you have probably heard, MineCraft is really popular right now. It was made by a single person, who has amassed a fortune off of it - why? Because it\u0027s so addictive. MineCraft Cl@ssic, which is still really fu... ",
    "gameID": 0,
    "author": "AjaxNeron"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-01-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft Review\nMinecraft Review Minecraft is a PC game that you can purchase on Minecraft.net or play the game for free, but it\u0027s just a simple demo. (No zombies, mobs, weapons etc) Gameplay: The gameplay is amazing. You start in... ",
    "gameID": 0,
    "author": "BLASTER10169"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 3,
    "date": "2012-01-05T00:00:00.000Z",
    "score": 2.5,
    "comments": "This game is neither innovative nor addicting. It is worth several hours, but it starts feeling like a chore.\nI do not dislike the game, but it is probably not worth the money. The first time you play the game, it feels exciting. Anything you want to do is worth the effort. Believe me, it is fun to have the freedom that is offer... ",
    "gameID": 0,
    "author": "Shroomicide"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-01-08T00:00:00.000Z",
    "score": 9.0,
    "comments": "Mine, Craft and Build!\nHow good is this game; well how good is your imagination? Do you want a Victorian mansion? You\u0027ll need to make some tools and cut down some trees. Want a castle; mine some ore to smelt the stone you\u0027ve been digging up... ",
    "gameID": 0,
    "author": "wishsong4"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-01-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Mine, Dig, Explore!\nOk i have spent countless Hours Playing Minecraft The Graphics on the game are very pixeleated but thats what gives it a Minecraft Feal, Because of this Epic Creations can be made. (10/10) The Exploration is Endless! C... ",
    "gameID": 0,
    "author": "zeromaniac3000"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-01-18T00:00:00.000Z",
    "score": 7.5,
    "comments": "Persson has discovered a mine of golden ideas. Unfortunately, hasn\u0027t made anything truly magnificent with it.\nMinecraft is not exactly a video game as you know it. Here is a game void of a tutorial, there is no clear objective, no proverbial hand to guide you and no over-arching story. It\u0027d be a stretch to call Mark Persson a ma... ",
    "gameID": 0,
    "author": "Lord_Python1049"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-01-23T00:00:00.000Z",
    "score": 9.5,
    "comments": "Great game, will entertain you for hours\nSome people don\u0027t like the graphics. And that\u0027s fine. But I personally love the retro graphics, I think it really adds character to the game and makes it stand out. But whats not fine is people refusing to play the game,... ",
    "gameID": 0,
    "author": "madattak"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2012-01-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "The BEST GAME EVER!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! BLOCKY BUT AMAZING!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\nIt is pretty much real life with a kiddie twist, such as zombies, skeleton\u0027s and CREEPERS WHO BLOW CRAP UP! It is so simplistic u can mod it with pretty much anything u want!!!!! u can play with friends, kill creepers,... ",
    "gameID": 0,
    "author": "Thoughtlamb"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-01-30T00:00:00.000Z",
    "score": 5.5,
    "comments": "It\u0027s getting a bit old and boring now\nI used to play this game all the time until they released 1.1 which has caused me to stop playing the game. Single player gets boring very fast, I get bored within 10 minutes now and the only fun I get is from multi play... ",
    "gameID": 0,
    "author": "FC360"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 2,
    "date": "2012-02-05T00:00:00.000Z",
    "score": 1.0,
    "comments": "Minecraft Review- Mess Of A Game, Great Toybox\nMinecraft is out people, you know what that means! Time for me to **** it all over it in this review!!! No, but really, most of these reviews for Minecraft that I have seen on every review sites are giving it insane scor... ",
    "gameID": 0,
    "author": "adit942"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-02-15T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft is a great way to make time fly.\nMinecraft is a game where you are the creator. You have to ability to create anything your heart desires. You are placed in this vast land with nothing. If you are playing on a difficulty level higher than peaceful, ... ",
    "gameID": 0,
    "author": "x-Uncharted-x"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2012-02-18T00:00:00.000Z",
    "score": 5.5,
    "comments": "From indie phenomenon to cash cow.\nI played Minecraft way more than I\u0027d like to admit. I was the odd one out of my friend group who \"understood\" the Minecraft experience and loved its simplicity and addictive gameplay. It taps into the gamer\u0027s creativi... ",
    "gameID": 0,
    "author": "1000rads"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-02-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "Been playing it for nearly a year now and I\u0027m still loving it.\nOnce You get familiarized with the game and learn all the important recepies needed for survival, you are ready to boiuld your awesome structures. The game is made so that u can even design and create some basic or advan... ",
    "gameID": 0,
    "author": "froggy27"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 1,
    "date": "2012-02-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "Prefect name for this game.\nI\u0027ve been having much fun with Minecraft, it\u0027s crazy how addictive it can be. The name says it all, you mine for resources and craft items to survive. Most of the time it is you mining and crafting, but don\u0027t let your gu... ",
    "gameID": 0,
    "author": "Blue-Diamond"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-03-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "once I bought this game and showed it to my dad, Minecraft instantly turned into a family-wide phenomenon.\nwhen I first heard of this game, I was really skeptical. it sounded like one of those games that got boring really quickly. but as I watched more videos of the game and reading more and more excellent reviews of it, I fe... ",
    "gameID": 0,
    "author": "Dylgo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-03-06T00:00:00.000Z",
    "score": 9.5,
    "comments": "Obsession, 8-bit, no rules, and a great modding community make this one great.and with 100\u0027s pop-culture refrences.\nWell minecraft is a survival game set in a blocky wolrd with 8-bit graphics, you craft and build everything. This game has charming music too. controls are simple, and crafting is almost intuitive and easy to learn. Wh... ",
    "gameID": 0,
    "author": "cave_is_johnson"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-03-14T00:00:00.000Z",
    "score": 7.0,
    "comments": "[Questionably Spoilers] Minecraft is an excellent idea, but is it truly a game for everyone?\nI\u0027m pretty sure everyone around the internet has at least heard of Minecraft. If you haven\u0027t, then it\u0027s probably because you\u0027re either a time traveler, or you literally live under a rock. Minecraft is more so like a crea... ",
    "gameID": 0,
    "author": "Fury1994"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-03-18T00:00:00.000Z",
    "score": 9.5,
    "comments": "An amazing game perfect for all ages. Building/surviving. Highly addictive. You imagination is the limit of this game.\nHighly outstanding game great for all ages if they crave a building/survival game. I highly recommend this game to anyone interested in this type of game. This game takes the player on a continuous journey to defeat a sp... ",
    "gameID": 0,
    "author": "BlackShadowX16"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-03-20T00:00:00.000Z",
    "score": 9.0,
    "comments": "\"Sssssssssssssssssssssss\"\nGood: -Fascinating blocky 3D sandbox graphical style. -Brief but good music. -Day/night cycle leads to a perfect balance between adventure and creativity. -No-so-obvious combinations and arrangements of blocks and it... ",
    "gameID": 0,
    "author": "miracalious"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-03-24T00:00:00.000Z",
    "score": 8.0,
    "comments": "Mine craft review(read this if you have mine craft)\nOK this is legend gamer, and this is a review on mine craft. A sandbox(open world) building game which is a hit nowadays because of its fun game play. For the last 1 week i was playing this and what i found is that this... ",
    "gameID": 0,
    "author": "legendgamer14"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-03-28T00:00:00.000Z",
    "score": 9.0,
    "comments": "Patience and creativity mixed with a lot of charm. How will you take it ?\nThis is a creative, adventurous, totally un-linear,creative survival horror. It also has no tutorial or explanation of what to do or where to go. Which in my books, is brilliant. No tutorial means this games learn... ",
    "gameID": 0,
    "author": "IamNick2k11"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-04-05T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft is a revolutionary building game from a small indie developer,\nThe Good: Extremely easy to mod with tons of great user made mods available, user-friendly interface, caters to both hardcore and casual gamers, varying difficulties The Bad: Poor AI, Almost no time to pick up items a... ",
    "gameID": 0,
    "author": "ivory_soul"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-04-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "So Simple, So Sexy\nHow can Minecraft be put other then, so simple its amazing. In a world so large it can\u0027t be mapped out entirely (Not true, but its not in your best interest to prove me wrong), lies an indigenous population of cubed peop... ",
    "gameID": 0,
    "author": "Revan-Cakes"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-04-25T00:00:00.000Z",
    "score": 9.0,
    "comments": "Has there ever been a better building/mining/exploring/crafting game?\nFor my first review I decided to use Minecraft since its my most recent game. Not only is Minecraft an original and addictive game, its also revolutionizes the defintion of PC gaming, I would without a doubt recomme... ",
    "gameID": 0,
    "author": "SecondSentry"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-04-29T00:00:00.000Z",
    "score": 8.5,
    "comments": "Minecraft extends out of it\u0027s extended beta and builds to the heights of some of the greatest indie games ever made\nIndie projects can often be considered the black sheep of the gaming world; often times they spiral into rushed mediocre projects designed to get lesser known companies off the ground. One of the biggest contradictions t... ",
    "gameID": 0,
    "author": "deactivated-57bac25e99ee3"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-05-01T00:00:00.000Z",
    "score": 9.5,
    "comments": "God, You have to play THIS GAME!!!!!!\nIf you\u0027ve heard of people going Minecraft, MINECRAFT Minecraft Minecraft Minecraft! And you\u0027ve never heard of it then I\u0027ll get you up to date! Minecraft is a game about building anything you can imagine!!!!! If it\u0027s a ... ",
    "gameID": 0,
    "author": "MaxHForever"
  },
  {
    "helpfulCount": 14,
    "helpfulScore": 6,
    "date": "2012-05-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "One might think that this is a simple version of the PC Minecraft when in fact - this one is actually more solid.\nI first thought this Xbox version of Minecraft would be a lesser version of the PC Minecraft. I thought the controls were going to be clunky, the crafting would not be very immersive and rewarding and the general feel wo... ",
    "gameID": 0,
    "author": "zaboon_"
  },
  {
    "helpfulCount": 17,
    "helpfulScore": 4,
    "date": "2012-05-11T00:00:00.000Z",
    "score": 1.0,
    "comments": "Lack of off-line multiplayer, unless you have an HD-TV\nI already had this game for the PC version, bought it about an year ago, but didn´t enjoy playing it alone on my PC or online, I rather play with people I know by their side than playing online. So when this version came... ",
    "gameID": 0,
    "author": "chiogab"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-05-11T00:00:00.000Z",
    "score": 9.5,
    "comments": "Possibly one of the most addictive survival games to date.\nFirst impression of this game to me was \"Wow, this game is totally trippy. I\u0027m not sure if I\u0027m going to like this\". Water flowing out of the sky, trees spawning high in the air on a single plot of dirt. Until I realized ... ",
    "gameID": 0,
    "author": "N8terz"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 6,
    "date": "2012-05-11T00:00:00.000Z",
    "score": 4.0,
    "comments": "When compared to the original... It fails. When it try\u0027s to do something different... It fails.\nOk, I know I\u0027m going to get a TONNE of flak for this ,but it has to be said: THEY DUMBED IT DOWN SOOOO MUCH. Many of my complaints deal with the fact that any sense of exploration and discovery have been obliterated. Fir... ",
    "gameID": 0,
    "author": "sonichunter99"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2012-05-12T00:00:00.000Z",
    "score": 9.5,
    "comments": "This game is very, VERY well executed on the XBOX, though crafting is bland and version is late. 8.0! Nice job, Mojang !\nThis game is very, VERY well executed on the XBOX, though crafting is bland. It could work with traditional, and sometimes there are glitches where I can\u0027t craft something because I don\u0027t have what I\u0027m trying to craft. T... ",
    "gameID": 0,
    "author": "ZaoMonichi"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2012-05-12T00:00:00.000Z",
    "score": 9.5,
    "comments": "People said Minecraft was amazing on the PC. The Xbox 360 version doesn\u0027t disappoint.\nMinecraft was originally a game that was PC only, attaining millions of players due to its levels of creativity, openness and just downright fun. Recently the Xbox 360 version has been released. The game has only bee... ",
    "gameID": 0,
    "author": "AdamHodsdon399"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-05-13T00:00:00.000Z",
    "score": 7.0,
    "comments": "Once you start making your imaginations a blocky reality you\u0027ll realize that several hours have pass since you started\n\"Minecraft may suffer from certain issues but once you start making your imaginations a blocky reality you\u0027ll realize that several hours have pass since you started\" Developer: Mojang Publisher: Mojang Platform: XBL... ",
    "gameID": 0,
    "author": "Outatomomega"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-05-13T00:00:00.000Z",
    "score": 9.5,
    "comments": "Minecraft\nOk guys seriously I always thought Minecraft was better on the PC.But Xbox 360 has proved they know how to play.Minecraft is highly addicting game based on your buildings and survival.When the sun goes down your in troub... ",
    "gameID": 0,
    "author": "EpicBanna123"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2012-05-13T00:00:00.000Z",
    "score": 7.0,
    "comments": "better on the pc\nbetter on the pc better on the pc better on the pc better on the pc better on the pc better on the pc better on the pc better on the pc better on the pc better on the pc better on the pc better on the pc better on the pc... ",
    "gameID": 0,
    "author": "LTise"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-05-14T00:00:00.000Z",
    "score": 8.5,
    "comments": "Great port for playing with friends but a lack of familiar content may disappoint fans of the PC version.\nI\u0027ve played Minecraft since October of 2010, when the game was still in its Alpha version, and before even a million players purchased the game. Instead of going into what the game is, as we should all know by now, I\u0027ll... ",
    "gameID": 0,
    "author": "oRadical"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2012-05-14T00:00:00.000Z",
    "score": 9.0,
    "comments": "Sometimes this port is favourable over the PC version...\nChances are, you already know the basic concept of Minecraft. You are dropped in a randomly generated world made of blocks with nothing but your bare hands (and in this version, a map). Using the resources in the world, ... ",
    "gameID": 0,
    "author": "fillup0"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-05-15T00:00:00.000Z",
    "score": 9.0,
    "comments": "As a first-time miner, I must say Minecraft is an amazing experience\nDespite all the industry buzz, I never took the plunge into the PC version of Minecraft. I downloaded the Xbox 360 demo to give it a whirl and was almost immediately drawn in enough to buy the full version. Just like c... ",
    "gameID": 0,
    "author": "mcginnism"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2012-05-15T00:00:00.000Z",
    "score": 9.5,
    "comments": "With a great imagination and a good server to play on, this could easily be one of the best games you will ever play.\nMinecraft is a charming little game that will fully immerse you into its world and won\u0027t let go. Especially due to the fact that the game is still nowhere near complete, one could only imagine the possibilities when the ... ",
    "gameID": 0,
    "author": "focus0894"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-05-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "Addictive beyond reasoning!\nWhen I first saw gameplay for Minecraft over a year ago, I thought it was ridiculous. I thought no one is ever going to play this game. Its such a step backwards in the gaming world. So I completely ignored that game. Mo... ",
    "gameID": 0,
    "author": "ashleroy"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-05-17T00:00:00.000Z",
    "score": 9.0,
    "comments": "One of the greatest Xbox Live Arcade games available.\nMinecraft is one of the best Xbox Live Arcade that is available to purchase via the Xbox Live marketplace. 1600 Microsoft points may seem a bit steep for a arcade game but once you purchase it, you will never look back. ... ",
    "gameID": 0,
    "author": "21lockdown"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-05-18T00:00:00.000Z",
    "score": 8.5,
    "comments": "Ain\u0027t all it used to be in PC but It\u0027s an experience.\nI heard this is coming in 360 then that\u0027s my chance to try it. It\u0027s very challenging to survive in this game. I also got annoyed in the no hunger thing... I saw it on PC version that people regenerate when you got hit a... ",
    "gameID": 0,
    "author": "kierwinyoung"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-05-20T00:00:00.000Z",
    "score": 7.5,
    "comments": "Good game and great starting point for new to minecraft.\nMinecraft is a really great game with an even better story behind it. Its a game that eveyone should try atleast once. With this said, everyone new to the game should be aware of the differences between the PC and Xbox... ",
    "gameID": 0,
    "author": "Mifflinite45"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 0,
    "date": "2012-05-20T00:00:00.000Z",
    "score": 6.5,
    "comments": "Repeated Mistake...\nMinecraft is nothing new, the only new thing here is that it has come to the xbox. Sure the multiplayer is a whole lot better, no serever IPs and what not, but Notch did the same thing they did with the PC versions, rele... ",
    "gameID": 0,
    "author": "UpToScratch"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-05-20T00:00:00.000Z",
    "score": 9.5,
    "comments": "While it apparently doesn\u0027t live up to the reputation of its pc counterpart. There still a must play game here.\nFor a number of months prior to the release of minecraft on the xbox, I have been playing Minecraft Classic edition and while it is a good game it really isn\u0027t Minecraft, in fact there is no crafting at all and therefore... ",
    "gameID": 0,
    "author": "pastamansam"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-05-21T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft Review\nThis is an interesting game full of action and destruction. Fighting Zombies to digging for gold this is a game of neverending possibilities. This game provides you with many options mining, fighting, exploring, and even... ",
    "gameID": 0,
    "author": "solidxon23"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2012-05-22T00:00:00.000Z",
    "score": 9.5,
    "comments": "If you thought that Minecraft Xbox 360 Edition wil be just a lighter version of the PC version, then you must read this!\nEverybody who likes Minecraft probably already play it on the PC, and think that the Xbox 360 version will probably be the same thing, but with horrible controls, then you couldn\u0027t be more wrong. The PC version of Minec... ",
    "gameID": 0,
    "author": "mythcold"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-05-25T00:00:00.000Z",
    "score": 9.0,
    "comments": "This game blew my mind....twice!\nMinecraft has quickly become that game that I HAVE to play at least for an hour or two a day. It is easily one of the most addicting games I\u0027ve ever had the pleasure to play. The concept is so simple...but there is so mu... ",
    "gameID": 0,
    "author": "SynysterBurns"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-06-03T00:00:00.000Z",
    "score": 8.5,
    "comments": "Never thought I\u0027d enjoy it, but now I\u0027m addicted...\nFirst of all, I\u0027m not going to argue about it : Minecraft for Pc is the best Minecraft. Bigger environments, NPCs, lots and lots of seeds, different modes to play and so on... That being said, Minecraft for Xbox360 is a... ",
    "gameID": 0,
    "author": "KnightSparda"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-06-04T00:00:00.000Z",
    "score": 9.5,
    "comments": "The BEST sandbox game out there.\nPros: Huge open worlds to explore, endless building possibilities Cons: occasional loading issues, multiplayer bugs, love-it-or-hate-it graphics Back in the \"Minecraft Alpha\" days, one of my good friends told me ... ",
    "gameID": 0,
    "author": "andrewmm424"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2012-06-09T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft takes One Giant Step forward.\nI\u0027ve been a Minecraft fan for a very long time now since it was introduced to me in high school and when i heard it was coming to Xbox 360 i had to do research about it, I was surprised and excited at the same time about... ",
    "gameID": 0,
    "author": "Xi-MeNaCe-iX"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-06-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "AWESOME!\nThe most! Played game on my Xbox. Hours! of FUN! Never got bored of it! It could have bigger world like the PC version, \"That would be awesome\", but overall its an awesome game that you can create Whatever! you want! Als... ",
    "gameID": 0,
    "author": "adambomb1017"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-06-18T00:00:00.000Z",
    "score": 5.0,
    "comments": "Idea sounds fun but when your actually playing it...\nThis is one of the most boring brain rotting game I\u0027ve played besides Duke Nukem forever. Look I get it it\u0027s just a free world roam game where you do sim style kinda stuff it looks and sounds cool, but then there is the ... ",
    "gameID": 0,
    "author": "davidsworld3"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-06-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best free-roaming games ever!\nMinecraft is probably for me the best game i have ever played. Spawn in a generated world, get supplies, and do anything you want! But your not alone. Mobs will come and get you, all the way from zombies eating you, to c... ",
    "gameID": 0,
    "author": "xXExtrikerXx"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-06-24T00:00:00.000Z",
    "score": 8.0,
    "comments": "Despite missing a large amount of content from the PC version, this Xbox 360 port is still a blast to play with friends!\nWhat was thought of as a game I would never play surprised me greatly when I downloaded the demo when this came out for 360. After purchasing this Arcade title and putting a good 50+ hours into it, I can say it is a blas... ",
    "gameID": 0,
    "author": "XboxGuy1537"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-06-26T00:00:00.000Z",
    "score": 6.5,
    "comments": "This is not a game that entertains you, its just a tool to aid you in entertaining yourself\nMy review for this game is not going to be long as there is not much to write about, but this is in no way a bad thing. Simplicity of this game doesn\u0027t stop it from being challenging. Doesn\u0027t make sense? Let me explain i... ",
    "gameID": 0,
    "author": "kjkostya"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-06-29T00:00:00.000Z",
    "score": 9.0,
    "comments": "Some things about Minecraft\n1. I started playing it after watching some dudes playing it on youtube. I didn\u0027t had my hands on the game yet but i was addicted after watching their videos right-away. 2. Played single player for half a year, building... ",
    "gameID": 0,
    "author": "Nightwish4al"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-06-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "THIS GAME IS AWESOME\nthis game is very good online and offline and there is always something to do like mine, make things, hit animals, kill zombies, collect wool, build a portal made out of a material called obsidian, and the portal takes y... ",
    "gameID": 0,
    "author": "poplo1000"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-07-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Supercali - fragilisticexpeali - doshous. The thought of saying no to it is simply quite atrocious.\nMinecraft has it\u0027s qualities and when you ignore the fact that the version is completely outdated and that you could cheat your way into getting unlimited items, it really is the best downloadable game of the century! Su... ",
    "gameID": 0,
    "author": "AshAttak"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2012-07-05T00:00:00.000Z",
    "score": 8.0,
    "comments": "Minecraft: Review\nI don\u0027t normally review arcade games but I thought I would give Minecraft a shot. I\u0027m going to keep this review short because if you have played a Minecraft game on the PC then you know how fun it is. I on the other hand... ",
    "gameID": 0,
    "author": "-HaloHitman-"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-07-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "Anything can happen in Minecraft\nIt all started about 3 years ago, when a Swedish developer, named Notch, first created the game. The game was really popular, right from the beginning, attracting massive crowds of gamers who love sandbox games, or gamer... ",
    "gameID": 0,
    "author": "kerk12"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-07-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft is like no other game, it needs creativity and imagination to guide your experience.\nImagine you wake up in a world with no resources, with monsters crawling around at night, an infinitely large world, and farm animals all around. That is Minecraft. But it is so much more than just crafting and mining, i... ",
    "gameID": 0,
    "author": "legend157"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-07-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "Played the PC version. So, this is gonna obviously gonna need more updates.\nPC is fun too, just waiting for some updates, like Enderman, skins, and creative mode. The next update is coming soon. I got it three days after it came out and have played it everyday since. My friends and I like to pla... ",
    "gameID": 0,
    "author": "supersasuketaco"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-07-09T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft is finally here on XBLA...but does it live up to the Amazing PC version?\nMinecraft is finally here on XBLA from producer Mojang, the game has grown an amazing amount since being a small strategy game for the PC. It\u0027s still the same game on the PC but it has slightly shinier graphics and you c... ",
    "gameID": 0,
    "author": "TheHDTheory"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-07-10T00:00:00.000Z",
    "score": 8.0,
    "comments": "Great game But, is missing so much. Was so excited to get it on my xbox, but so disappointed to the amount it is\nMinecraft, has always been a top \u0027notch\u0027 game for me. Its fun, different, creative, well loads of words could describe it. I have both the PC and XBOX version, and found it somewhat disappointing on the xbox. Unfortuna... ",
    "gameID": 0,
    "author": "Neslay"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-07-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "A Minecraft Review.\nIf adventure genres are your taste, then you will get highly addicted to Minecraft. Venturing in an endless world, finding your way out inside an abandoned mineshaft, or even surviving in Hell. There are a lot of fun th... ",
    "gameID": 0,
    "author": "kinnovittorio"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 3,
    "date": "2012-07-16T00:00:00.000Z",
    "score": 5.0,
    "comments": "Nothing like the PC version, and lacking in so many areas\nI know minecraft is an innovative construction based game, where the player is put into a world they are fully capable of molding to their liking, but the game falls short on a lot of things. This particular version of t... ",
    "gameID": 0,
    "author": "GaudyMarrko"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-07-16T00:00:00.000Z",
    "score": 9.5,
    "comments": "Create or Destroy. Hunt or Farm. Kill or Be Killed. Your game your way.\nThis game has been near number one for a while but is it worth $20? Yes it is, this game brings back oldschool graphics while giving you the feel of modern games making it impressive to everyone. Everytime you spawn a ne... ",
    "gameID": 0,
    "author": "AthleticTurtle"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 1,
    "date": "2012-07-17T00:00:00.000Z",
    "score": 9.0,
    "comments": "Exploring, Intriguing and a Game of its Own genre!\nMinecraft is a game of its own kind. Even though the graphics are not up too scratch at all with todays technology, it doesnt matter because the addiction to the game is enchanting! From collecting world supplies and sur... ",
    "gameID": 0,
    "author": "kye-mc"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-08-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "Your creativity and ambition is what counts in Minecraft...and your determination to make it happen.\nWhen I started Minecraft I made a cave to keep me safe at night. That cave is now the entrance to my castle that I\u0027ve carved out of an enormous hill. It\u0027s taken me ages and is going to take even longer to complete. It ... ",
    "gameID": 0,
    "author": "SgtWhiskeyjack"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-08-11T00:00:00.000Z",
    "score": 7.0,
    "comments": "not great but addicting\nMine craft for Xbox is a great game to play with friends over live but when you\u0027re on your it can get boring quickly. there are rumors of a new update adding creator mode i don\u0027t know if that will make it more fun when y... ",
    "gameID": 0,
    "author": "MoNk10021"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-08-25T00:00:00.000Z",
    "score": 8.5,
    "comments": "it\u0027s an awesome game when it came out i never went to sleep for 1 night played it for 24 hours when it was released\nwow an amazing game on Xbox can\u0027t wait to get it on pc for Christmas. unfortunately it is not the complete game and you can\u0027t use your minecraft account to use you own skin and you can\u0027t use any mods or have creative mo... ",
    "gameID": 0,
    "author": "conrade911"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2012-08-31T00:00:00.000Z",
    "score": 9.0,
    "comments": "Surprisingly addictive world-building game with a lot of surprises...\nFor once I totally agree with the official Gamespot review... well... most of it anyways ;) Minecraft, despite the blocky graphics which just add to the charm of the game, is a highly addictive game of world-building.... ",
    "gameID": 0,
    "author": "mgarribaldi"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 2,
    "date": "2012-09-05T00:00:00.000Z",
    "score": 1.0,
    "comments": "stupid pointless game, lads, do not even think about it cause it is the most abysmal game i have ever played.\nWhen i first started playing it, i saw how much it is abysmal. Graphics are poor, combat is idiotic that it does not match our today\u0027s standards. Dudes!! it was made in 2009 not in 1995, and even the first doom has bette... ",
    "gameID": 0,
    "author": "slimsha"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-09-12T00:00:00.000Z",
    "score": 7.5,
    "comments": "Small Indie Game that made it big, and now it\u0027s an indie classic that anyone can fall in love with.\nMinecraft is a game that was started back in 2010 as \"cave game\" then got renamed to Minecraft: Order of the Stone the to Minecraft. This game has so many elements and features that it has brought in over 7 million user... ",
    "gameID": 0,
    "author": "netcvb"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-09-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "Minecraft is a perfect sandbox game, amazing freedom.\nMinecraft is not like most games, it is kind of like the sims, only it doesn\u0027t suck. Instead you are placed in a completely new and random map that is filled with variety. There are many different biomes so that the map ... ",
    "gameID": 0,
    "author": "nadal97"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-09-22T00:00:00.000Z",
    "score": 8.5,
    "comments": "Real addicting\nMinecraft Xbox 360 Edition is a port of the extremely popular PC game that launched in 2009. Released in May of earlier this year (2012) 4J Studios and Mojang managed to get Minecraft on the 360. However back when it w... ",
    "gameID": 0,
    "author": "LionHeart897"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-09-23T00:00:00.000Z",
    "score": 8.5,
    "comments": "The Xbox 360 version of the hit game Minecraft offers the basic aspect of the PC version of the game... Fantastic!\nThe Xbox 360 version of the hit game Minecraft offers the basic aspect of the PC version of the game. This is one of the very early versions of Minecraft, so not having many many of the PC features that has made the game... ",
    "gameID": 0,
    "author": "smoothpeach"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-10-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best PC games!\nI first heard about this game from a friend and decided to try it out. I was amazed at how simple this game was but highly addictive. I could not stop playing it for days. I would do double all-nighters because of its ad... ",
    "gameID": 0,
    "author": "senor305"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-10-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Minecraft Is made entirely out of blocks. Sounds boring dosen\u0027t it? Huh? Even so, you can build anything....No, really..\nYes, It doesn\u0027t exactly have realistic, graphics, again, it\u0027s made of blocks. So it is in my top 10 games, but really, building anything you want is quite boring. So then you have survival mode, so you start out with a h... ",
    "gameID": 0,
    "author": "deactivated-5e2d6e357a73b"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-10-03T00:00:00.000Z",
    "score": 8.5,
    "comments": "A Minecraft Not Yet Hatched\nI just started following minecraft a few months ago but couldnt get the pc version so when i heard that an xbox live version came out i bought it.....twice. Already knowing everything about it i started the first day. Th... ",
    "gameID": 0,
    "author": "Ogorham"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2012-10-05T00:00:00.000Z",
    "score": 7.0,
    "comments": "this game are amazy and i love the high graphics for this game\nthis game are amazy and i love the high graphics for this game this game are amazy and i love the high graphics for this game this game are amazy and i love the high graphics for this game this ga... ",
    "gameID": 0,
    "author": "mahdig"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-10-09T00:00:00.000Z",
    "score": 8.5,
    "comments": "This is the kind of game you will think is silly or stupid then it just grabs you and makes you like it out of no where.\nThis is one of the games I have spent over 40 hours playing the game. At first I thought it was a stupid game and was just plain silly to place blocks and mine just to make a proper shelter to survive. I then tried it ou... ",
    "gameID": 0,
    "author": "iMoDxGoDz"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-10-11T00:00:00.000Z",
    "score": 7.5,
    "comments": "The popular PC sandbox brought to the Xbox 360, and with a couple new features\nMinecraft 360 Edition has pretty much everything you\u0027d expect it to, but with a bit more. However, it also has a bit less. For example the version of the game started with Beta 1.6 while the PC version was already on 1.... ",
    "gameID": 0,
    "author": "Flanns2"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-10-29T00:00:00.000Z",
    "score": 8.5,
    "comments": "Simple, Fun and a addictive little fun game, Made out of blocks!\nMinecraft is a great indie building/survival game, The basic aim to the game is to stay alive, make a house and mine! You can go mining for ores or you can enjoy the view you get with this game because even though the gr... ",
    "gameID": 0,
    "author": "georgecooldevil"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-11-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "This. Game. Is. Amazing.\nThis is possibly one of the best games I have ever played. The possibilities are endless and the community is great. Although on the outside, it may just seem like a bunch of blocks, however when you get into the game ... ",
    "gameID": 0,
    "author": "towny_"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-11-10T00:00:00.000Z",
    "score": 9.0,
    "comments": "WOW.\nThis game is awesome. Although, they do not have enchanting and will not for a long, long, long, long, long, long, long, long, long, long, long, long, long, long, long, long, long, long, long, long, long time. just get i... ",
    "gameID": 0,
    "author": "awesombobbyy"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-11-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "Incredibly addicting\nI got minecraft over 2 years ago and it is still my favorite computer game to date. This game takes place in a post-end of the world scenario, where the main goal is just to survive and eventually to thrive on the lands... ",
    "gameID": 0,
    "author": "old_moocow"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-11-22T00:00:00.000Z",
    "score": 8.0,
    "comments": "Who knew something so simple could be so addictive?\nWho knew something so simple could be so addictive? I\u0027ve been waiting a long time to review Minecraft, and I think it\u0027s about time I do. STORY: What story? There is none. lol. Not really a problem, though, because I ... ",
    "gameID": 0,
    "author": "deactivated-5afd249fa1fcb"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-11-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "fun for people who have a creative mind and like to build\nvery addicting for most people. the game includes a single player a multi player and a tutorial in which you could learn the ropes. it also includes achievements for the achievement hunters.over all the game is just fun ... ",
    "gameID": 0,
    "author": "Tiger1489"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-11-24T00:00:00.000Z",
    "score": 9.5,
    "comments": "The absolute best in world creation/simulation, to date. No other game offers so much, even after 1,000 hours.\nMinecraft is more than you can ever describe. The simple premise of the game is this: Here is a world. Explore it, create it, destroy it. It\u0027s yours. You must craft your items from the natural resources around ... ",
    "gameID": 0,
    "author": "Hemilash"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-11-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "A corner stone of Indy development, a groundbreaking sandbox game, revolutionized the genre and defined Indy.\nMinecraft for the PC, a revolution in gaming. A corner stone of Indy development, a groundbreaking sandbox game, revolutionized the genre and defined Indy. If you don\u0027t have Minecraft, it is mandatory if you own a ... ",
    "gameID": 0,
    "author": "Compu_Serv"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-12-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "Great, amazing game with more updates on the way and so that is why i give it 10 score rating! Highly Addictive and fun!\nWhere to begin?! Yes Minecraft Xbox 360 Edition might not be the PC version but that doesn\u0027t mean that future updates will give us all what the PC version has. Yeah i might have just became a minecrafter and i won\u0027t pret... ",
    "gameID": 0,
    "author": "9tailedfox_A"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-12-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "Out of all the games I have played in 30 years,for me, no other game comes close to the immersive feeling of Minecraft!\nMINECRAFT (PC) has to be one of the most brilliant games ever created. My daughter and I have spent more time on Minecraft than all of my other games combined... and that\u0027s alot! Anyone who enjoys Legos or creating obje... ",
    "gameID": 0,
    "author": "contemplatelife"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-12-29T00:00:00.000Z",
    "score": 9.5,
    "comments": "Minecraft: Xbox 360 Edition Review\nMinecraft is a highly addictive game with literally millions of things to do. With so many options and freedom, Minecraft will never bore you out. This game is definitely the best Xbox Arcade game ever. Making a Xbox 360... ",
    "gameID": 0,
    "author": "BLASTER10169"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-12-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "I loved it from the first time i played it!Just great ;)\nI\u0027ve been playing Minecraft for 5 years and still it doesn\u0027t bore me at all.It\u0027s an open world game and you can build everything you want,even circles!Yep,that\u0027s true. Many kind of gaming players and YouTubers started pl... ",
    "gameID": 0,
    "author": "giofighter"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-01-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Minecraft has limitless possibilities, a striving community, a sense of challenge and immersion and frequent updates.\nI heard of Minecraft from the internet back during its Alpha days and the Halloween update. As soon as I heard of it, I watched the trailer made by Vareide and was astounded with the building and the exploration shown. I... ",
    "gameID": 0,
    "author": "UncookedMoa"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-01-03T00:00:00.000Z",
    "score": 9.5,
    "comments": "More than just a game, Minecraft is a blank canvas for creators and adventurers alike.\nPlaying Minecraft for the first time is hard to describe. You appear in a world made entirely of blocks, generated at random. Once you learn that left-click is dig and right-click is place, and your inventory is on the E... ",
    "gameID": 0,
    "author": "ub3rl33t23"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-01-04T00:00:00.000Z",
    "score": 9.5,
    "comments": "Minecraft never ceases to amaze after being \"officially\" released for a year and a half\nFirst things first, Minecraft is a beautiful game full of beautiful things all around. The word beautiful comes from the feeling of beauty that you get when certain events in the game occur. Yes the whole world is blo... ",
    "gameID": 0,
    "author": "Rednrol"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-01-08T00:00:00.000Z",
    "score": 8.5,
    "comments": "Minecraft, a game thats not exactly easy to review outright but that comes close to meeting up to the fun had on pc\nThe biggest problem about writing a review for Minecraft is that it\u0027s impossible to write a review for Minecraft because you\u0027re too busy playing it to find the time. For newcomers, Minecraft can look overtly simple; a... ",
    "gameID": 0,
    "author": "contentxcontext"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-01-08T00:00:00.000Z",
    "score": 8.5,
    "comments": "MineCraft xbox 360 edition new updates make the blocky adventure survival game even better!\nMineCraft xbox 360 edition was released back in May 27th 2012. It was very basic back then and did become boring and dull quite quick, knowing that the PC version had more to it. But now 4J studios has released more upda... ",
    "gameID": 0,
    "author": "jakecoe"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-01-11T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft: Xbox 360 Edition is obviously way behind it\u0027s PC predecessor, but it is still a damn good port.\nIf you haven\u0027t heard of Minecraft yet, bless your soul. For others looking to finally get into the game but don\u0027t have a gaming PC; look no more! Minecraft: 360 is a fantastic port to the acclaimed PC game. With Minec... ",
    "gameID": 0,
    "author": "OneSamTwoCups"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-01-14T00:00:00.000Z",
    "score": 8.0,
    "comments": "Minecraft is a sandbox building-anything game. It\u0027s the ultimate Lego game, each block has different purposes.\nMinecraft is a great retro sandbox game. It has so much potential, the updates are free, and the community is massive. Minecraft doesn\u0027t have a story, you create your own. You craft practically everything. But watch ... ",
    "gameID": 0,
    "author": "MariJoe007"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-01-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "One Story About A Guy Find An Awesome Game Called Minecraft.\nI had never heard of minecraft until it came to the xbox, and my first thoughts of the game were it looks boring and the graphics look old. So I didn\u0027t even bother downloading the demo. Later that month I was on Rooster ... ",
    "gameID": 0,
    "author": "FTG_Swagger"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-01-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "Minecraft is an awesome game where it let\u0027s your imagination go in the game!You can build anything you want and share it\nThe graphics are good, crafting and mining and fighting the evils of the dark. Anything you would imagine can be built in the game, let your imagination go wild and build you favorite house or an underground base after g... ",
    "gameID": 0,
    "author": "Deltaraven8700"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-01-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "It is very rare that I give a perfect 10 to any game but in this case it well earned.\nIt is very rare that I give a perfect 10 to any game but in this case it well earned. I have been playing this game since the first beta tests and I honestly can\u0027t find anything wrong with it. It is the perfect sandbox g... ",
    "gameID": 0,
    "author": "jthunder2525"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-01-23T00:00:00.000Z",
    "score": 8.5,
    "comments": "Minecraft is an overall great game. Yes, it is behind PC but it is still fun. Co-Op makes the experience even better!\nMinecraft is an amazing game. After its appearance to the Xbox on May 9th, it has sold so much. The game is fun for everyone of any age, even though it says 10+, but that\u0027s because of the \"violence.\" It is a great family... ",
    "gameID": 0,
    "author": "MellowedLemon"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-02-04T00:00:00.000Z",
    "score": 7.5,
    "comments": "A 7.5 by the idea that game sold.\nI played for a long time, but over time, after conquering almost all the achievements I got bored. The game is good to be entertained for a while, but as time goes by you become aimless, perhaps in Nether building th... ",
    "gameID": 0,
    "author": "Mjcrbtcheckout"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-02-14T00:00:00.000Z",
    "score": 8.0,
    "comments": "Minecraft on 360 isn\u0027t the huge playground that PC owners know and love, but it still captures the magic of the series.\nWhen Markus Persson took the name \"Notch\" and developed the budding version of a blocky exploration-based game called Minecraft, the indie game had a bit of a negative and underdeveloped connotation to it. It wasn\u0027t unti... ",
    "gameID": 0,
    "author": "AK_the_Twilight"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-02-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "I Think its one of the funniest games i\u0027ve played with my friends. I\u0027m Actually playing it right now. I just love it.\nI\u0027ts all about what you want or not want to do in minecraft. Use your imagination, then is your best tool for build anything. I\u0027ts all about play with your friends, survival modded, pvp modded. Anything is possible if yo... ",
    "gameID": 0,
    "author": "MarioCandia"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2013-02-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best games of all time.\nI have played countless hours of this game. Very good game. Graphics: 10/10 I know the graphics are pixelated,but it looks very nice to me Sound 10/10 Very good sound,music etc Gameplay 10/10 Very nice ga... ",
    "gameID": 0,
    "author": "Dawgsays"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-03-05T00:00:00.000Z",
    "score": 8.0,
    "comments": "It\u0027s such a simple principle, but it contains so much possibilities.\nTo start of, I can\u0027t explain my opinion, I can only describe my experience. That\u0027s because this game is filled with endless possibilities and ideas but I couldn\u0027t have found them all. One could become a invincible diamon... ",
    "gameID": 0,
    "author": "c3on3"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-03-12T00:00:00.000Z",
    "score": 7.0,
    "comments": "It\u0027s a meh game. The PC Version is superior in almost every way, and only slightly higher priced.\nNow, don\u0027t take me as a PC Elitist. I play Console and PC games alike, but believe me when I say the PC Version of Minecraft far outclasses this console port. Sure, it can serve as a decent stand-in for Minecraft if your... ",
    "gameID": 0,
    "author": "JackS22587"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-03-24T00:00:00.000Z",
    "score": 9.5,
    "comments": "Minecraft is what you make it to be.\nAmazing. Minecraft is a game not to be spoken through words, but through playing it. It is one of the greatest video games of all time and has stood the test of time as the game that stepped up in the world of repetitive... ",
    "gameID": 0,
    "author": "TheWildScotsmen"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-05-21T00:00:00.000Z",
    "score": 9.5,
    "comments": "Minecraft / Rooster Teeth bridging the generations\nThe game\u0027s amazing, the Let\u0027s Play\u0027s are fun to watch, \u0026 Burnie, Gus, Gavin, Michael and the rest of Rooster Teeth crew are AMAZING and hilarious to listen to/watch! I mean, the Minecraft experience has it all. My so... ",
    "gameID": 0,
    "author": "littleadsmom"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2013-06-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "So much better than the PC\nThis game is everything you could want in a game. The reason I\u0027m saying this is better than the PC is because it has a smaller map so it is less confusing. It doesn\u0027t have the weird cave music when you find the cave or d... ",
    "gameID": 0,
    "author": "sonicfreak375"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2013-06-17T00:00:00.000Z",
    "score": 7.0,
    "comments": "Minecraft is a Breath of Fresh Chest Hair\nFor those of you under the age of twenty-two, you\u0027ll be surprised at which of your old buddies you\u0027re still friends with as time goes on. Most of them will be gone like the wind by the time your twenty-four, beginning t... ",
    "gameID": 0,
    "author": "Rotondi"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-06-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "Great game, wish I had more time to spend playing it!\nThis game will cause you to imerse yourself in the time-consuming world of blocks! You can change the world around you to fit your desires, however, unless you are out of school, dan\u0027t have to work because you\u0027re rich, a... ",
    "gameID": 0,
    "author": "Zuriah7"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-06-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "I cant believe this they just make it even better with updates. You can play in survival or creative either way (great).\nI cant believe this they just make it even better with updates. You can play in survival or creative either way it is awesome in creative and survival you can make awesome builds, and traps such as: redstone contraption,... ",
    "gameID": 0,
    "author": "benocurtapps"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-07-06T00:00:00.000Z",
    "score": 8.5,
    "comments": "I\u0027m glad I decided to try this game!\nMinecraft has made its way to the Xbox 360, and it is a great addition to any collection. Basically, you can do whatever you want in Minecraft. You can build almost anything, you can fight various enemies like zombies, o... ",
    "gameID": 0,
    "author": "phillyeagles123"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2013-07-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "DAMNED ENDIES!\nStory : Not much, this is an indie game after all. You just spawn on an island and find supplies. I\u0027ll let this slip by because honestly, indie games don\u0027t need stories. Gameplay : Addictive. I...just don\u0027t know how t... ",
    "gameID": 0,
    "author": "Shadowblade2584"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-08-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "A very good game. Minecraft is the best game i have ever played. That why im giving it a 10. PS. I\nA very well done super game. I have it for PC - MAC, iDevice and Xbox 360. Cant wait to Xbox ONE. It is a nr 1 game of the world. Everyone need to buy it. That is why i give it a 10. PS. I love the Creepers !!!... ",
    "gameID": 0,
    "author": "Footballer74123"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-08-09T00:00:00.000Z",
    "score": 9.0,
    "comments": "Your imagination is the limit.\nMinecraft:Xbox 360 Edition offers to the players the ability to construct anything,limited only by their imagination.It also offers the ability to explore a limited map(that will be updated to be unlimited in the distant... ",
    "gameID": 0,
    "author": "demian742"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-09-08T00:00:00.000Z",
    "score": 8.5,
    "comments": "Variety, Variety, Variety!\nIf you have any sort of imagination, then you can make this game into what you want it to be. Whatever you can think up, you can probably do it. This is the game for the creative, for the imaginative, and for those who... ",
    "gameID": 0,
    "author": "GTX-Gamer"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-10-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Buy Or Die?: Minecraft\nSo, This is buy or die. I tell if you should buy it or let it burn! I\u0027m starting with Minecraft. That\u0027s right. About: Minecraft is a block placing, imagining, experience. You create your own skins, servers, etc. This ... ",
    "gameID": 0,
    "author": "mike221"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2013-10-11T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft\nMinecraft is an Indie game made by Mojang. This is my favorite game ever made. I still give this a 9.5. PositivesSandbox.Has both a survival, c... ",
    "gameID": 0,
    "author": "unicorn_trousers"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-12-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "Microsoft acknowledges Xbox One\u0027s faulty disc drive issue\nIt\u0026rsquo;s just been a few days since the Xbox One\u0027s launch and already gamers are experiencing issues with the console.news Sources Xbox OneSome users are reportedly facing problems with their console\u0027s disc drive.The ... ",
    "gameID": 0,
    "author": "robinsonmasih35"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-03-18T00:00:00.000Z",
    "score": 8.0,
    "comments": "Rolling Stones axe Perth concert after death\nRolling Stones axe Perth concert after deathThe Rolling Stones have cancelled an imminent concert in Australia following the death of designer L\u0027Wren Scott,the girlfriend of lead singer Sir Mick Jagger.[url\u003dhttps://driv... ",
    "gameID": 0,
    "author": "kurtruss6"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-03-18T00:00:00.000Z",
    "score": 8.0,
    "comments": "Rolling Stones axe Perth concert after death\nRolling Stones axe Perth concert after deathThe Rolling Stones have cancelled an imminent concert in Australia following the death of designer L\u0027Wren Scott,the girlfriend of lead singer Sir Mick Jagger.[url\u003dhttps://driv... ",
    "gameID": 0,
    "author": "kurtruss6"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2014-05-21T00:00:00.000Z",
    "score": 7.0,
    "comments": "It\u0027s fun and imaginative\nMinecraft is one of the most innovative games of the past decade. But it does get boring after a while of screwing around in it, and if you have next to no talent for building things in the game itself.The bad. Of cours... ",
    "gameID": 0,
    "author": "gbeavs"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-08-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Tons Of Content\nThis game may not be for people who are all about the graphics and action, but even those people might take a liking in this game. A lot of amazing games with wonderful graphics and action, lack content. Such as possibl... ",
    "gameID": 0,
    "author": "maggielegrissom"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-09-06T00:00:00.000Z",
    "score": 9.0,
    "comments": "Better Than Expected\nI was on the fence with this one to be honest. I was thinking really? the graphics are horrible! there is no way this would be my type of game....pfft no way not me! I\u0027ve been told I\u0027m not a gamer because I play Call ... ",
    "gameID": 0,
    "author": "lattimer22"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-09-08T00:00:00.000Z",
    "score": 9.0,
    "comments": "Why should you pay for MineCraft Again??\nMineCraft finally to next gen Consoles yes I have paid for it yet again and let me tell you I am not disappointed, so far best five bucks iv spent this year. I am so happy to have all my saves/worlds from my Ps3 on my Ps... ",
    "gameID": 0,
    "author": "0logic"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-09-09T00:00:00.000Z",
    "score": 8.0,
    "comments": "Minecraft w/ PS3.\nI simply try the game demo simply \"brill but blocky\" one hand that the game delivers more what i want. the other hand not compare to original. unless you need the gaming PC/MAC. my my first try was on the PlayStation 3.... ",
    "gameID": 0,
    "author": "jrc126-1"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2015-02-07T00:00:00.000Z",
    "score": 8.0,
    "comments": "better since the update\nBefore the update on Minecraft, (1.6) it used to be an average game. The sort of game I would play once a week. before Microsoft bought Mojang, it was bad. we kept getting promised horses and hay bales but every time an ... ",
    "gameID": 0,
    "author": "saint440"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2016-01-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "A Perfect World\nImagine a place full of infinite adventures. You can climb the tallest mountains, sail across the ocean, and build your dream house. Its all possible in the world of Minecraft. In Minecraft there are no objectives, ever... ",
    "gameID": 0,
    "author": "bumblebug"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2016-02-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "I love this game!\nminecraft is an awesome game which is made out of blocks that you can make anything with!you can build anything you would like you can kill mobs such as zombies , skeltens , slimes , zombie pigman , creepers ,magma cubes... ",
    "gameID": 0,
    "author": "cutenajo"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2016-07-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "A Unique Game\nI have to say I took some time to take interest for this game, but I\u0027m glad I did. It seemed ugly and for children, than I started playing and for a month I would do nothing else in my life. This game is unique, and alt... ",
    "gameID": 0,
    "author": "DeyvsonMC"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2016-10-09T00:00:00.000Z",
    "score": 8.0,
    "comments": "Minecraft: Simple, Retro, and Fun\nMinecraft was one of the big games that helped me get beck into gaming. It\u0027s really simple: punch a tree, build a house, survive.The multiplayer is really fun. Mineplex, the Hive, and others. At least I don\u0027t have pay fo... ",
    "gameID": 0,
    "author": "thespiderreview"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2017-11-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "Simple And Fun\nMinecraft is a calming game that is fun for all ages. The survival mode of the game can be set to difficulty that is appropriate for you. The part i appreciate the most about the game is its creative mode. Creative mode... ",
    "gameID": 0,
    "author": "bitgamingduo"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2017-12-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "More updates please\nIt would be great to add even more features in the game.i know there are still some monsters,NPC\u0027s and items and so as objects you can possibly add notch.Try to add more machines in the game as well.But if you can no lon... ",
    "gameID": 0,
    "author": "carvgameradict"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-02-05T00:00:00.000Z",
    "score": 8.0,
    "comments": "pretty good\nto me i like it nice graphics and nice platform game but their is so glitchy and it needs updates to me i loves this game but sometimes get old but but not just that a pretty good game. and this game grew big i love this... ",
    "gameID": 0,
    "author": "hurtrobert"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-03-16T00:00:00.000Z",
    "score": 1.0,
    "comments": "Review this game is a head problem,\nfirst of all say that it is a title without the most sense.It is not known if this is for children, or for adults with a childhood deficiency.The graphics are obviously a disaster, the plot does not have it; and here is... ",
    "gameID": 0,
    "author": "totto210"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-04-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "Minecraft: Xbox One Edition further improves the Minecraft console series!\nThis version of the game takes advantage of the Xbox One\u0027s higher specs, and it proves useful! This game is like the Xbox 360 version, but with tons of improvements, and controlled with a better controller! I highly rec... ",
    "gameID": 0,
    "author": "platinumpluto"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-08-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is the BEST game, I have ever played!!!\nMinecraft, A game filled with curiosity and pleasure. This game is an art which has intensely attracted many gamers throughout the world because of its uniqueness. It has a good game-play and relaxing music which could ... ",
    "gameID": 0,
    "author": "uzair455"
  }
]
