[
  {
    "source": "",
    "date": "2011-05-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is about as good as an indie game can get. Treat yourself. [June 2011, p.60]",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "http://www.eurogamer.net/articles/2011-11-18-minecraft-review",
    "date": "2011-11-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "Minecraft is a towering achievement in the very possibilities of gaming, and it does this without losing itself to either esoterica or cynicism. It is a game anyone can play and anyone can get something out of, no matter how skilled or imaginative they are. They will make something and they will have an experience that feels like theirs and theirs alone.",
    "gameID": 0,
    "author": "Eurogamer"
  },
  {
    "source": "http://www.gamer.nl/review/173667/minecraft",
    "date": "2011-11-18T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft may not look the part, but what it lacks in fancy bells and whisles, it more than makes up for through sheer depth. Creative players can spend countless hours building, while real adventurers will go on to explore the game world. And best of all, thanks to numerous updates it gets even bigger and better.",
    "gameID": 0,
    "author": "Gamer.nl"
  },
  {
    "source": "http://www.meristation.com/v3/des_analisis.php?pic\u003dPC\u0026idj\u003dcw4ccbf0ddc9ce4\u0026id\u003dcw4ec5873bc6c7d",
    "date": "2011-11-18T00:00:00.000Z",
    "score": 9.0,
    "comments": "What more can we say of a game we have been playing and talking about for months? Minecraft is a triumph fueled by imagination and a great community. Sometimes it\u0027s frustrating how much it could offer, but that\u0027s because it offers a lot already and there is always a hunger for more with such an unlimited approach. With four million of users already, saying \"buy it\" seems unnecesary, but just in case, do it.",
    "gameID": 0,
    "author": "Meristation"
  },
  {
    "source": "http://www.gamepro.com/article/reviews/225117/review-minecraft-pc/",
    "date": "2011-11-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "Admittedly, critiquing Minecraft\u0027s ready-made dungeons and NPC villages is a bit like complaining about the beans served alongside an immaculate five-star steak. Sure, the side-servings might be mediocre, but at its core Minecraft is one of the most forward-thinking games ever created. It spits in the face of the conventional games industry, and it\u0027s raked in millions of dollars while doing so",
    "gameID": 0,
    "author": "GamePro"
  },
  {
    "source": "http://www.1up.com/reviews/minecraft-pc",
    "date": "2011-11-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "Meanwhile, Minecraft, with all its flaws and quirks, has already joined Super Mario Brothers, Wolfenstein 3D, and Tetris in the pantheon of games that prototyped an entire genre.",
    "gameID": 0,
    "author": "1UP"
  },
  {
    "source": "http://www.cheatcc.com/pc/rev/minecraftreview.html",
    "date": "2011-11-21T00:00:00.000Z",
    "score": 9.6,
    "comments": "Minecraft is so much more than a game by now; it\u0027s a potentially generation-defining phenomenon.",
    "gameID": 0,
    "author": "Cheat Code Central"
  },
  {
    "source": "http://pc.gamespy.com/pc/minecraft/1213179p1.html",
    "date": "2011-11-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "Minecraft is what you make of it, and that makes it pretty damn special.",
    "gameID": 0,
    "author": "GameSpy"
  },
  {
    "source": "http://www.gameinformer.com/games/minecraft/b/pc/archive/2011/11/22/review.aspx",
    "date": "2011-11-22T00:00:00.000Z",
    "score": 9.3,
    "comments": "While the toybox/platform side of Minecraft is incredible, the \"game\" side of it is lacking.",
    "gameID": 0,
    "author": "Game Informer"
  },
  {
    "source": "http://multiplayer.it/recensioni/95964-minecraft-sopravvivere-a-minecraft.html",
    "date": "2011-11-23T00:00:00.000Z",
    "score": 9.6,
    "comments": "Minecraft is a masterpiece, a seminal title which will be played and studied for years.",
    "gameID": 0,
    "author": "Multiplayer.it"
  },
  {
    "source": "http://pc.ign.com/articles/121/1213266p1.html",
    "date": "2011-11-23T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft, more than any other game I know, isn\u0027t about playing it a specific way; it\u0027s an open-world, a blank page just daring you to jump in and do with it what you will.",
    "gameID": 0,
    "author": "IGN"
  },
  {
    "source": "http://www.bit-tech.net/gaming/pc/2011/11/24/minecraft-review/1",
    "date": "2011-11-24T00:00:00.000Z",
    "score": 9.0,
    "comments": "Happiness and distraction; that\u0027s what gaming is all about really and it\u0027s something that Minecraft, for all its abstractions and division, delivers in spades. You can build cathedrals with your friends; create macro-scale machines on your own or simply drift, floating through impossible landscapes that can bend to your will - do anything you want! That alone gives Minecraft a little bit of magic.",
    "gameID": 0,
    "author": "Bit-Gamer"
  },
  {
    "source": "http://www.3djuegos.com/juegos/analisis/10445/0/minecraft/",
    "date": "2011-11-25T00:00:00.000Z",
    "score": 9.1,
    "comments": "Minecraft is a masterpiece. A game that you must try.",
    "gameID": 0,
    "author": "3DJuegos"
  },
  {
    "source": "http://www.everyeye.it/pc/articoli/minecraft_recensione_15489",
    "date": "2011-11-25T00:00:00.000Z",
    "score": 9.0,
    "comments": "A revolutionary game developed on a brilliant idea, Minecraft is a sandbox made on exploration and construction, a fresh and rewarding experience for every kind of gamer.",
    "gameID": 0,
    "author": "Everyeye.it"
  },
  {
    "source": "http://www.next-gen.biz/reviews/minecraft-review",
    "date": "2011-11-28T00:00:00.000Z",
    "score": 9.0,
    "comments": "The central achievement of Minecraft is a willingness to let the player define the experience; to make them the most interesting element in a world that\u0027s already dynamic and fascinating. It\u0027s a decision that has made designer Markus Persson a millionaire, and it\u0027s ensured that the most important PC game of the past five years is also the most timely.",
    "gameID": 0,
    "author": "Edge Magazine"
  },
  {
    "source": "http://www.gameplanet.co.nz/pc/games/177682.Minecraft/reviews/138277.Minecraft/",
    "date": "2011-11-29T00:00:00.000Z",
    "score": 9.5,
    "comments": "For anyone looking for the ultimate in expression and aesthetic satisfaction, or merely searching for a game that will virtually limitless exploration and achievement, Minecraft offers it all.",
    "gameID": 0,
    "author": "Gameplanet"
  },
  {
    "source": "http://www.gamespot.com/minecraft/reviews/minecraft-review-6346734?tag\u003dgames%3Bgame_title%3B2",
    "date": "2011-11-29T00:00:00.000Z",
    "score": 8.5,
    "comments": "Minecraft has been a work in progress throughout its lengthy public beta, and the \"official release\" still has an unfinished feel to it in spots that won\u0027t sit well with everyone. Visual glitches pop in at regular intervals, and some game elements seem incomplete or thrown together in haste. What\u0027s amazing is that the core game is so ridiculously absorbing that these flaws matter little in the grand scheme of things.",
    "gameID": 0,
    "author": "GameSpot"
  },
  {
    "source": "http://www.vandal.net/analisis/pc/minecraft/13803",
    "date": "2011-12-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft is one of those games that everyone must try. You can stop playing for a month and return, to discover how many new features there are for us to try. A game that makes you feel like a child again, and one of the most remarkable ones in the last few years.",
    "gameID": 0,
    "author": "Vandal"
  },
  {
    "source": "http://www.gamereactor.se/recensioner/30044/Minecraft/",
    "date": "2011-12-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "A sensation, and rightly so. This is a game that makes you both happy and creative.",
    "gameID": 0,
    "author": "Gamereactor Sweden"
  },
  {
    "source": "http://www.gry-online.pl/S020.asp?ID\u003d7902",
    "date": "2011-12-05T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft is not a game, it\u0027s a complicated tool, a true phenomenon that sneaked into our culture and gained nothing short of a cult following. It\u0027s a creation of the decade, a game that will be remembered the same way we remember the classics that never get old. Yes, it requires a different approach -for example, when you define your next goal, but it can absorb you totally and deliver an unforgettable experience.",
    "gameID": 0,
    "author": "GRYOnline.pl"
  },
  {
    "source": "http://www.gametrailers.com/gamereview.php?id\u003d14548",
    "date": "2011-12-08T00:00:00.000Z",
    "score": 9.0,
    "comments": "In the end, Minecraft is what you make of it, and that\u0027s the beauty of the game. Whether you want to spend hours at a time experimenting with digital Lego or playing a hack-and-slash version of Wolfenstein 3D, Mojang\u0027s unique achievement allows you to do either and more. While it still has some pixilated edges that leave it feeling unfinished, few games in recent years have done so well with such a promising concept and offered so many opportunities for true exploration.",
    "gameID": 0,
    "author": "GameTrailers"
  },
  {
    "source": "",
    "date": "2011-12-09T00:00:00.000Z",
    "score": 9.1,
    "comments": "It is too big to called mere a game. Minecraft is a unique phenomenon. [Dec 2011]",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "http://www.telegraph.co.uk/technology/news/8955374/Minecraft-review.html",
    "date": "2011-12-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "Minecraft is by far one of the most fascinating and progressive games ever made, both in terms of its leanings towards procedural generation and emergent gameplay, and the way it has been so openly developed. In an era where the development of most games is a closely-guarded, PR-managed secret, millions were invited to buy and play Minecraft years before it was even finished.",
    "gameID": 0,
    "author": "Telegraph"
  },
  {
    "source": "http://www.gamesradar.com/minecraft-review/",
    "date": "2011-12-15T00:00:00.000Z",
    "score": 9.0,
    "comments": "Now that it\u0027s finally \"finished,\" Minecraft stands as a remarkable achievement - not only a well-rounded gaming experience, but a chance for players to experiment, explore freely and reshape their environment to an almost ludicrous level. If you own a computer and haven\u0027t given Minecraft a try, you\u0027re missing one of the most unique experiences of this generation.",
    "gameID": 0,
    "author": "GamesRadar+"
  },
  {
    "source": "http://www.gameover.gr/pc/reviews/Minecraft.18189.html",
    "date": "2011-12-22T00:00:00.000Z",
    "score": 9.5,
    "comments": "Minecraft is, in the end, less of a game and more of a toybox, where everyone can shape their own experience. Itʼs one of the most important creations in videogames, and its influence will lead to exciting new ways for us to perceive digital worlds and their potential.",
    "gameID": 0,
    "author": "GameOver.gr"
  },
  {
    "source": "http://www.pcgamer.com/review/minecraft-review/",
    "date": "2011-12-25T00:00:00.000Z",
    "score": 9.6,
    "comments": "Intuitively interesting and contagiously fun, with an unparalleled scope for creativity and memorable experiences.",
    "gameID": 0,
    "author": "PC Gamer"
  },
  {
    "source": "",
    "date": "2011-12-27T00:00:00.000Z",
    "score": 9.0,
    "comments": "Minecraft is a means of living your personalised adventures and gathering your own unique experiences. It takes up just a tiny bit of your hard drive space but is a phenomenon too big to cover entirely in a review. [January 2012, p.42]",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "http://www.computerandvideogames.com/331531/reviews/minecraft-review/",
    "date": "2012-01-12T00:00:00.000Z",
    "score": 9.1,
    "comments": "Big, beautiful, and without limits, Minecraft is the box of blocks you never have to tidy up. [Feb 2012, p.79]",
    "gameID": 0,
    "author": "Games Master UK"
  },
  {
    "source": "http://www.eurogamer.de/articles/2011-12-02-minecraft-test",
    "date": "2012-01-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "Games like Skyrim or GTA love talk about open worlds, but it seems, that so far only Minecraft has truly embraced this principle. (…) This here is your story, that you simultaneously write and experience. All at your own pace.",
    "gameID": 0,
    "author": "Eurogamer Germany"
  },
  {
    "source": "http://www.escapistmagazine.com/articles/view/editorials/reviews/9362-Minecraft-Review",
    "date": "2012-01-24T00:00:00.000Z",
    "score": 9.0,
    "comments": "There really isn\u0027t that much on the market today that\u0027s like Minecraft, an open sandbox for you to play and build in. This simple freedom can lead to some truly complex accomplishments.",
    "gameID": 0,
    "author": "The Escapist"
  },
  {
    "source": "",
    "date": "2012-01-29T00:00:00.000Z",
    "score": 8.0,
    "comments": "A must-play title - as much a part of videogaming as it is anything else. [Issue#118, p.102]",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "http://www.actiontrip.com/reviews/minecraft.phtml",
    "date": "2012-01-30T00:00:00.000Z",
    "score": 9.2,
    "comments": "While Minecraft may not be everybody\u0027s cup of tea, I doubt anyone can deny that it\u0027s an important step into new territory.",
    "gameID": 0,
    "author": "ActionTrip"
  },
  {
    "source": "http://www.gamer.no/artikler/101765/anmeldelse-minecraft/",
    "date": "2012-02-06T00:00:00.000Z",
    "score": 9.0,
    "comments": "The 1.0 version of the indie phenomena is still obviously unfinished and flawed in many ways, but it\u0027s so easy to forget that when you\u0027re building your dream castle, exploring scary caves and vast mountain ranges and having a great time in its blocky world.",
    "gameID": 0,
    "author": "Gamer.no"
  }
]
