[
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2003-04-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "\nThe game that evolutionized the PC game market. Half-Life is the known to be the best PC game EVER. With the hundreds of mods and expansions, Half-Life lives on. Half-Life has it all. The Best storyline, the best graphic... ",
    "gameID": 0,
    "author": "MrPolitics"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2003-09-14T00:00:00.000Z",
    "score": 9.7,
    "comments": "\nTHIS GAME KICKZ ARSE!!! EVERYONE GET IT NOW. IF YOU HAVE JUST HEARD OF IT, YOU MUST EITHER BE A NEWBIE OR SOMEONE THAT JUST DOESNT PLAY VIDEOGAMES. OK TO THE REVIEW.... The gameplay for this game is awesom... ",
    "gameID": 0,
    "author": "Hunk4thSurvivor"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2003-10-12T00:00:00.000Z",
    "score": 9.3,
    "comments": "\nHalf-Life has given us many mods to play with, such as Counter-Strike, Team Fortress Classic, and Firearms, and all of them are very good mods. But try to imagine...without Half-Life, none of those mods would even exist.... ",
    "gameID": 0,
    "author": "Visi0naries"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2003-10-15T00:00:00.000Z",
    "score": 8.4,
    "comments": "\nHalf-Life was released quite some time ago, and fans of the Half-Life game wanted an expansion pack of it. They finally got their wish when the release of Half-Life: Opposing Force went on shelves. This is where the fun ... ",
    "gameID": 0,
    "author": "Visi0naries"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2003-10-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "\nTHIS IS THEBEST GAME EVER!!It has been awarded over 50 publucations world wide.The bad news I don`t know how to activate multplayer mode and content control is on so I can`t do it,damn it!!Oh well I guess I will stick w... ",
    "gameID": 0,
    "author": "91sonicsKILLERS"
  },
  {
    "helpfulCount": 18,
    "helpfulScore": 1,
    "date": "2003-12-18T00:00:00.000Z",
    "score": 7.0,
    "comments": "\nHalf Life for the Playstation 2 just seems dated. Yes, its still a good game and all and with its multiplayer mode and decay mode, it makes the game worthy. Unfortunately I think that its weak and lacks a lot of a qualit... ",
    "gameID": 0,
    "author": "Hunk4thSurvivor"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 6,
    "date": "2004-05-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "\nThree words describe Half-Life, Best Game Ever! From the breathtaking start, to the very end Half-Life delivers an unmatched experience, beyond words. Game has everything, but in one department where it truly excels over... ",
    "gameID": 0,
    "author": "navahmed"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2004-07-06T00:00:00.000Z",
    "score": 9.4,
    "comments": "\nHalf-Life is a game that requires no introduction. For nearly six years now it has set the standard for FPS\u0027s and continues to lead to new breakthroughs in the genre. It\u0027s mod community has grown more than anyone could h... ",
    "gameID": 0,
    "author": "pyrids"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2004-07-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "\nHalf-Life redesigned the FPS to become a state of the art balls to the wall submergence into what it feels like to be stuck deep in an underground half destroyed inter-dimensionally altered secret government facility sur... ",
    "gameID": 0,
    "author": "drigam"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2004-07-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "\nI first played this game in its demo version back when I was in middle school. It simply blew me away and this game is what got me into the world of PC gaming and PC\u0027s in general for that matter. This game is the best fi... ",
    "gameID": 0,
    "author": "Smaqaho"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 1,
    "date": "2004-07-24T00:00:00.000Z",
    "score": 9.8,
    "comments": "\nFor its time, great use of its graphic engine, amazing atmosphere, great mix of indoor and outdoor levels. The varied enemies still beat what you fight in most games of this type today, including Far Cry. The single-pl... ",
    "gameID": 0,
    "author": "dryden555"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2004-08-05T00:00:00.000Z",
    "score": 9.6,
    "comments": "\nA step towards revolution in the first person shooter genre has never come as close as Half-Life. From the panic that is felt in the tightly calibrated intro to the mind bending confrontation with the mysterious G Man, i... ",
    "gameID": 0,
    "author": "Alec-Eiffel"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2004-08-18T00:00:00.000Z",
    "score": 8.8,
    "comments": "\nHalf Life what a game. Let\u0027s talk about the immersion factor, what game has been made in the last few years, that makes you feel like your right there in a lab experiment, that has gone terribly wrong. The telepotation t... ",
    "gameID": 0,
    "author": "MarsLander"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2004-08-24T00:00:00.000Z",
    "score": 9.8,
    "comments": "Possibly the best FPS ever\nWith the release of Half Life 2 nearing I thought I\u0027d attempt to write a short review of one of the best first person shooters ever. Its hard trying to describe why Half Life is so good, so long after you first played... ",
    "gameID": 0,
    "author": "Big-Dog"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2004-08-26T00:00:00.000Z",
    "score": 9.6,
    "comments": "This is why First person shooters were made...\nHalf-life is the ultimate PC FPS experience. Not only is it immersive, but the presentation, the style and solid gameplay all makes it a polished product. It\u0027s graphics (for that time) represented a convincing researc... ",
    "gameID": 0,
    "author": "IokesI"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2004-09-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "The biggest leap in gameplay the first-person shooter (FPS) genre has ever taken.\nHalf-Life is considered by many the biggest leap in gameplay the first-person shooter (FPS) genre has ever taken. Valve tweaked the typical FPS formula quite a bit to achieve a never-before-seen level of immersiveness in... ",
    "gameID": 0,
    "author": "martlume"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2004-09-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "I bought it the first time, i didnt even have to rent it first because i just loved it the first time i played it.\nExplanation of the game: Half life Opposing force is sort of missioned based, but not exactly, in this game you have to know where to go and how you have to go to achieve your purpose. The game starts off as a group of m... ",
    "gameID": 0,
    "author": "megazorro1615"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2004-10-25T00:00:00.000Z",
    "score": 9.0,
    "comments": "Creepy and Slick\nI didn\u0027t know what to think when I first tried this game. At the time this game came out, I only owned the SNES so I never had played any game that was scary and dark. There are definatly moments in the game that just b... ",
    "gameID": 0,
    "author": "Los9090"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 1,
    "date": "2004-10-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "Half Life is a must have game for any and all FPS fans. It\u0027s the best FPS title to be released so far. It\u0027s fun..\n.. addictive and has a fantastic story to boot. First off, the graphics in HL were, for it\u0027s time, absolutly gorgeous. The game and many of it\u0027s mods are still being widely played today, even though it\u0027s been out for ... ",
    "gameID": 0,
    "author": "Rattlesnake_8"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2004-11-03T00:00:00.000Z",
    "score": 9.0,
    "comments": "Now in the year 2004 a little outdated but it remains a great game and even addicted as the date of the realease - Ron\na few days ago I firstly played it until the end I’ve played it years ago but I’ve never finished the game until a week ago I started playing it again cause it fled that I have to finish this great game (difficultly leve... ",
    "gameID": 0,
    "author": "rkrukkert"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2004-11-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "Greatest FPS of all time (in 1998)\nFirst and foremost, i\u0027d like to say that i\u0027m reviewing this game from what i remember of my thoughts from the first time i played it, 6 years ago. Not my impressions from when i finished it half an hour ago. I had jus... ",
    "gameID": 0,
    "author": "Freddie9027361"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2004-11-18T00:00:00.000Z",
    "score": 9.3,
    "comments": "Even in 2004, this game shows why it has won numerous awards for game-of-the-year, even when ported to the PS2.\nIf you have never played this game before, you need to; whether it be on a PC or PS2. Let me first point out that I have played the PC version, and for a game made in \u002798, it was and is still one of the best first-perso... ",
    "gameID": 0,
    "author": "chzyAce"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2004-11-18T00:00:00.000Z",
    "score": 8.7,
    "comments": "One of the best expansions ever\nThis game gives you a glimpse of what the grunts had to go through whiule Gordon went through grunts and aliens alike. You play the role of Adrian Shephard, a marine that was sent to clean up the Black Mesa, to clean up ... ",
    "gameID": 0,
    "author": "youngbloodza"
  },
  {
    "helpfulCount": 52,
    "helpfulScore": 3,
    "date": "2004-11-20T00:00:00.000Z",
    "score": 5.8,
    "comments": "Half life review.\nHalf life revolutionary hardly this is one of those games that is so impressive in the first 10 minutes but fails to shine in most areas. considering i score this game so low im going to review this game a little simply.... ",
    "gameID": 0,
    "author": "Tatsumaruu"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2004-11-21T00:00:00.000Z",
    "score": 9.8,
    "comments": "This is hands-down the greatest First-Person Shooter game ever, with Half-Life 2 the only thing standing in the way.\n\"Good morning, and welcome to the Black Mesa Transit System...\" So everyone who hasn\u0027t played Half-Life is just saying \"What the heck is this game? And why does everyone think it\u0027s the greatest FPS ever?\" Well, there ... ",
    "gameID": 0,
    "author": "lilsharkhunter"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2004-11-23T00:00:00.000Z",
    "score": 9.2,
    "comments": "This game still amazing.\nI am writing this review after Halflife 2 has just come out even tho i have not played it yet. Well this game is amazing, its old but still never gets old because of the hundreds of mods on the interent for it. Thats wha... ",
    "gameID": 0,
    "author": "Bidybag"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2004-11-26T00:00:00.000Z",
    "score": 9.3,
    "comments": "Different to the other First person shooters that were around in it\u0027s time.\nHalf-Life is a revolutionary game. It had non stop game play till the finish, provided a good challange without getting the player too frustrated, and was pretty fun. The story is simple. A scientist named Gordan free... ",
    "gameID": 0,
    "author": "UltraGhost82"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2004-11-27T00:00:00.000Z",
    "score": 9.3,
    "comments": "opposing force is an example of what a mission pack should be, game developers should pay attention, that includes u id.\nive played many expansion packs and games over the years but never have seen an expansion better than most other games. opposing force (op force for short) is an expansion to do justice to the best game of all time. this... ",
    "gameID": 0,
    "author": "darth-revan"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2004-12-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Half life is one of those games that gets inside you and never quite gets out\nThe end of the 1990\u0027s has to be one of those benchmark eras\u0027s that will stand out in the history of gaming. Like the 1970\u0027s that introduced playing games on your television sets, the 90\u0027s had the elements of the internet... ",
    "gameID": 0,
    "author": "thegorum"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2004-12-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is an awesome that whoever play on pc should pick this one up .\nyou really have to think when you play this game. if yiou dont think you will not do good. its got really funny looking aliens too and its a l-o-n-g game it itook me forever to beat it this is a must have game. The cont... ",
    "gameID": 0,
    "author": "SQUILTHEONE"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2004-12-09T00:00:00.000Z",
    "score": 9.8,
    "comments": "An epic experience. This game redifines modern video gaming!\nThe scenario in this game is one of the best ever! This compelling story can compete with most of the top list movies out there. Besides that this game is ingenious. The gameplay is magical (yes magical that\u0027s the word!)... ",
    "gameID": 0,
    "author": "*DirtyHarry26"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 5,
    "date": "2004-12-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "Half-Life is Awesome!\nThis is my first review so I hope you like it. NOTE: I am writing this after I played and beat half-life 2, and a half-life 2 review will come soon. In 1998, a revolutionary game was created. It was called half-life.... ",
    "gameID": 0,
    "author": "bluejays580"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2004-12-17T00:00:00.000Z",
    "score": 9.4,
    "comments": "\"probably the best shooter ever\"\nIt is hard to refer to one particular aspect of Half-Life; in fact, every detail is done just well enough resulting in an amazing experience. Moreover, it is probably the best shooter ever. The graphics for its time we... ",
    "gameID": 0,
    "author": "squeekikleen"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2004-12-31T00:00:00.000Z",
    "score": 8.8,
    "comments": "\"Half-Life: Opposing Force is an exceptional expansion pack to an exceptional game.\"\nHalf-Life revolutionised FPS gaming with one of the best single-player experiences ever and amazing multiplayer components due to a solid mod community. Its expansion pack only reinforces Half-Life’s style of storytelli... ",
    "gameID": 0,
    "author": "squeekikleen"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-01-11T00:00:00.000Z",
    "score": 9.4,
    "comments": "One of the best stories of all times. One of the best gameplay ever. One of the best expreriences ever. A great game\nThis story is absolutly amazing. It\u0027s so facinating and crazy! It\u0027s in this scay world of an alien invasion but like that was not enough, they thru in a corrupt government (i love government conspiricies lol). The gamepl... ",
    "gameID": 0,
    "author": "Dodger26"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2005-01-12T00:00:00.000Z",
    "score": 9.0,
    "comments": "Even after 6 years, Half-Life is still a thrilling expeirience.\nI can\u0027t believe I waited 6 years to play Half-Life. It revolutionized First person shooters, and introduced many qualities we take for granted in today\u0027s games. It will be hard for me to type this reveiw though, because ... ",
    "gameID": 0,
    "author": "agent401"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-01-30T00:00:00.000Z",
    "score": 9.4,
    "comments": "\u0027age certainly has not caught up with Valve\u0027s Half-Life\u0027\n6 years after Half-Life was released, I finally bought the game at a very cheap price. And boy, am I glad that I\u0027ve bought this game! Half-Life not only provides me with the ultimate gaming experience, it puts me in the ... ",
    "gameID": 0,
    "author": "Chinykian"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-02-05T00:00:00.000Z",
    "score": 9.7,
    "comments": "Incredibly immerse and fun at the same time.\nThe games that have tried to make graphics and sound and life-like at the same time have always failed. Doom was fun but without taking a lot of damage when falling, along with little sound it failed to make life-like an... ",
    "gameID": 0,
    "author": "Dessna32"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-02-08T00:00:00.000Z",
    "score": 9.1,
    "comments": "The most influential first person shooter still holds up in today\u0027s over-saturated market.\nRecently, I had a chance to go \"old school.\" Not all the far back, but seven years is quite a bit of time in the lifespan of a videogame. While the PS2 version of Half-Life was released in 2001, it was a port game for th... ",
    "gameID": 0,
    "author": "gianteck"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2005-03-05T00:00:00.000Z",
    "score": 9.1,
    "comments": "the transfer that was made from the PC to the Playstation 2 was done brilliantly.\nEven though Gordon Freemen has been diggen up back from the dead and now brought to the Playstation 2 and onto a console for the first time. Who could possibly forget the 1998 masterpiece that was released for the PC and... ",
    "gameID": 0,
    "author": "roleplayer2004"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-03-16T00:00:00.000Z",
    "score": 8.7,
    "comments": "Run. Think. Shoot. Live\nDoes Half Life still warrant a purchase even though it came out in 1998? In 1998 Valve released Half Life taking the computer gaming world by storm. After winning Game of the Year from over 50 publications and spaw... ",
    "gameID": 0,
    "author": "J-Freak"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 0,
    "date": "2005-03-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "Half-Life brings out the best in console FPS genre while taking it to the next level.\nHalf-Life is far and away the best FPS shooter I have ever played. Now while most will contend that the PC version, the so called “Game of the Year” edition, is the only true way to play this revolutionary game, the PS2... ",
    "gameID": 0,
    "author": "led282"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-03-20T00:00:00.000Z",
    "score": 8.9,
    "comments": "I literally thought of Half-Life being the best game ever created...\nHalf-Life was released back in 1998 and was known for scoring over 50 Game of The Year publications, Half-Life was known for being the best FPS game ever created. And of course, I couldn\u0027t agree more. I have some great m... ",
    "gameID": 0,
    "author": "Genisk02"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2005-03-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "It amazed the amazed and it will amaze you as well.\nHalf Life is an amazing game. This game was revolutionary. It puts you in the shoes of Gordon Freeman, a Scientist at Black Mesa Research Facility. The game starts out with a train ride and sweeps you off your feet. You ... ",
    "gameID": 0,
    "author": "mezmorized"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-04-02T00:00:00.000Z",
    "score": 9.4,
    "comments": "Best story line ever made for first person shooters.\nThe intro for the game was what caught me when i first played it. It starts off almost as a movie, where you have to go down the Black Mesa facility and to the test lab where you are conducting this test that goes horrib... ",
    "gameID": 0,
    "author": "Placebos005"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-04-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Wow! My First FPS and the only one that gets better on each play.\nI bought a new PC and this was my first FPS game. I have since played many other but non have matched this one for story and originality. HL2 is even better by the way. It took me a long time to complete the game jus... ",
    "gameID": 0,
    "author": "purpenuk"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-04-16T00:00:00.000Z",
    "score": 8.6,
    "comments": "Opposing Force is a must-buy, it\u0027s the greatest expansion pack for the greatest game--This would be Half-Life.\nOpposing Force is a must-buy, it\u0027s the greatest expansion pack for the greatest game--This would be Half-Life. Half-Life was long, fun and it\u0027s quite a challenging game. Half-Life: Opposing Force isn\u0027t as long--Think abo... ",
    "gameID": 0,
    "author": "Genisk02"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-04-30T00:00:00.000Z",
    "score": 7.5,
    "comments": "great story, okay graphics, and some very easy enemies but overal a very good package probably better on the PC\ni enjoyed the Half Life story mode. The story was straight forward. a science experiment gone wrong, you are a one man army trying to close the portal to an alien world with the army trying to cover up the experiment th... ",
    "gameID": 0,
    "author": "antdawg2020"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-05-05T00:00:00.000Z",
    "score": 9.4,
    "comments": "The best there is, the best there was, the best there ever will be...\nWhen I bought Half Life, I was undergoing chemotherapy for testicular cancer, therefore I had nothing better to do than sit in front of a computer and be thrilled with what I was experiencing. It seems like every corner... ",
    "gameID": 0,
    "author": "flinx1000"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-05-05T00:00:00.000Z",
    "score": 7.4,
    "comments": "Fun, in the same way Half life is, but lacking in originality\nI recieved this as a gift for Xmas, and couldn\u0027t wait to get home, install, and get down to business with it. Having already mastered Half Life at the difficult level, I started at the same. I was quickly into the game... ",
    "gameID": 0,
    "author": "flinx1000"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-05-05T00:00:00.000Z",
    "score": 9.9,
    "comments": "Words cannot describe...\nThis is thought of as the best FPS to date. Half-Life was so revolutionary and ground-breaking that we have seen nothing that has knocked it from it\u0027s mantle of greatness. Not even the excellent sequel has achieved the g... ",
    "gameID": 0,
    "author": "043030"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 0,
    "date": "2005-05-06T00:00:00.000Z",
    "score": 7.0,
    "comments": "Fun game took me 6 months to finally beat it definitly worth the price!\nFun game took me 6 months to finally beat it definitly worth the price! The gameplay is very fun for this game. You get a whole load of weapons to choose from and that are worthy of helping you succeed into beating the g... ",
    "gameID": 0,
    "author": "huss2215"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-05-11T00:00:00.000Z",
    "score": 9.3,
    "comments": "An expansion pack? More like a gaming jewel!\nHalf-Life was a definitive FPS, so the expansion pack Opposing Force, which was made by Gearbox and not Valve, had a lot to live up to. Could it match and further Half-Life\u0027s greatness? Well...YES!! Naturally, as ... ",
    "gameID": 0,
    "author": "043030"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-06-01T00:00:00.000Z",
    "score": 8.7,
    "comments": "Have you ever played this game?\nIf so you surely would agree that this is a superb piece of gamework either on PC or its PlayStation 2 counterpart, if not, well, I strongly suggest you to get the PS2 version as soon as you can. In Half Life you will... ",
    "gameID": 0,
    "author": "DrDoom007"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-06-09T00:00:00.000Z",
    "score": 9.6,
    "comments": "What can you say....This is the game that started all the cool FPS games.\nFirst of all before we get down to business, this game is by far the greatest FPS game. Its the greatest because it started it all with its awesomely intense story, and for the time killer graphics. Now let\u0027s get dow... ",
    "gameID": 0,
    "author": "CDWilliams05"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-06-12T00:00:00.000Z",
    "score": 9.8,
    "comments": "One of The Greatest Games Ever Made\nHalf-Life is one of the greatest pc games ever made. It is so great the way there are puzzles and action. If you have never played this you must get it. Its worth the money trust me. I was missing out on this game for aw... ",
    "gameID": 0,
    "author": "-Jeremy-"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-06-29T00:00:00.000Z",
    "score": 9.8,
    "comments": "blow your minds to the frickin wall\nHoly crap half life is the best game ever! The story,the guns,the eneimes,its all good! First,you start off walkin around in new mexico,and you end in frickin space. For the time the ai was so frickin smart,And the... ",
    "gameID": 0,
    "author": "FrankJaeger"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-08-11T00:00:00.000Z",
    "score": 9.1,
    "comments": "In some ways it\u0027s better than Half-Life itself\nNow even though Opposing force is a pretty short game, it\u0027s still loads of fun. And in some ways it\u0027s better than Half-Life itself. For starters you have access to some awesome weapons including an m60 machine-gun, and t... ",
    "gameID": 0,
    "author": "MarsLander"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-08-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "Brilliant, addictive, and scary\nThis game requires patience, quick wits, quick fingers, and good problem solving skills. So do games like Mortal Pongbat. What makes Half-Life exceptional is the senses-shattering realism which laces the entire in-game e... ",
    "gameID": 0,
    "author": "sigothemanny"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-08-29T00:00:00.000Z",
    "score": 7.9,
    "comments": "For those of you that never discovered the joy that is Half life due to lack of a PC . . . . . here is your chance.\nWhen Half Life was released in 1998 it blew everyone away and raised the bar for PC games in general and became the standard that all first person shooters were compared to for many years. Those of us that don\u0027t use PC\u0027s... ",
    "gameID": 0,
    "author": "dark_orb"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-09-02T00:00:00.000Z",
    "score": 8.1,
    "comments": "Half-Life is an immersive game with great action and is a real lot of fun.\nAlthough I have not played the PC version of the game to know how this version stands up, I can say that even today someone like me playing this for the first time will enjoy Half-Life. The game even now, outdated as it ... ",
    "gameID": 0,
    "author": "hazuki87"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-09-25T00:00:00.000Z",
    "score": 9.0,
    "comments": "A very interesting first-person shooter for its time.\nThis game is one of the very first good first-person shooters out there. Its story is different then usual. You play as Gordan Freeman. Just another scientist at the black mesa facility. The way this game is play through... ",
    "gameID": 0,
    "author": "stangsaleen2000"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-10-13T00:00:00.000Z",
    "score": 9.3,
    "comments": "ONE OF THE CLASSICS YOU RARELY SEE\nHalf Life is a game that can be whole-heartedly called as a masterpiece because it has achieved the things that can be done by a very few.It helped to set a trend of First person shooting that is even lasting today. ... ",
    "gameID": 0,
    "author": "yeshwent"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-10-16T00:00:00.000Z",
    "score": 9.6,
    "comments": "I found a copy laying around my house so i instaled it and I was...\nAmazed of how good this game was. For being an old game its still pretty fun to play! I was lost alot tho, but it was still pretty fun to play with! This is worth your purchese. Another cool thing about this game is ... ",
    "gameID": 0,
    "author": "MrNib"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 2,
    "date": "2005-10-17T00:00:00.000Z",
    "score": 7.8,
    "comments": "For a FPS I think its good. As a game in general I think It\u0027s over-rated.\nThis game deserves a lot of credit. But I still can\u0027t help feel it\u0027s WAY too over-rated. Gameplay- The gameplay is what you\u0027d expect from a first-person shooter. You run, you shoot, you jump, and you die.....a lot. ... ",
    "gameID": 0,
    "author": "concealedview"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-10-25T00:00:00.000Z",
    "score": 9.8,
    "comments": "\"Unbeliveable\"\nThis game has is so realistc you wont belive, no more shooting the guy in the head 10 times before he dies. This game puts fourth somthing all other games have lacked before in first person shooters, GOOD AI. In half lif... ",
    "gameID": 0,
    "author": "gyro-ranker"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2005-10-25T00:00:00.000Z",
    "score": 9.5,
    "comments": "It blew me off dudes!!!......the original half-life was the best fps out there...and this one beat it...\nThe graphic is nice, the gameplay rocks, the story is great....i\u0027ve finished the original game twice and i finished this one twice also....i was pretty much stuck on the monitor screen...hahahaha i love it the way the... ",
    "gameID": 0,
    "author": "ershadsonda"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-10-28T00:00:00.000Z",
    "score": 9.3,
    "comments": "One of the best PS2 FPS. Fantastic!\nThis game is one of the best FPS on PS2! It is very good in value and graphics. The game has many weapons like the laser, rocket launcher and the traditional crowbar. It has an extra game (expansion) called Decay. In... ",
    "gameID": 0,
    "author": "FrCoutinho"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 0,
    "date": "2005-10-31T00:00:00.000Z",
    "score": 3.6,
    "comments": "What is a the hype over?\nI thought Half Life on Ps2 at least was one of the worst games I ever played, the graphics are harsh and the ease of play was horrible. Terrible camera angle. Don\u0027t get me wrong I play alot of first person shooters, it ... ",
    "gameID": 0,
    "author": "longbrake"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-10-31T00:00:00.000Z",
    "score": 9.3,
    "comments": "Nice, where storytelling meets gameplay halfway\nHalf Life was released around 1997, it stars 27 year old Gordon Freeman working in the Black Mesa Research Facility. As expected, all hell breaks loose very quickly, and it is up to our hero to save himself. The stor... ",
    "gameID": 0,
    "author": "SPNKR"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2005-11-03T00:00:00.000Z",
    "score": 9.4,
    "comments": "Just amazing, this game will blow you away. Say goodbye to a couple of weeks in your life.\nWhat an amazing game this is. Incredible,cinematic, realistic, interactive, well animated, nicely modeled, well sounding, the sense of power, the lineup of weapons, I don\u0027t know where to begin. First of all, this... ",
    "gameID": 0,
    "author": "fjgamer"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-07T00:00:00.000Z",
    "score": 9.8,
    "comments": "*~!!Awesomely Addictive!!~*\nThis is the Halo of 1998! The game is a masterpiece and an instant classic!.....It\u0027s completely worth your time. It\u0027s completely first-person; really.....it doesn\u0027t show Gordon\u0027s face and he never talks; The gameplay ... ",
    "gameID": 0,
    "author": "BansheeRider"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-08T00:00:00.000Z",
    "score": 9.8,
    "comments": "Showing age? Yes. Getting old? No.\nYes, Half-Life was released in 1998, but you ask \u0027\u0027can I still enjoy it in 2005 and beyond?\u0027\u0027 The answer, Yes, if you aren\u0027t someone looking for something wrong with the game, like a lot of people are these days. Half-L... ",
    "gameID": 0,
    "author": "Allehelgens"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Wow. Just.... Wow.\nI\u0027m sorry, but I\u0027ve been playing HL for years, and I have to say, for it\u0027s time it is one of the best games ever made. This game scores a perfect 10. All of its content was amazing back in its time. Sure the sequel blows... ",
    "gameID": 0,
    "author": "Brakzias"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-11-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "unbelievable!\nhalf-life is the game that put the word \"story\" in first person shooters. without half-life there would be no halo\u0027s no breakdown\u0027s and definitely no chronicals of riddick. this game completely changed how we think of fi... ",
    "gameID": 0,
    "author": "rob_dAmAgE"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "A game that if you miss...you\u0027re a tottal loser.\nThats right...I said it. And its true. This game has to have one of the best storylines of any first person shooter ever. Its immersive, and intensive from start to finish. And the great part for those of you that ha... ",
    "gameID": 0,
    "author": "J0nGalt"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-20T00:00:00.000Z",
    "score": 8.3,
    "comments": "An awsome first person shooter!\nThis Game is pretty much a remake of Half Life, for the computer, You play as a scientist guy that tests this new technology and it blows up and opens up a portal type thingy and now you have to fight your way out of the... ",
    "gameID": 0,
    "author": "spaulding257"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-21T00:00:00.000Z",
    "score": 9.6,
    "comments": "... leaves me speechless\nMy first experience with Half-life was well.. to sum it up in one word I’d say PERFECT. This game revolutionized all first person shooting games, this game set a mark. No game from Half-life on should even try to make ... ",
    "gameID": 0,
    "author": "kroloth"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-11-21T00:00:00.000Z",
    "score": 9.3,
    "comments": "great game and a great story line as well\nhalf life opposing force is a great pc shooter. you play as the bad guy in the original half life game. your job is to go to black masa kill all the aliens and kill gordon freedman, making it so there was no proof that ... ",
    "gameID": 0,
    "author": "Trendkill351"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-22T00:00:00.000Z",
    "score": 9.7,
    "comments": "The most amazing game ever...\nThe most amazing game ever! Back when it came out, yes I was just a kid but I\u0027ve played every day for a very long time. Over the years, after purchasing half-life 2... Here it is a review of the most anticipating game... ",
    "gameID": 0,
    "author": "FD_Gordon"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-11-24T00:00:00.000Z",
    "score": 9.1,
    "comments": "This game is one of the best\nI find this game very good because it never gets boreing it took me hours to finish and most of those hours were spent doing some serious action, but this game still contains some sweat-breaking puzzles, which may lead t... ",
    "gameID": 0,
    "author": "gadabout"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2005-11-25T00:00:00.000Z",
    "score": 9.3,
    "comments": "Half-Life mixes some of the best concepts, and delivers on all of them in a satisfying manner.\nHalf-Life is a stunning first person shooter that will catch most everyone off guard with its stunning presentation. Half-Life mixes some of the best concepts, and delivers on all of them in a satisfying manner. * Rev... ",
    "gameID": 0,
    "author": "UnlivedPhalanx"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-11-28T00:00:00.000Z",
    "score": 9.6,
    "comments": "You don\u0027t know Half-life. Yeah right..\nThis is the game were Gordon Freeman get\u0027s trapped in the Black Mesa when a experiment goes wrong and aliens teleports in. The militery goes in to stop teh aliens and kill the people that work there to cover the true sto... ",
    "gameID": 0,
    "author": "Creapy_team"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-11-28T00:00:00.000Z",
    "score": 9.6,
    "comments": "A game as priceless as gold itself. Amazing...\nIf you can believe it, I just recently got a chance to play this classic game. All this hype about Half Life two, which should be out any day now, got me interested in the first one and from what I was told, I had to pl... ",
    "gameID": 0,
    "author": "viper_najem"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2005-11-30T00:00:00.000Z",
    "score": 8.6,
    "comments": "Has a very good storyline that will make up for everything else.\nLooking at the game overall, I would say it was stunningly good. I haven’t played very many games that could rival Half-life. It has a very good storyline that will leave you wanting for more. Thankfully they are coming ... ",
    "gameID": 0,
    "author": "LordGamer0001"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-11-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "My god my god, this game is a gift from heaven.\nThis game has gone above and beyond the call of duty, it has shown what the mind can and still has yet to do. This game is a benchmark in gaming. I thought that Doom was good, damn was i wrong. If you don\u0027t like this ... ",
    "gameID": 0,
    "author": "skinydude5656"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-03T00:00:00.000Z",
    "score": 9.8,
    "comments": "Simply put, this is the greatest PC game of all time.\nThis game changed the way we thought about games and I am not surprised. The gameplay was very unique at the TIME and games had never seen the laws of physics and gravity before produced so beautifully. Everything in the... ",
    "gameID": 0,
    "author": "tomcrito"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2005-12-04T00:00:00.000Z",
    "score": 7.3,
    "comments": "You\u0027ll love it, for a little bit.\nThis game came out back in 1998, the year of the game, and was THE classic. Now on PS2 it\u0027s ok but not as good as it could\u0027ve been. For example I would\u0027ve loved to have counter-strike for online or al least split-screen,... ",
    "gameID": 0,
    "author": "bwolf92"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-12-05T00:00:00.000Z",
    "score": 9.1,
    "comments": "Tho very difficult is still very mutch a great experience.\nFor its time this has some great graphics and gameplay.You play as Gordan Freeman a scientist at the Black Mesa facility one day you are doing a deminsional expirement that goes horribly wrong bringing these horrible ali... ",
    "gameID": 0,
    "author": "The_Code"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-06T00:00:00.000Z",
    "score": 9.4,
    "comments": "Great challenging game\nlike said its a great challenging game, i think its better than halo and im a huge halo fan, half life is a great game and is still worth 50.00 in my opinion, worth buying and playing over and over again just for the adv... ",
    "gameID": 0,
    "author": "jbgamefreak5"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2005-12-06T00:00:00.000Z",
    "score": 9.8,
    "comments": "I didn\u0027t think it was possible to have a better game than Half-Life but Opposing Force is just as good.\nAfter Blue Shift came out i\u0027m sure everyone said \"well the Half-Life series had better put together somthing a whole lot better than that to stay in buissness\". And guess what... thay did. Most people i\u0027ve talked to abou... ",
    "gameID": 0,
    "author": "wakbuky_ted"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 6,
    "date": "2005-12-06T00:00:00.000Z",
    "score": 9.3,
    "comments": "GREAT!Probably one of the best shooters on PS2.\nI played Half Life for PC in 1998 when it came out ,and at the time I thought it was awesome.Graphics,at the time were state of the art , and gameplay was probably as good as it was gonna\u0027 get at the time.But when it cam... ",
    "gameID": 0,
    "author": "gunman357"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-06T00:00:00.000Z",
    "score": 9.8,
    "comments": "Half-Life the greatest first person shooter of all time\nThe best Shooter game of all time is definately Half-Life! The greatest part of this game is it is not only shooting aliens but you have to go through various obstacles. For example, you need to push certain boxes in a p... ",
    "gameID": 0,
    "author": "wakbuky_ted"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-08T00:00:00.000Z",
    "score": 9.4,
    "comments": "One of the Best Shooter\u0027s of All Time\nHalf-Life is definately a big step for first-person shooters. Instead of those games which gives out random objectives, this game put you into a sciencist\u0027s position and develops a storyline. The game starts out in th... ",
    "gameID": 0,
    "author": "Thatdot6"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-12T00:00:00.000Z",
    "score": 9.3,
    "comments": "This is THE revolutionary first person shooter!\nBefore playing Half-Life all I knew was that it was a popular first person shooter, I had no idea how critically acclaimed it was so you should know that I was in awe of this whole game. You are Gordon Freeman, scientist... ",
    "gameID": 0,
    "author": "Jabbawocky04"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-13T00:00:00.000Z",
    "score": 9.6,
    "comments": "The monster in its first state...\nHalf-life was a top-of-the-line PC game, that was very popular and succesful in the 3 years of 1998, 1999, and 2000. However, during those 3 years, a lot of people still hadn\u0027t played the game, because they were console... ",
    "gameID": 0,
    "author": "Bgrotha666"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "There is a Doctor in the house??\nWell maybe not in the house but sure in this game!! When I began to play HL I thought: \" oh man...what the hell...this is so boring....what with all this credit stuff.......where are the guns.....oh......maybe I need to... ",
    "gameID": 0,
    "author": "Scorch1984"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-15T00:00:00.000Z",
    "score": 9.5,
    "comments": "Indulge yourself in one of the best FPS games ever, without the bad aftertaste.\n1998. The so called \"greatest year\"(Gamespot) of video games. In this year, many of the best games ever came out, including Metal Gear Solid, Legend of Zelda: OoT, and Grand Theft Auto. But then out of left field comes H... ",
    "gameID": 0,
    "author": "InfinityTomorro"
  },
  {
    "helpfulCount": 15,
    "helpfulScore": 3,
    "date": "2005-12-17T00:00:00.000Z",
    "score": 6.5,
    "comments": "Maybe you had to be there when it came out.\nI can recall reading previews practically drooling over the things Valve was going to do with Half-Life. I\u0027ve read reviews lauding it for its immersion, its play value, the ground it broke.. I must be missing somethin... ",
    "gameID": 0,
    "author": "malkav11"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-17T00:00:00.000Z",
    "score": 9.2,
    "comments": "Half-Life\nGood: Amazing way the storyline is presented. Excellent graphics. Good usage of blood and gore. Excellent voice acting. Great weapons and tactics. The keyboard works like a charm when interacting with this game. Always f... ",
    "gameID": 0,
    "author": "coltfan469"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-17T00:00:00.000Z",
    "score": 8.3,
    "comments": "A step towards great accivements\nI just started playing half-life...its like 10.00 at walmart now. The price isnt puting that game down any way shape or form though.This is a great sci-fi shoot em up game. i found the game it-self a little odd but it st... ",
    "gameID": 0,
    "author": "slipknot92"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2005-12-18T00:00:00.000Z",
    "score": 9.9,
    "comments": "If it wan\u0027t for Half-Life, First Person shooters would have never evolved.\nHalf-life. Interesting title for a game that is quite long, for a game that has thrills and excitement around every corner, for a game that revolutionised First Person Shooters. You are Gordon Freeman, a 27 year old The... ",
    "gameID": 0,
    "author": "BlackandWhite0"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2005-12-20T00:00:00.000Z",
    "score": 9.7,
    "comments": "Even now, you can see exactly why Half-Life revolutionized the genre.\nI had played Half-Life several times, in stores, a friend\u0027s house, a demo, but in reality, you have no clue how exceptional this game is until you actually own it for yourself, so you can experience it as it was meant to... ",
    "gameID": 0,
    "author": "EyeNixon"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-20T00:00:00.000Z",
    "score": 9.4,
    "comments": "...\nHalf-Life\u0027s storyline slowly builds in intensity, much like a finely crafted action sequence or an engrossing novel that you simply can\u0027t put down. In fact, the less you know about the surprises that await, the better. T... ",
    "gameID": 0,
    "author": "O_G_Loc_Bitch"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-21T00:00:00.000Z",
    "score": 9.4,
    "comments": "go buy it rip it rent anything but just get it its awesome at the begginning its a bit boring but just play around for 1\ngo buy it rip it rent anything but just get it its awesome at the begginning its a bit boring but just play around for 15 minutes and ull quickly get the hang of it or just use the hazard course which is the tutorial on ... ",
    "gameID": 0,
    "author": "sk8ingmexikan"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-23T00:00:00.000Z",
    "score": 9.7,
    "comments": "Half-Life is one of the best games ever and is still fully enjoyable seven years after it was released.\nThe First Person Shooter would be nothing like it is today without Half-Life. Half-Life is one of those special games that stands above all games and that people who aren\u0027t fans of the genre will enjoy. Gameplay: 10/1... ",
    "gameID": 0,
    "author": "Astrodude_5"
  },
  {
    "helpfulCount": 14,
    "helpfulScore": 1,
    "date": "2005-12-23T00:00:00.000Z",
    "score": 5.8,
    "comments": "Provides the right amount of intensity and fun?\nI have played games ranging from Call of Duty to Age of Empires and this game is pretty good. Their are many obsticals. I dont think that there are enough weapons. A wider variaty of weapons would be nice. Game play is d... ",
    "gameID": 0,
    "author": "stewy942"
  },
  {
    "helpfulCount": 26,
    "helpfulScore": 5,
    "date": "2005-12-23T00:00:00.000Z",
    "score": 5.0,
    "comments": "Half life was a killer shooter when it was released in 1998, but now it\u0027s totally overrated\nHalf life. To many people, this is the best shooter ever made. After playing it 7 years later, I have a tough time believeing that. Hey, maybe some day Half life 2 and Halo 2 will be trash, but those are the real games t... ",
    "gameID": 0,
    "author": "zwulith"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-24T00:00:00.000Z",
    "score": 9.6,
    "comments": "greatest most underated game ever\nThis game is the greatest, I must have spent a good portion of my life playing it over and over again. But alot of people think this game and all of its kin are crap (though it received over 50 game of the year awards). ... ",
    "gameID": 0,
    "author": "nyoe"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-24T00:00:00.000Z",
    "score": 9.8,
    "comments": "A great single player and a great multiplayer as well\nWhen you start Half-Life you start as a young scientist named Gorden Freeman working for a shady corporation called the Black Mesa. When you arrive by subway to your job location a freak accident happens opening up a po... ",
    "gameID": 0,
    "author": "eclipse849"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 1,
    "date": "2005-12-26T00:00:00.000Z",
    "score": 8.1,
    "comments": "Freeman! What are you doing!\nI remember seeing this game collecting dust on the shelves while Starcraft was flying off the shelves. I remember looking at it and thinking how much fun it\u0027d be playing as a nerd scientist holding off an alien invasion,... ",
    "gameID": 0,
    "author": "differentiation"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-27T00:00:00.000Z",
    "score": 9.6,
    "comments": "7 years on and who would have thought it\u0027s still a fantastic game. Hey, it\u0027s happened with Zelda: Orcarina of time.\nRitey, I usually start with the good points and then show the bad points: (I am judging this game as if it were the year 1998 on it\u0027s release) Good points: -Very intelligent and well scripted story line. -Intense... ",
    "gameID": 0,
    "author": "patchtheman"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "It\u0027s THE BEST because of the story\nSure, expectations are everything, and if you\u0027re expecting a lot, chances are you\u0027ll be let down. Like maybe the movie King Kong, or Star Wars Episode One. We were all expecting a lot, and because of this we were (probab... ",
    "gameID": 0,
    "author": "morcegohoman"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2005-12-30T00:00:00.000Z",
    "score": 9.7,
    "comments": "The best first person shooter ever!!!\nThis is a game that changed everything, i remember the first time a played the demo i could not wait for the hole game! i mean the hole game play is just perfect new and just what first person shooters needed! the story ... ",
    "gameID": 0,
    "author": "pilsener"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2005-12-31T00:00:00.000Z",
    "score": 9.6,
    "comments": "Half-Life is a masterpiece of epic proportions, the Saving Private Ryan of first-person shooters\nThere\u0027s really nothing more I can say without sounding like a broken record. Is Half-Life as good it could have been? No, it\u0027s better. If you want an incredible 3D experience that will cause you to lose sleep, meals, PTA... ",
    "gameID": 0,
    "author": "CTOCTOCTO"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2005-12-31T00:00:00.000Z",
    "score": 9.4,
    "comments": "How about taking a look at the game that started from scratch all? Modern FPS with a few exceptions lack what HL has.\nOk, first of all, i´m reviewing this game considering my first impressions i had when i first got my hands on it back in 1999. I think that most (if not all) of the modern FPS shouldn´t exist if it wasn´t for this am... ",
    "gameID": 0,
    "author": "DARK_HUNT"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of, if not the best PC shooter\nWhat can you say about Half Life? Maybe that it is one fo the best first person shooters ever on the PC; it combines action and story telling unlike any game previous; it has enemy A.I. that actually seems realistic and ... ",
    "gameID": 0,
    "author": "soxfan06"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-01-02T00:00:00.000Z",
    "score": 9.9,
    "comments": "Half-Life will always be seen as one of the best fps\u0027s of all time. And is a must play for all gamers.\nDebuting in 1998 Half-Life changed the way we think about first person shooters. With it\u0027s varied levels, challenging gameplay, and advanced story line Half-Life will go down as one of the best if not the best first pers... ",
    "gameID": 0,
    "author": "nevernaine"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-01-02T00:00:00.000Z",
    "score": 9.3,
    "comments": "words really cant explain how good this game is\nfanstatic game. when you think of most good games they have flauds in them but this game is somthing else. the levels are not in a single way prediitable and load up in like microseconds ans what is even better is if yo... ",
    "gameID": 0,
    "author": "yoyo462001"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Perfect!!\nOf all the games I\u0027ve played in my life none of them compare to the masterpiece that is Half-Life. Released almost 8 years ago it still the greatest game ever made, yeah the graphics are dated, but hell who cares!!!!! i... ",
    "gameID": 0,
    "author": "hekke"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-04T00:00:00.000Z",
    "score": 9.6,
    "comments": "Half-Life review\nHalf-life, the old look to it is attracting, i DONT like you SUPER HD GRAPHIX SHOOTER! I am one of the \"idiots\" that like to still play some old games. graphics: not too high-def and not too pixely, just the way i lik... ",
    "gameID": 0,
    "author": "badgerman92"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-05T00:00:00.000Z",
    "score": 9.1,
    "comments": "The revolutionary FPS.\nTo start things off, this game has some of the best graphics for its time, and some of the best gameplay I have seen in any genre of games. The multiplayer is superb, with players duking it out against friends or just ra... ",
    "gameID": 0,
    "author": "w4rgasm"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-05T00:00:00.000Z",
    "score": 8.8,
    "comments": "a brilliant game and everything in it make you appreciate it.. after all most fps take after this one.. read on\nok before i go on to review this game can i first say what idiots thoe people are who rate this game as 5.0 and 5.3 are????!!?? ahem.. dudes.. thats a big mistake.. cos your complains are graphics and sounds.. duuuhhhh 7... ",
    "gameID": 0,
    "author": "eddyissa"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2006-01-06T00:00:00.000Z",
    "score": 9.3,
    "comments": "I finally got the expansion pack to the next best fps after Halo.\nYeah this is realy a lovely game.The gameplay was nice except the difficulty in keeping grunts in line with you.The game was kind of hard especially when in the voltigore\u0027s nest and when fighting Black ops in the start o... ",
    "gameID": 0,
    "author": "Iyitorun"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-08T00:00:00.000Z",
    "score": 9.6,
    "comments": "In my opinion Half-Life is the best FPS ever adding awsome graphics and challenge.\nWhen I first played Half-Life in the year 2001 I was instantly hooked, four years latter I’m still playing it. What I like about Half-Life is the graphics during the time was superior compared to other games during the t... ",
    "gameID": 0,
    "author": "avpget"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best game ever made yes yse yes\nDeep in the bowels of the Black Mesa Federal Research Facility, a decommissioned missile base, a top secret project is underway. A portal has been opened to another dimension, and human science has never seen anything li... ",
    "gameID": 0,
    "author": "700652948163"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-09T00:00:00.000Z",
    "score": 9.4,
    "comments": "Half-Life is a revolutionary game and still has better appeal than most of today\u0027s First-Person-Shooters.\n\"Half-Life\". Gamers and FPS lovers from all around the world know what this name means. It can be for the fact that it is required to play Counter-Strike and Team Fortress Classic, it can be for the fact that its sequel ... ",
    "gameID": 0,
    "author": "FlashFirer"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-11T00:00:00.000Z",
    "score": 9.6,
    "comments": "My mind is gone\nThis game is insane, period. I have the HL: Source version which imports some of the goodness of Valve\u0027s new engine which powered HL2. I cannot believe how they got it so right with this game: a perfect mix of all-out ac... ",
    "gameID": 0,
    "author": "MusicalGizmo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-14T00:00:00.000Z",
    "score": 9.3,
    "comments": "one hell of a ride!\nwell frankly speaking once i finishrd de game off ijust culdnt stop.well for starters 4 a game of its time it certainly had outsatanding grafix.the storyline is just brilliant. it all begins wit a freak accident at de an... ",
    "gameID": 0,
    "author": "ajfreestyler87"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-15T00:00:00.000Z",
    "score": 9.6,
    "comments": "Review of the reviews.\nHonestly, I love this game, the setting is right, graphics are nothing short of mind blowing (if you remember that its a game from freaking 1998) the voice acting, while slightly repetitive at times is often brilliant an... ",
    "gameID": 0,
    "author": "Duh_to_the_avo"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-01-15T00:00:00.000Z",
    "score": 8.9,
    "comments": "Old, but still great...\nWell, personnally, I love Half-Life...wait, waht am I saying? I never found a person who hates it, and while some people who can\u0027t have a strong enough PC to play it, and I don\u0027t know who, but still, if they have a PS2, ... ",
    "gameID": 0,
    "author": "THE_DRUGGIE"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-15T00:00:00.000Z",
    "score": 8.9,
    "comments": "Wow. The start of a great series and the father of many great games to come after it.\nWow. The start of a great series and the father of many great games to come after it. What can I say about Half-Life that hasn\u0027t already been said? This is so much better than most of the other FPS games out there becaus... ",
    "gameID": 0,
    "author": "Vornagar"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-17T00:00:00.000Z",
    "score": 9.8,
    "comments": "Original Half-Life.\nOriginal Half-Life. The game that started a flurry of mods, mission packs, and a million deathmatches. What a great game. When comparing it to some of the new games it still has better ideas in story development then ... ",
    "gameID": 0,
    "author": "YakumoWarZ"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "I\u0027m going to come right out and say it ,Half-Life is the best first-person shooter since Doom there I\u0027ve said it.\nFast, furious, and fun, fun, fun. What really amazed me about Half-Life was the game\u0027s unforgiving pace as I made my way through the Black Mesa complex, dodging soldiers all the way. When the Half-Life hype machine start... ",
    "gameID": 0,
    "author": "terryprior"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-01-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Great EXPERIENCE!\nHalf-Life doesn\u0027t only change the way FPS are played , it redefines them it changed what i expect from games that are released , it introduces an innovation to the genre , and i think this is not only a first person sho... ",
    "gameID": 0,
    "author": "GizmoSimo"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-01-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "a great addition to Half-Life\nOpposing Force is not just an ordinary expansion to a great game , it is \"The expansion\" of \"The great game\" , in opposing force you take the role of Andrew Shephard a grunt sent to eliminate Gordon Freeman , but you are... ",
    "gameID": 0,
    "author": "GizmoSimo"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-01-22T00:00:00.000Z",
    "score": 9.6,
    "comments": "After Eight Years...This game is still my number one favorite.\nDoom, Shadow Warrior, Duke Nukem, Sin... The FPS genre experienced a number of titles prior to the release of Half-Life in 1998, but none did to the genre what Half-Life did: Redefined it. Written by Sci-Fi writer Marc... ",
    "gameID": 0,
    "author": "AgentNick"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-01-22T00:00:00.000Z",
    "score": 9.6,
    "comments": "One of the best games of its year.\nHalf-life is a game that spawned a new generation of shooting games. The first-person genre received a boost because of the story development, the graphics, the manipulation of environments, and more. The game itself... ",
    "gameID": 0,
    "author": "fenix1022"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-01-23T00:00:00.000Z",
    "score": 9.6,
    "comments": "My favorite PC game.\nNo doubt, hands down, my favorite computer game. i honestly do not really like computer games but a few years ago my uncle recommended half life and i gave it a wack and loved it. controls are a little tricky at first bu... ",
    "gameID": 0,
    "author": "IVANdaGUY"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "GREATEST PC GAME!!\nSo what does make a game...a good game exactly? Well for starter..its needs a good storyline, its need good graphics, it needs great sound and music, there should be excellent features, and it must have a a huge impact ... ",
    "gameID": 0,
    "author": "Beefycake"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-27T00:00:00.000Z",
    "score": 9.4,
    "comments": "Half Life revolutionized first person shooters and changed the way a game is made. It is truly incredible.\nHalf Life was my very first FPS. It was the second Mature game I ever bought, the first being Thief. Half Life is the game that got me hooked on PC gaming and first person shooters. No game before had ever blended gamepl... ",
    "gameID": 0,
    "author": "bupp"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-29T00:00:00.000Z",
    "score": 8.8,
    "comments": "Define a genre, okay now think of the one game that changed that genre forever. For FPS that game is Half Life.\nThe First Person Shooter genre was changed forever the day that half-life was released from Valve. For the first time ever you were actually part of the story, it happend in real time around you while you fought on agai... ",
    "gameID": 0,
    "author": "WiccanPoet"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-01-31T00:00:00.000Z",
    "score": 10.0,
    "comments": "Incredible game that started the era of the \u0027great\u0027 FPS.\nThis game is my favorite of all time. For \u002798, the graphics are amazing, and it still runs on all of my old PCs. The story is great, and not just laid out there for you, you have to dig a little to find out what\u0027s going ... ",
    "gameID": 0,
    "author": "gumpy500"
  },
  {
    "helpfulCount": 26,
    "helpfulScore": 0,
    "date": "2006-02-04T00:00:00.000Z",
    "score": 1.9,
    "comments": "It is not everything ppl thought it was going to be the 2ed one was alot better\nI liked it and all and had a lil fun playing it and yes it took time but what game does not i did not have alot of fun and the grapfic suck but i think that is b/c the game was put onto ps2 it might have been better if t... ",
    "gameID": 0,
    "author": "BoonDockSaint15"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-05T00:00:00.000Z",
    "score": 8.8,
    "comments": "One of the greatest games of its time that started a new revolution for PC games everywhere\nHAlf Life definitly one of the greatest games of its time. It had graphics never before seen in any game before its time. Not only does it have awsome gameplay and a fun, exciting, and stretegic game play it was also a h... ",
    "gameID": 0,
    "author": "ferrari20091"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 6,
    "date": "2006-02-05T00:00:00.000Z",
    "score": 9.4,
    "comments": "The Game that started it all\nWhen I first started the game, I thought it was very cool being able to sit back and watch the game sort of present itself while waiting on the train thing. I like how they had the different scientist and the security ma... ",
    "gameID": 0,
    "author": "theunwn"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-02-07T00:00:00.000Z",
    "score": 9.4,
    "comments": "Took FPS to the next level, Amazing SP \u0026 Revolutionary MP which made FPS today what they are.\nOne of the greatest games of its time that started a new revolution for PC games everywhere. Half-Life definitly one of the greatest games of its time. It had graphics never before seen in any game before its time. Not o... ",
    "gameID": 0,
    "author": "CHAMPANERIA"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 3,
    "date": "2006-02-08T00:00:00.000Z",
    "score": 8.4,
    "comments": "This game is different\nHalf-Life is a game like no other in many aspects. In the game you play as a scientist whos experiment went extremly wrong. And as your stuck underground in a huge facility, it is up to you to get to the top and help p... ",
    "gameID": 0,
    "author": "rainpoursaway"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-09T00:00:00.000Z",
    "score": 9.6,
    "comments": "Gearbox have achieved the impossible - they have bettered the original half-life experience. Absolutely fantastic.\nFirst of all if you haven\u0027t played the original half-life, then why not? It totally revolutionised a genre originally benchmarked by Doom in 1994. Opposing Force is everything you could ever want from a follow up/expansi... ",
    "gameID": 0,
    "author": "popo62"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-10T00:00:00.000Z",
    "score": 9.2,
    "comments": "Only game I played through twice.\nHalf Life doesn\u0027t need any more proponents, nor any more rave reviews. If you haven\u0027t heard that it\u0027s awesome, my review won\u0027t make much difference. But it\u0027s mildly amusing to sound off about something one loves, so th... ",
    "gameID": 0,
    "author": "abima"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-02-12T00:00:00.000Z",
    "score": 9.3,
    "comments": "Great 1st person shooter\nI spent some time playing the sinlge player campaign and it is very nicely done. The story kind of sucked me in and made me want to finish the game. Graphics are good and so are the sounds. There is not a huge learnin... ",
    "gameID": 0,
    "author": "phicks85"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-02-13T00:00:00.000Z",
    "score": 8.8,
    "comments": "Half LIfe for PS2 is a must own\nWhen Half-Life came out for the PC it changed PC gaming forever now it is out for the PS2 and it changed the way FPSs on the PS2 are made. Hal-Life for the PS2 is the same thing like the PC version of Half-Life but in a ... ",
    "gameID": 0,
    "author": "MiniGuns"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-21T00:00:00.000Z",
    "score": 7.2,
    "comments": "Buy it to know the background for HL2\nNow this game on PC won awards, it deserved them. But on the transition to PS2 something was lost. That geeky feeling about playing a scientist that wears glasses. However it was an interesting game because it was a comb... ",
    "gameID": 0,
    "author": "TheKretinousQ"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-02-25T00:00:00.000Z",
    "score": 7.7,
    "comments": "This does get you into the game with more of the story from the first game and you will feel like your back in BlackMesa\nHere is the first expansion or spin-off to half-life that does do a good job. This time your on the opposite side, but you don\u0027t feel like it since your not fighting Gordon Freeman. Your more of following in his foot ste... ",
    "gameID": 0,
    "author": "stangsaleen2000"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-02-25T00:00:00.000Z",
    "score": 9.4,
    "comments": "excellent game, keeps your interest from the start.\ni didn\u0027t know what to expect when i bought this, but to date it hasn\u0027t let me down. with so many flash in the pants games out today where you lose interest real fast, this old standby keeps your interest from start to f... ",
    "gameID": 0,
    "author": "skizz624"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2006-02-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "FPS\u0027s were fun before Half Life, but it changed the face of them permanently thereafter\nThere were legendary FPS titles before Half Life. Games like Doom, Wolfenstein and Duke Nukem 3D ruled the day, but then this bad boy came along. Half Life was new, it didn’t use pixels, but rather it used polygons, t... ",
    "gameID": 0,
    "author": "Spincut"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2006-03-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Half-Life a truly an amazing gaming experience!! A must own copy for a True PC Gamer !! **SPOILERS**\nHalf-Life: By, Scorpio_gamer a.k.a Neerajkumar_4 Introduction:- I know it’s actually very late to write a review for this game, the reason for me writing the review is because I stepped int... ",
    "gameID": 0,
    "author": "deactivated-5c5082a7cb0c7"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-03-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "Simply, perfect.\nLegend of Zelda? Junk. Chrono Trigger? First in a long line of losers. Final Fantasy 7? Don\u0027t make me cry! Halo? Get real. All of these games do not even amount to a tenth of Half-Life\u0027s greatness and they never will. 10... ",
    "gameID": 0,
    "author": "grasu"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-03-03T00:00:00.000Z",
    "score": 9.4,
    "comments": "A True Game\nHalf-Life is what a game should be. Half-Life is extremely long and is challenging at times. The graphics are pretty outdated but gameplay is just great. The story is also interesting. I\u0027ve been playing Half-Life for a y... ",
    "gameID": 0,
    "author": "timbo0827"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-03T00:00:00.000Z",
    "score": 9.8,
    "comments": "Incredible PC port that captures all the tension and incredible action of its sister!\nThis.....is......AMAZING! now i dont usually start reviews that way but it has to be said that this game is a true hallmark of gaming!!!! First the story. You r gordon freeman and uve got a new job hooray! however your ... ",
    "gameID": 0,
    "author": "Onikage123"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-03-06T00:00:00.000Z",
    "score": 9.6,
    "comments": "The Game That Changed Everything\nThe Best part: The gameplay The Worst Part: The chapter called Interloper (So hard) Gameplay - 10/10 The gameplay alone changed the FPS genre forever. The story is superb, with lots of twists and mysteries, the gun ... ",
    "gameID": 0,
    "author": "spectre37"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-03-08T00:00:00.000Z",
    "score": 9.0,
    "comments": "Many could not get it to run, but I did, and I loved it.\nHalf-Life set a new standard for excellence in game play. While not as fun as TRIBES or QUAKE II, it was in its own right, one of the best games ever made. I still to this day enjoy loading it up and playing it. The ex... ",
    "gameID": 0,
    "author": "Advocate"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-08T00:00:00.000Z",
    "score": 9.3,
    "comments": "The game that started it all\nWhen i picked up Half-Life 2 i picked up the collectors which came with Half-Life 1 so i tried it after HL2 (not a good start) and even though the game was out of date and every time my friends see my play the game they ... ",
    "gameID": 0,
    "author": "halofreak3487"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-03-08T00:00:00.000Z",
    "score": 9.0,
    "comments": "no half-life ,no halo or are 51 ,its that important!. at least a decade before its time.\nthis was the first , fps i ever had the good fortune to play and im glad i didnt miss this experience of gaming history. you play gordon freeman who begins another day as a scientist at the black mesa research facility... ",
    "gameID": 0,
    "author": "exocel"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-09T00:00:00.000Z",
    "score": 9.4,
    "comments": "its half life but better!!!!!!\nthe game is amazing, fomr the beginnign when i got hal life for the computer i was shocked from the beginnig till end, it was a great game, and now it comes to ps2, how great is that? awesome, normally ports arent as goo... ",
    "gameID": 0,
    "author": "jbgamefreak5"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-03-10T00:00:00.000Z",
    "score": 9.6,
    "comments": "The Best Sci-Fi Game it is Time!!!\nDamn it I dont wanna buy this game just hearing from my friends words, and plus I didnt like it at first look. but I was missing out the biggame in my collection if I would ignore it. Thanks god that I didn\u0027t.... This ga... ",
    "gameID": 0,
    "author": "vufor"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2006-03-11T00:00:00.000Z",
    "score": 8.0,
    "comments": "the pc version is well better\nIts not a really great FPS like Halo or others, but its still a fun game. I like the weapons and the lay out of the levels. The difficulty is nice and the story is pretty good. The control is well done, and if your a F... ",
    "gameID": 0,
    "author": "22111993"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-03-15T00:00:00.000Z",
    "score": 9.2,
    "comments": "The shooter that awoke them all.\nHalf life brought a whole new idea, feeling and look to the first person shooting genre. Made in 1997, it looks amazing for it\u0027s years. The story is very cloudy, and not so easy to pick up, but in the end it all makes s... ",
    "gameID": 0,
    "author": "bigpimpfattony"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-03-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "Best expansion pack ever to the best game ever \u003d AMAZING GAME\nFPS mission packs usually arent to great. Add some Weapons, new levels, and new characters.NOT this one! This Expansion Pack set a new standard. It returend you to familiar Black Mesa, but had you playing as one of many ... ",
    "gameID": 0,
    "author": "whgresiak"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2006-03-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "best Game ever made, it revolutized PC Gaming and First Person Shooters\nHalf Life is possibly the best First-Person Shooter ever made. This is the game that started it all. Every single FPS to date owes its excistance to Half Life. In Half Life you play was Gordon Freeman. A scientist who en... ",
    "gameID": 0,
    "author": "whgresiak"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 4,
    "date": "2006-03-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best First Person Shooter ever on the PC.\nThis is the best game in 1998. It won a lot of awards in that year. This game is still popular until today. Gamers just can\u0027t get enough of its multyplayer mode. Even me I still play this game with my friends. It is a lo... ",
    "gameID": 0,
    "author": "DEATH775"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-03-21T00:00:00.000Z",
    "score": 9.0,
    "comments": "Half Life is a superb FPS from start to finish.\nIn 1998 Valve released Half Life taking the computer gaming world by storm. After winning Game of the Year from over 50 publications and spawning several expansion packs, Half Life is still considered to be one of th... ",
    "gameID": 0,
    "author": "Dutch_Mix"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 3,
    "date": "2006-03-23T00:00:00.000Z",
    "score": 9.6,
    "comments": "This is exactly what a expansion pack should be like........\nHalf-life opposing force is a awesome expansion pack set in the same exact time as the original game. You are put in the shoes of Adrian Shepard,a soldier affiliated with the american military. From the beggining,y... ",
    "gameID": 0,
    "author": "gunman357"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2006-03-24T00:00:00.000Z",
    "score": 9.4,
    "comments": "Half-Life\nAnd its true. This game has to have one of the best storylines of any first person shooter ever. Its immersive, and intensive from start to finish. And the great part for those of you that have NOT played it yet is that ... ",
    "gameID": 0,
    "author": "Danny_Bullit"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-24T00:00:00.000Z",
    "score": 8.9,
    "comments": "An impressive and fantastic story line!!!\nWhat a great development in game industry.... I have almost finished the Half-Life...suddenly I saw the expansion pack caled HL Opposing Force, here you go I bought it..at the start of the game I just stuck and look to ... ",
    "gameID": 0,
    "author": "vufor"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2006-03-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is an amazing expansion pack for the award winning game, Half-Life.\nThis was one of the first games I really got into. When I was younger I always played counter strike with my brother so I fealt familiar with the controlls and overall gameplay. In this game, you play as Adrian Shepard. ... ",
    "gameID": 0,
    "author": "ericcartman3722"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-26T00:00:00.000Z",
    "score": 9.4,
    "comments": "THIS GAME IS ONE OF THE BEST FPS EVER!!!!!!!!!!!!!!!!!!!\nThis game is really AMAZING!!!!!!!!!! The gameplay ROCKS because you get to shoot a lot of people and monsters. The difficulty is just right for me. The graphics are amazing because the detailed characters and enviorn... ",
    "gameID": 0,
    "author": "gamerzrulez"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-03-27T00:00:00.000Z",
    "score": 8.9,
    "comments": "Anomlous Materials\nStory: You are Gordon Freeman, A scientist recently hired to work at the Ultra secrective Black Mesa research facility in the anomlous materials department. You are about to conduct an experiment on a crystal like sample... ",
    "gameID": 0,
    "author": "worshyr"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-28T00:00:00.000Z",
    "score": 9.3,
    "comments": "It\u0027s not the best, But it led the way for the best...\nFirst of all i want to say that i dont believe that this game is the best First person shooter of all time like most say. But without a doubt it is on of the best of all time and it led the path which the superior fps fo... ",
    "gameID": 0,
    "author": "Jordanbarrantes"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-29T00:00:00.000Z",
    "score": 9.7,
    "comments": "Without a doubt the best PC FPS to date\nOK, so the title may already explain what I\u0027m going to say. But hear me out: HL is not only one of the best PC FPS to date, but it may be the best GAME to date. HL brings the FPS genre to a new level and sets to bar fo... ",
    "gameID": 0,
    "author": "tartagliam"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-03-29T00:00:00.000Z",
    "score": 9.1,
    "comments": "The best expansion pack in the HL universe\nWhat can I say, this expansion pack brought everything you\u0027d expect from the Valve team. You get an entirely now campaign from the Grunt\u0027s perspective. This means you can actually use grunts as allies and fight along s... ",
    "gameID": 0,
    "author": "tartagliam"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "Holy freaking gizz..\nHalf Life is one of those games that will excite you in ways that was once only possible by the oppsite sex.... or in some cases the same. I\u0027m going to start off with the neggative... the intro part where you start off i... ",
    "gameID": 0,
    "author": "PuppiesOnAcid88"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-30T00:00:00.000Z",
    "score": 9.7,
    "comments": "Half-Life is a more cinematic and memorable game than most movies would ever dream of being.\nLets see.....its the best FPS ever.... ya I\u0027d say that is the definition of a \"good start\". Basically what Half Life does is what every other game in the industry could only dream of doing, create a game so deep and memo... ",
    "gameID": 0,
    "author": "darklord_toccsn"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "You\u0027ll never want to stop playing it.\nHalf-Life is one of the greatest PC games you\u0027ll ever play. I try to beat it at least every couple of months or so. The graphics were outstanding back then and not to shabby by today’s standards. The story is a very w... ",
    "gameID": 0,
    "author": "Benhenthorn"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-03-31T00:00:00.000Z",
    "score": 9.6,
    "comments": "Reality + Fiction \u003d Half Life\nHalf Life have become now the Grand Father of FPS ( First Person Shooter). Why? Simple, Half Life combine the movie style and game style to be a perfect game. The story is that our hero is a lab geek work for the Goverm... ",
    "gameID": 0,
    "author": "godsuki"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-01T00:00:00.000Z",
    "score": 9.7,
    "comments": "Awesome game if you ask me!\nI like this game as to be as well in my favorites list since its so absolutely fun!Again the variety of monsters and weapons are awesome to play many times through!This game is pretty challenging when your at this \"Blast... ",
    "gameID": 0,
    "author": "gta4ya"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-04-01T00:00:00.000Z",
    "score": 8.9,
    "comments": "Well Done Expansion Pack\nHalf Life Opposing Force is a very well done expansion pack to the already great Half Life. Rather than playing as Gordon Freeman players instead play as a soldier hunting down Freeman. Half Life developer Valve is doing... ",
    "gameID": 0,
    "author": "timbo0827"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-04-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "I think this is the best First Person Shooter ever...\nYes, the game is the best FPS there is GOOD: The graphics are awesome and the gameplay is the best there is, then there is the story and the challenges provided. The story is one of the first game stories that I have ... ",
    "gameID": 0,
    "author": "sudantha8527"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-04-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "I think sierra did a great job on this game!\nThis game is just awesome!The length of the game is about as long as HL1 and is just as fun!I own all the half-life life games and I like them all I spent about 100 hours or more because i beat the game and Im still play... ",
    "gameID": 0,
    "author": "gta4ya"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best PC game Ever!!!!\nThis has got to be by far the best PC game I have ever played.My computer doesnt work with Half-Life 2 so I\u0027m still not sure if thats ones better but either way this is an amazing game and you just have to buy it! I\u0027m am... ",
    "gameID": 0,
    "author": "stephant_6"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-04-03T00:00:00.000Z",
    "score": 9.6,
    "comments": "One of the best FPS games ever\nHalf-Life is a brilliant example of a great FPS and it does not dissapoint in any way. A large variety of weapons are in this game from the crowbar to the rocket launcher they are all useful in many situations even if s... ",
    "gameID": 0,
    "author": "Sly_Hippo"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-04-07T00:00:00.000Z",
    "score": 9.3,
    "comments": "A Ground-Breaking first-person-shooter and Ground-breaking game above all else.\nHalf-Life is a amazing, hardcore, and thrilling ride and one of the greatest FPS\u0027s ever. At the time the AI was outstanding and it was the first FPS to finally bring some sense into the genre, and even today many of the ... ",
    "gameID": 0,
    "author": "deepdreamer256"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-04-08T00:00:00.000Z",
    "score": 9.7,
    "comments": "One of the best pc games ever made.\nHalf-Life is the game that really started my interest in the FPS genre. Sure, I had played Doom and Quake before, but those games had no story and just didn\u0027t pull me in. And then along came Half-Life... with the most cl... ",
    "gameID": 0,
    "author": "pwngasm"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2006-04-09T00:00:00.000Z",
    "score": 8.4,
    "comments": "Wow , this is game is Explosive!!!! (In A good way)\nYEs. finally, when i rented this game i was amazed, it so out there and kool. Amazing graphics, and everything, sure its not a 10 but nearly. my advice to anyone is to buy this game and put it in your collection right... ",
    "gameID": 0,
    "author": "fratjoe18"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-12T00:00:00.000Z",
    "score": 9.7,
    "comments": "half-life is the first great fps i think if it wasen\u0027t for this game there would not be games like halo or farcry.\nhalf-life awwwwww a great classic i must have mspent one sleepless year of my life playing it first off the single player and multiplayer are great esspecialy the numerous mods for multi play and single the sound is just... ",
    "gameID": 0,
    "author": "yozee306"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 5,
    "date": "2006-04-12T00:00:00.000Z",
    "score": 8.6,
    "comments": "\"Opposing Force\", you say? Same Force as Gordon Freeman, if you ask me.\nOpposing Force is a missed opportunity. While the gameplay is top-notch, I couldn\u0027t help but feel a strong sense of deja-vu. Opposing Force casts you as a member of the army team that harasses Gordon Freeman throughou... ",
    "gameID": 0,
    "author": "nodham"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "Second Best Video Game in the entire World!\nThis game was fantastic. Valve surely knows how to make a video game. The plot was very immersive. For an action game it was very unique but good. It wasn\u0027t your typical action game. You didn\u0027t have standard levels where... ",
    "gameID": 0,
    "author": "andrewmarvosh"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-13T00:00:00.000Z",
    "score": 9.4,
    "comments": "This game is REALLY good! I didn\u0027t get to play it when it first came out, but even now, I still find it appealing!\nHalf Life... What can I say about this game except that is is really wonderful. I was browsing through my games and I found this unknown, kind of old game I never played. And I thought: Hmm, I guess it\u0027s worth trying. An... ",
    "gameID": 0,
    "author": "CantTouchThis12"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-04-14T00:00:00.000Z",
    "score": 9.2,
    "comments": "I love how the game happens all around you.\nHalf-Life is on the ps2 is an amazing game what i love the most is that there are no cut scenes instead the game happens all around you like if you were really gorden freemen it makes for a great gaming experience. Also ... ",
    "gameID": 0,
    "author": "LasPlagasHope"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-15T00:00:00.000Z",
    "score": 7.8,
    "comments": "A great thriller\nOF is a great game that delivered many thrills to my blood-shot eyes. You will not finish it as quickly as you first think. PROs New guns, new monsters, new mind-set, smooth movement CONs (truely hate the old assault wea... ",
    "gameID": 0,
    "author": "clipjammer"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-15T00:00:00.000Z",
    "score": 9.8,
    "comments": "What more can I say? A game in which you are fully immersed from start to finish. The game never stops!\nHalf-Life is totally brilliant. It is an fps with excellent atmosphere, gameplay, sound, storyline, and in some cases, hilarity! Although it is 8 years old now, I still play it all the time. There are so many secrets, th... ",
    "gameID": 0,
    "author": "Yamiyugi12345"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-17T00:00:00.000Z",
    "score": 9.2,
    "comments": "Half Life 1 - is a classic game even now. This game still kicks like a Bull going after that red flag!!! No oth\nWow this game is good; from the weapons to the enemies to the areas it is just good for a First Person Shooter (FPS). ... ",
    "gameID": 0,
    "author": "necro007"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-17T00:00:00.000Z",
    "score": 8.6,
    "comments": "Half-Life is one of the best PC games ever made.\nYes I only gave this game an 8.6, but that is only because I had to be fair with my score of different attributes. The graphics now suck of course, as this game is 8 years old - so I had to put a score of \u00273/10\u0027 for grap... ",
    "gameID": 0,
    "author": "TheN00binator"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-04-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "OMG get this game!\nHalf life is one of the greatest PC shooters ever made. Doom, Quake, Serious Sam... All of those games flippin blow compared to Half life. Half life has insane action, Puzzling situation, and what other game has Snarks! ... ",
    "gameID": 0,
    "author": "SnakeDevine"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2006-04-22T00:00:00.000Z",
    "score": 9.6,
    "comments": "The classic shooter that revolutionized the genre and remains unmatched in many areas.\nGOOD: Revolutionary game mechanics; great graphics for its day; incredibly immersive atmosphere; realistic and fantastic level design; good AI; awesome sound; great weapons BAD: Not enough music; repetitive scientist mo... ",
    "gameID": 0,
    "author": "bob_rulz"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-04-22T00:00:00.000Z",
    "score": 8.8,
    "comments": "A classic FPS now for the PS2\nI first played Half-Life on my old, crappy desktop the second week it was released. Through all the choppiness, and 3 minute load times (yes my computer was really that crappy) I found a game that will forever leave a m... ",
    "gameID": 0,
    "author": "eLLiptiX"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-04-23T00:00:00.000Z",
    "score": 9.4,
    "comments": "it charlies word in this instalment\nyou play noman feedman a scintist that was wokring o an expeiment that went qrong and the planet was over run by a bunch of alin monsters and you got to stop them of course this is the best fps on the pc to date and i ju... ",
    "gameID": 0,
    "author": "charlie345"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-04-23T00:00:00.000Z",
    "score": 9.3,
    "comments": "Quite possibly the best PC game ever made\nA revolutionry game is a game that has evolved past all other games to redefine a new taste of graphics, AI intelligence, sound, and fun in gameplay. One game that has done that more then any other game in years beside i... ",
    "gameID": 0,
    "author": "burninghawk"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2006-04-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "A revolutionary FPS that now has started it all!\nWhen it first came out back in1998, Half-life was defenetly the greatest FPS out there. When we looked at Doom and Quake 2 as great shooters, Half-life completly blew them out of the water and set a whole new standard fo... ",
    "gameID": 0,
    "author": "deactivated-5ace674c851c0"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-04-27T00:00:00.000Z",
    "score": 8.3,
    "comments": "okay lets get started with charlies word\nnow this game sorta got lost in translation it just wasnt as good as the orginal andi dknt know why but still still a good fps and gameplay it is great but it felt like they had a few problems with the control and maybe ... ",
    "gameID": 0,
    "author": "charlie345"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-04-29T00:00:00.000Z",
    "score": 9.8,
    "comments": "One of the most anticipating games ever to be made!\nTe game has a great gameplay and a storyline with great powerfull monster and the graphics are okay but as u play and u get deeper into the game ull think that uve gone so far that ure gonna finish it well dont be so mr ... ",
    "gameID": 0,
    "author": "sponny1"
  },
  {
    "helpfulCount": 31,
    "helpfulScore": 26,
    "date": "2006-05-03T00:00:00.000Z",
    "score": 9.7,
    "comments": "Half-Life is a game that defined and revolutionnized the first person shooter genre.\nThese days, first person shooters clutter the gaming world with unoriginal gameplay and very thin storylines. The announcement or release of a FPS is generally met with the words \"Ugh... Not again!\" by the gaming commun... ",
    "gameID": 0,
    "author": "NeoJedi"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2006-05-06T00:00:00.000Z",
    "score": 8.8,
    "comments": "Half Life is an instant classic and a game that any FPS gamers will enjoy alot and also non FPS gamers.\nWell you start off as a scientist who you would have never known that he could accomplish so much. His name is Gordon freeman and his Bad*ss weapon is a crowbar but of course that is just his first weapon and you can be... ",
    "gameID": 0,
    "author": "luckypool04"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-05-07T00:00:00.000Z",
    "score": 9.7,
    "comments": "The best PC fps i have played.\nHalf Life is one of the best fps you can buy on the pc, even though it is quite old now. The game is very challenging and the single player is really long. Just when you think your getting to the end of the game, your j... ",
    "gameID": 0,
    "author": "Gadget-Man"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-05-09T00:00:00.000Z",
    "score": 9.4,
    "comments": "A masterpiece that relys on action, an intense story, great graphics, and awesome gameplay!\nI have to say this before anything else, I love this game! Graphics in this game, amazing (for it\u0027s time)! The gameplay, along with the intense, creepy story, make a masterpiece that started the modern first prson shoote... ",
    "gameID": 0,
    "author": "xtrmgamer206"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-05-19T00:00:00.000Z",
    "score": 9.3,
    "comments": "The best FPS Comes in the PS2\nThe best FPS in the PC comes here half life is one of the games that you need to play ni PS2 i say this is the best the gameplay is fantastic.new elements like Decay you play with two players helping each other to trap ... ",
    "gameID": 0,
    "author": "foxhound1013"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 1,
    "date": "2006-05-20T00:00:00.000Z",
    "score": 9.3,
    "comments": "read this\nGeneral/Summary: Its not a really great FPS like Halo or others, but its still a fun game. I like the weapons and the lay out of the levels. The difficulty is nice and the story is pretty good. The control is well done,... ",
    "gameID": 0,
    "author": "sherifelgohary"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-05-21T00:00:00.000Z",
    "score": 9.8,
    "comments": "The ultimate game! Half Life was the first game that played me--i felt like i was in it!\nWhen ever someone asks what my favorite game is I think Mario 3, FF7, Doom, and Half Life. Each game revolutionized the industry, but Half Life made it fun! The other games are fun, no doubt, but Half Life actually makes... ",
    "gameID": 0,
    "author": "gabereal33"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-05-30T00:00:00.000Z",
    "score": 9.2,
    "comments": "Nonstop Action\nWhen I first opened up this game, I really thought I should\u0027ve got something else. I mean, riding the train for a minute listening to that woman talk, walking around hallways, reaching dead ends, flipping switches and go... ",
    "gameID": 0,
    "author": "pwnr"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-05-31T00:00:00.000Z",
    "score": 8.4,
    "comments": "Seriously, I thikn the game was pretty good bt not the best game on the PC.\nNow I know you people will just not recommend this review because you love this game too much. I think it was a great FPS and had great graphics for a game in 1998. I still thinkt he game sould have used some improvement... ",
    "gameID": 0,
    "author": "jacash3492"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-06-03T00:00:00.000Z",
    "score": 9.7,
    "comments": "The gateway to favorites like Counter-Strike and Day of Defeat.\nThese days, first person shooters clutter the gaming world with unoriginal gameplay and very thin storylines. The announcement or release of a FPS is generally met with the words \"Ugh... Not again!\" by the gaming communi... ",
    "gameID": 0,
    "author": "mx2-option"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 1,
    "date": "2006-06-04T00:00:00.000Z",
    "score": 7.1,
    "comments": "loved that game\namm ok so the game half-life is maby one of the best FPS(ferst person shooter)like every one said . . . but i don\u0027t really think like this i mean , he is realy nice with all the monsters and all but its a little dificul... ",
    "gameID": 0,
    "author": "spidster0"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2006-06-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "Half-Life, when it was released in the fall of 1998, completely rewrote the rules of the first-person shooter genre.\nAs a relatively unknown game developer (at the time), when Valve Software released Half-Life for the PC, the average consumer probably wasn\u0027t exactly sure what to expect when they got the oppurtunity to play the game. I ... ",
    "gameID": 0,
    "author": "gjb-sensei"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-06-19T00:00:00.000Z",
    "score": 9.8,
    "comments": "Almost the perfect video game.\nThere is one part of Half-Life that is not utterly enjoyable: Late in the game you travel to an alien world and are forced to perform a series of platform jumping maneuvers before you can get back to Earth. The control s... ",
    "gameID": 0,
    "author": "ironsoap"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-06-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "Half Life is first of one of the the Great Classic Standards of making a Near Perfect First Person Shooter.\nWhat can I say about this game, I loved it, years ago, and I still love it, Half Life 1\u0027s storyline was and is mysterious that it will evenually spawn one of the greating Gaming Trilogies we may ever see. The Graphi... ",
    "gameID": 0,
    "author": "Knight-Blade"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-06-24T00:00:00.000Z",
    "score": 9.3,
    "comments": "Great game, but not the best ever\nAll of these years I had heard the hype about Half Life. How it was called the best game of all time. I finally decided to pick up a copy to see if this was all true. Gameplay: Now this is where Half Life truly shine... ",
    "gameID": 0,
    "author": "ObviousMan"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-06-24T00:00:00.000Z",
    "score": 9.6,
    "comments": "Genre Defining game!!!\nIf ever there was a revolutionary, genre defining FPS then this is the one. For it\u0027s time this game really blew the FPS conventions out the window. The gameplay was so brilliantly done and so well put together that even... ",
    "gameID": 0,
    "author": "Craig_J"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-06-26T00:00:00.000Z",
    "score": 9.8,
    "comments": "Half-Life is just one of those games that changes the way you think about video games.\nIn a world where the fps genre was beginning to get boring one game came out that changed everything. Half-Life changed everything. It added a strong story, a like able character, and some of the best action in any game.... ",
    "gameID": 0,
    "author": "mjolnir334"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-06-27T00:00:00.000Z",
    "score": 9.0,
    "comments": "\" Full Metal Jacket + Half - Life \u003d Opposing Force \"\nOpposing Force is far the best expansion pack for the best game of the year which is Half - Life. In this game you play Coporal Adrian Shepard from U.S Marines Special Task Force. Your Mission is to find Gordon Freeman a... ",
    "gameID": 0,
    "author": "godsuki"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-06-27T00:00:00.000Z",
    "score": 9.4,
    "comments": "Half-Life... a game that everybody MUST own!\nAre you tired of playing the same game again and again, well in some situations you\u0027re obliviously not, but here\u0027s a game that you can play again and again and again and so it goes on... Half-Life was a completely new ga... ",
    "gameID": 0,
    "author": "Dope999"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 3,
    "date": "2006-06-29T00:00:00.000Z",
    "score": 7.9,
    "comments": "Revolutionary yes, but still overrated.\nHalf-Life was certainly revolutionary. Before it came on the scene most FPS were just that, shooters with minimal story lines, few scripted action sequences and little to no interaction with NPC\u0027s. I will the gave al... ",
    "gameID": 0,
    "author": "thesanfelippo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-06-30T00:00:00.000Z",
    "score": 9.4,
    "comments": "One of the best first person shooters ever made\nHalf-Life is simply an engaging, well polished masterpiece with few flaws present. *SPOILERS PRESENT* Gameplay: One of the most important things in a first person shooter is the controls and Half-Life does this ri... ",
    "gameID": 0,
    "author": "Lord_Fro"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-02T00:00:00.000Z",
    "score": 9.5,
    "comments": "Half-life is an excelent game with sharp graphics, an excelent story, and excelent gameplay. I reommend this to averyone\nI was extremely impressed with game. The graphics are very sharp and very vivid. The gameplay is excelent! The thing I loved most about this game is that it is all gameplay. There really is no cutscene. Everything happen... ",
    "gameID": 0,
    "author": "gamer11669"
  },
  {
    "helpfulCount": 14,
    "helpfulScore": 0,
    "date": "2006-07-02T00:00:00.000Z",
    "score": 6.6,
    "comments": "i expected somthing so much more than this\nthis game has won many awards and i dont know why and yes i know it came out in 1998 and isn\u0027t as good as modern games so i rated it as a old game and i can\u0027t see why people love it the game starts out ok and you can see... ",
    "gameID": 0,
    "author": "payne6705"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-04T00:00:00.000Z",
    "score": 9.6,
    "comments": "Though occasionally frusterating, HL1 has the rare ability to instantly draw you into the game.\nCurrent System Config (Yeah my machine sucks, so im letting you know so im not biast in my review as i do with any of my pc game reviews) Intel Pentium 4 2.20 ghz 640 MB of Ram ATI Radeon 9250 PCI By the time Ha... ",
    "gameID": 0,
    "author": "DeadParrot145"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "Half-Life is a game that changes the way you look at shooters, and raises the bar for shooters to be judged after it.\nHalf-Life is a FPS by Valve. It is also one of the most revolutionary titles to come out for the FPS in the past few years. I actually didn\u0027t play this game until a few years ago. Having played Halo 2, some of the gre... ",
    "gameID": 0,
    "author": "jbrown86"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2006-07-15T00:00:00.000Z",
    "score": 9.1,
    "comments": "Almost as good as Halo! For such an old game, that is amazing!\nApart from the graphics which are still pretty good, this game offers, thrill, a believable world, characters that make the gameplay feel more realistic, and what I find the most important, the sense that you are the peo... ",
    "gameID": 0,
    "author": "s2a"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-07-16T00:00:00.000Z",
    "score": 8.9,
    "comments": "Half Life was revolutionary in what it brought to the first person shooter gemes\nIn Half Life you play as Gordan Freeman but he isn\"t a musle bound thinkhead. He is a scientist how hasn\"t even shot a gun let aloun use one.The game starts out kinda slow Gordan is just going to work at the Black Mesa R... ",
    "gameID": 0,
    "author": "zz1234"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2006-07-18T00:00:00.000Z",
    "score": 9.4,
    "comments": "From start to finish, Half-Life keeps itself fresh, and has the rare ability to drag you into the game with it.\nHalf-Life (PC) Review By Andy Ryle (Ryle_Boy) Half-Life is one of the biggest franchises around, nobody can deny that fact, and with the expanding universe, flashy graphics, superior physics and breathtaking gameplay... ",
    "gameID": 0,
    "author": "Ryle_Boy"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-07-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "Ledgendary and Revolutionary! Quite possibly the best game of all time!\nEver since 1998, the FPS genre has never been the same. When a tiny little company called Valve created its first game, I dont think they could have ever imagined it to be such a huge success. Half Life single handedly... ",
    "gameID": 0,
    "author": "bildo2020"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-07-19T00:00:00.000Z",
    "score": 9.6,
    "comments": "the start of a great series\nHalf Life is an immersing and impressive title that is known to be an instant classic. Its story is amazing its gameplay, astonishing. And its graphics are pretty good. The AI is superb in every way and the diffulcity ... ",
    "gameID": 0,
    "author": "JakeGates"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-07-20T00:00:00.000Z",
    "score": 9.9,
    "comments": "Half-life is more than enough proof the the shooter belongs on the PC.\nHighs: Everything. Lows: I will get back to you on that. The first person shooter was born when id software developed its share-ware classic Wolfenstien 3-dee in 1991. Then two years later they made it the dominate g... ",
    "gameID": 0,
    "author": "DoctaStrangelov"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-07-21T00:00:00.000Z",
    "score": 9.7,
    "comments": "i loved this game cause of the new point of views and awesome weapons.\nI wouldnt consider this a expansion pack to half life cause it doesnt really expand it sorta fills in the blanks half life didnt. Gameplay 10/10 All half life games start with like a 10 min train or helicopter beginnin... ",
    "gameID": 0,
    "author": "lilazn_boi"
  },
  {
    "helpfulCount": 15,
    "helpfulScore": 2,
    "date": "2006-07-21T00:00:00.000Z",
    "score": 7.8,
    "comments": "Half-Life is the closest thing to a revolutionary step the genre has ever taken. Yeah right....\nI first got this game in a bundle with other games. I only bought this game because i wanted to know what happened before the combines took over. But this game did such a bad job portraying th story line. gameplay 8/10 ... ",
    "gameID": 0,
    "author": "lilazn_boi"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-07-22T00:00:00.000Z",
    "score": 9.2,
    "comments": "Half-life is the most revolutionary step the genre has taken since the original Doom.\nHalf-Life is one of the first FPS to offer an interactive, realistic environment. The graphics are great, the textures are varied,and the monsters look believable. The sound is good, and you will often find yourself jump... ",
    "gameID": 0,
    "author": "Etheral_Filcher"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-07-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "the granddaddy.`\nHALF LIFE IS KING. very simple. AI was ahead of its time, its the most immersive game ever (save possibly the sequel), and was the first fps to make you think. this game has puzzles, wit, story, action, and ITS NOT FORCE... ",
    "gameID": 0,
    "author": "o_p_e_n_s_i_l_o"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-08-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "not so much because of the actual single player game half-life, but the possibilities that it\u0027s engine brings.\nthis is the only review i\u0027ve written and is the only game that i can truly call perfect. so perfect, right now it\u0027s really hard for me to find words i don\u0027t want to sound like a fanboy, just hear me out. (im really no... ",
    "gameID": 0,
    "author": "sam_woo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-08-08T00:00:00.000Z",
    "score": 8.8,
    "comments": "One of the best of its time and still a great shooter today.\nI was a little jaded when I played through this game because I first played half life 2 on xbox and episode 1 on PC so I came into the original half life thinking for some reason that the graphics would be up to date, et... ",
    "gameID": 0,
    "author": "jtbeacham"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-08-08T00:00:00.000Z",
    "score": 8.4,
    "comments": "One of the best games from the PC to hit a platform.\nHi GreatGospel finally back with a new game that I haven\u0027t played to review. I\u0027ll start with saying that this so far has been one of the best PS2 shooters that I have played in awhile. Half-Life was first released on th... ",
    "gameID": 0,
    "author": "GreatGospel"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2006-08-09T00:00:00.000Z",
    "score": 8.0,
    "comments": "Overrated, but a great game nonetheless.\nHalf Life is known for being one of the greatest first person shooters of all time. While I don\u0027t think it fully deserves that title, it does bring a lot to the genre and is a great step. Gameplay/Story: You take contro... ",
    "gameID": 0,
    "author": "Katosepe321"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-08-11T00:00:00.000Z",
    "score": 9.2,
    "comments": "Opposing Force stays true to the proven Half Life formula, yet also improves upon it to become a great game on its own.\nWe all know how great the Half Life series is. Half LIfe 2 is probably my favorite game of all time, and the earlier half life games are just as good, without the great graphics that we are accustomed to today. Opposing ... ",
    "gameID": 0,
    "author": "jtbeacham"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-08-16T00:00:00.000Z",
    "score": 9.2,
    "comments": "One of the best FPS on the ps2, better than the pc version?\nJust to start, half life is almost better on the ps2 than on the pc, in many ways, It has added features; Decay namely, and it also has the same single player mode and the same everything else. I even got the playstatio... ",
    "gameID": 0,
    "author": "Hellfire93"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-08-16T00:00:00.000Z",
    "score": 8.5,
    "comments": "Half-life lives up to most of its legendary status but I wouldn’t call it the best shooter ever. That said it’s still a\nAh yes Half-Life. You see it referred to as one of the greatest of not the greatest shooters ever made. I don’t think it quite makes it there but it is a high quality product. The main problem I have with Half-Life is... ",
    "gameID": 0,
    "author": "evilrage"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2006-08-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the Greates First Person Shooters of all time. If you love FPS games, then you must have played Half Life.\nHalf-Life is a scifi first person shooter portraying a scientist named Gordon Freeman who happens to be part of a research experiment gone wrong and must fight his way through aliens and soldiers who seek to hide the tru... ",
    "gameID": 0,
    "author": "Suicidal_Healer"
  },
  {
    "helpfulCount": 22,
    "helpfulScore": 1,
    "date": "2006-08-24T00:00:00.000Z",
    "score": 6.5,
    "comments": "I\u0027m Sure It Was Great Back In The Day But It Cant Cut It With Today, But The Story Will Suffice...\nGameplay: Simple \u0026 Rather scripted, but hey, it was 1998, c\u0027mon. Graphics: Simply Put... 1998! Sound: Robotic \u0026 Clunky Value: Dont Spend More Than 10.00, get it for 5.00 if possible! I only bought the game beacuse ... ",
    "gameID": 0,
    "author": "Whitsel"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-08-28T00:00:00.000Z",
    "score": 8.7,
    "comments": "A great sci-fi shooter and definately good for its age.\nHalf-life as most of you all know was released previously in the late 90\u0027s for the PC. It was a great game then and when it came to the ps2 in 2001, it still is great for an early ps2 title. The story goes that you are a... ",
    "gameID": 0,
    "author": "nimmow"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-08-28T00:00:00.000Z",
    "score": 9.6,
    "comments": "If youre the type of person who goes for gameplay over graphics, then this game is for you *long*\nFor this review i will look at the game from its 1998 impression it had on me and how it fares today. As I said the graphics in this game arent the best by todays standards so those people who care so much about games... ",
    "gameID": 0,
    "author": "Kebn"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-09-02T00:00:00.000Z",
    "score": 9.7,
    "comments": "An amazing game for its time, it\u0027s still one of the best games of all time, eight years later.\nHalf-Life was released in October of 1998, and can now be purchased through the online game distribution service, Steam. It is also part of Half-Life 2: Game of the Year Edition. The game puts you in the shoes of Gord... ",
    "gameID": 0,
    "author": "Dark_Spartan796"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-09-07T00:00:00.000Z",
    "score": 9.3,
    "comments": "Nerve wracking and Awe inspiring!\nI just started playing FPS\u0027s about 9 months ago and Half-Life 2 was my first foray into the genre. Being exceptionally satisfied by the game I decided to go back in time to it\u0027s roots. After playing Half Life for 10 minu... ",
    "gameID": 0,
    "author": "corian_331"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-09-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "Most original 1st Person Shooter Games of all time, one of the few, and the proud!\nI never really was into 1st person shooters, mostly because I was convinced that they were the usual generic version of all shooters. Games that didn\u0027t appeal to me, until I got this game as a gift. When I started play... ",
    "gameID": 0,
    "author": "dillmundo"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2006-09-17T00:00:00.000Z",
    "score": 8.9,
    "comments": "Gordon Freeman is back and on the playstation 2.\nHalf Life for the PS2 is like a remake of the pc version of it. The playstation 2 version of it contain new features. The game has a co-op mode called decay. This could be played by one player or two players. In decay, y... ",
    "gameID": 0,
    "author": "GamerGoff"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-09-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "this game set the standards for all games and if it wasnt made games wouldnt be what they are today\neven playing this game today i am still amazed at how fun this is. valve managed to take the hunk of clay called videogames and mold it into a totaly new and improved masterpeice. Nowadays compared to modern 360 games th... ",
    "gameID": 0,
    "author": "acdcrocks14"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-09-28T00:00:00.000Z",
    "score": 9.3,
    "comments": "One of the first really great FPS.\nSorry to say this but my favorite genre is first person shooters, and I had never actually played the original Half Life. Ive played every good fps except for this one. The game is fantastic for its time and I know what ... ",
    "gameID": 0,
    "author": "Bulldawg8879"
  },
  {
    "helpfulCount": 35,
    "helpfulScore": 4,
    "date": "2006-09-29T00:00:00.000Z",
    "score": 7.4,
    "comments": "\u0026quot;Game of the Year\u0026quot;? pleasee......\nI have to make a shameful confession: I got stuck in this game at the beginning for a month since I couldn\u0027t figure out that I was supposed to mess up the lab experience. After that, it became hell. I played this game wh... ",
    "gameID": 0,
    "author": "insaneassclown"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-10-01T00:00:00.000Z",
    "score": 9.2,
    "comments": "What a game and almost 10 years old.\nWell just finished this amazing game. Have to admit that I haven\u0027t played this game never before. What a fantastic shooter. I think that the makers of Half Life never had the intension to make such a hype in the beginnin... ",
    "gameID": 0,
    "author": "HunterBruno"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-10-03T00:00:00.000Z",
    "score": 8.3,
    "comments": "More half life is always a good thing.. I think\nThe second expansion to Half Life that I played and fount it quite good. In this one you play as one of the marines sent in to contain the inncident and kill Gordon Freeman, but you wont spend any time looking for Dr. Fr... ",
    "gameID": 0,
    "author": "Bulldawg8879"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-10-14T00:00:00.000Z",
    "score": 8.9,
    "comments": "Old-school FPS that\u0027s still kicks major Butt!\nHalf-Life is an old game, but one of the greatest things about it is that it is just as enjoyable as any newer shooter, if you can oversee the arhcaic graphics. The gameplay is classic Half Life, with a combination of... ",
    "gameID": 0,
    "author": "mnkyking"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-10-16T00:00:00.000Z",
    "score": 9.3,
    "comments": "SPOILERS WITHIN\nYou play Half-Life as the voiceless Gordon Freeman, a scientist--or maybe \u0026quot;lackey\u0026quot; is a better term, judging from how the other scientists speak to him--at the secret government facility, Black Mesa. The game ... ",
    "gameID": 0,
    "author": "lordgodalming"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-10-23T00:00:00.000Z",
    "score": 9.2,
    "comments": "Intense, puzzling, even perfect?\nBefore Half-Life 2 came out, I decided to pick this game up to see what all of the fuss was about. I was immediately sucked in by the fast paced story and the intriguing puzzles. While the control is a little slippery ... ",
    "gameID": 0,
    "author": "mkaddict1"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-10-25T00:00:00.000Z",
    "score": 9.2,
    "comments": "anything with the ablity to blow the shat out of monsters, and friendlys etc, is a 10 in my book.... top notch\nWell, what else can i say? It rocked, there is certainly room for better graphics, but hey, its an older game, but put aside graphical problems, and it KILLS THE MARKET! and with the Blue shift High Def. pack, it makes t... ",
    "gameID": 0,
    "author": "doodeeman"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-10-25T00:00:00.000Z",
    "score": 9.8,
    "comments": "This game is so sweet, i wouldnt rate it the best game of all time, but it is certainly in the top 10!\nThis game revolutionized first person shooters. Its true, and if you dont believe me, ill prove it: This game managed to blend puzzle solving, platforming, and great first person shooting elements into one game. And it... ",
    "gameID": 0,
    "author": "eyebrowless"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 0,
    "date": "2006-10-28T00:00:00.000Z",
    "score": 6.3,
    "comments": "Since I already wrote a review for Half-life on PC, and this one includes Decay, I\u0027ll review Decay.\nHalf-life: Decay isn\u0027t the best at all in expansions, but at least it is a tad more entertaining than Blue Shift. This half-life expansion was only featured on PS2. Like Blue Shift, it doesn\u0027t introduce anything new b... ",
    "gameID": 0,
    "author": "Bgrotha"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-10-28T00:00:00.000Z",
    "score": 9.2,
    "comments": "Most expansion packs to games are weak, and don\u0027t add much. Opposing Force adds a whole new sha-bang.\nHalf-life: Opposing Force, is the first in line of the three Half-life expansions. However, Opposing Force, adds the most to the franchise of those 3 expansions. Opposing Force is simply astounding if you played throug... ",
    "gameID": 0,
    "author": "Bgrotha"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-10-28T00:00:00.000Z",
    "score": 9.6,
    "comments": "There has never been a better FPS.\nHalf-life, which came out on Halloween of 1998, has become and landmark in the history of FPS gaming. It was simply astonishing for its time. Half-life brought decent voice acting to the FPS genre, as well as interact... ",
    "gameID": 0,
    "author": "Bgrotha"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-10-29T00:00:00.000Z",
    "score": 8.9,
    "comments": "A game that shook the foundations of the FPS genre.\nIn the late 1990s, the Doom and Quake series of games ruled the roost. Then along came the upstart Valve with Half-life, which in short time became the standard all games hence forth where compared too. Valve\u0027s Haf-life ... ",
    "gameID": 0,
    "author": "cbsbyte"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-11-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "EXCELENT AND PERFECT!!!\nWell, I got this game a long time ago, and I can guarantee that the game is perfect... The graphics is good, but it can\u0027t be the best cuz the game is pretty old... But the gameplay is the element that is mostly responsab... ",
    "gameID": 0,
    "author": "PunkAss007"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-11-12T00:00:00.000Z",
    "score": 9.4,
    "comments": "Classic Gaming\nTheres a reason so many say this game was Revolutionary...because it was and is still considered to be one of the greatest games ever released. You are Gordon Freeman, a scientist who is involved in an experiment that g... ",
    "gameID": 0,
    "author": "Junglemanchild"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-11-15T00:00:00.000Z",
    "score": 9.0,
    "comments": "A brilliant story with awesome gameplay that put First Person Shooters on the map\nHalf-Life for the PC is probably one of the best old school first person shooters you can play. It really put first person shooters on the map and also has a amazing story to go along with its awesome gameplay. You pla... ",
    "gameID": 0,
    "author": "PatsFanVince"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2006-11-18T00:00:00.000Z",
    "score": 9.9,
    "comments": "Superb graphics and gameplay - the two things needed to make a perfect game. Half Life has them both.\nHalf – Life is one of the first FPS games ever made, and one of the first PC games that I’ve played. The game’s got over 50 (!) Game of the Year awards and is the best selling FPS to date. Although it was released around... ",
    "gameID": 0,
    "author": "deactivated-591754d3955ba"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-11-27T00:00:00.000Z",
    "score": 9.3,
    "comments": "Half Life is defenitly a revolutionary game, it\u0027s great!\nI got Half-Life on Steam and I was very impressed. It\u0027s and excellent game with great graphics for something from 1998, and the gameplay is great. I never really played the multiplayer because no one playing it anymore,... ",
    "gameID": 0,
    "author": "masterch_sniper"
  },
  {
    "helpfulCount": 42,
    "helpfulScore": 1,
    "date": "2006-12-09T00:00:00.000Z",
    "score": 5.7,
    "comments": "DUMBFOUNDED at how it\u0027s getting such unbelieveable hi scores!!!! it\u0027s still good, not great.\nPROS: story, especially the intro!! graphics (for it\u0027s time) suspense / concept CONS: Movement enemies (very forgettable) especially goin to the creatures home-world d... ",
    "gameID": 0,
    "author": "Fleetlordavtar"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-12-09T00:00:00.000Z",
    "score": 9.8,
    "comments": "The defining PC shooter.\nHaving become a gaming legend amongst action fans of PC and Consoles, the Half-life series has come to be known in good faith. Many of the reviews that were written when the game was first released however were not of a ... ",
    "gameID": 0,
    "author": "NZX666"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-12-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "Whatcha know about the WADS?\nI was first introduced to Half-Life when it first came out in 1998. I have been huge fan of Half-Life ever since. I played CS when it was first released, played hours of Team Fortress, and all the while loving it. This i... ",
    "gameID": 0,
    "author": "goonplatoon1032"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2006-12-10T00:00:00.000Z",
    "score": 8.9,
    "comments": "Half-life is a good old game...you can remember old times very well,More inside...\nHalf-life is a FPS game when you fight basically marines and allies. ---\u0026gt;Warning SpoilersSpoilers End_\u0026gt;Gameplay\u0026gt;_\u0026gt; Lots of weapons.-------\u0026gt;FUN Lots of ammo------------\u0026gt;FUN You have a lot of differen... ",
    "gameID": 0,
    "author": "trolemom"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2006-12-16T00:00:00.000Z",
    "score": 8.3,
    "comments": "Gordon Freeman for the kill\nGordon Freeman or i like to say freemen is a Straight smart scientist but diaster strike after a experiment gone wrong.. Graphic: dude this graphics is like really nice, the characters really outstand many awsome and... ",
    "gameID": 0,
    "author": "Noobberry"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-12-21T00:00:00.000Z",
    "score": 9.3,
    "comments": "you just never know what to expect .\nThe true marvel of this game is the enemies AI , i won\u0027t even start on what the soldiers and and monster can do . Their probably smarter than most of those who play this . Working together as a team , commando will easi... ",
    "gameID": 0,
    "author": "megjur"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2006-12-21T00:00:00.000Z",
    "score": 9.4,
    "comments": "Half-Life is an engaging and very impressive shooter, and is arguably one of the greatest PC games of all time.\nSince the release of Quake in 1996, many first-person shooters have failed to accurately capture the illusion of reality, which is an aspect all First-Person Shooters do their best to implement: either by bombarding the ... ",
    "gameID": 0,
    "author": "iminthepink"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2006-12-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the most entertaining and influential first-person shooters ever made...\nThere isn’t really much I can say in this, the 230th reader review for Half-Life at GameSpot, that remains unmentioned. Whether a gamer is only a casual FPS fan who only slaps leather for big-name titles, or a die-hard ... ",
    "gameID": 0,
    "author": "JOE714"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2006-12-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "OpFor contains plenty of new material to spice up an already highly-anticipated return to Black Mesa...\nAlthough it feels dismissive to simply recommend Opposing Force as a “more of the same, but different” extension of the much-loved original, the Half-Life pedigree was the only incentive I myself needed to revisit Black ... ",
    "gameID": 0,
    "author": "JOE714"
  },
  {
    "helpfulCount": 16,
    "helpfulScore": 4,
    "date": "2007-01-06T00:00:00.000Z",
    "score": 7.2,
    "comments": "Is this what it is all about? The amazing Half Life? I don\u0027t get it.\nHello, As I play this game, something seems to be done well. Not to mention that in the beggining it throws you at a train, which takes 10 minutes to get over, but hey! every game is like that. Before I start off, I n... ",
    "gameID": 0,
    "author": "xploded"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-01-11T00:00:00.000Z",
    "score": 9.2,
    "comments": "eight years later, and it\u0027s still one of the best games ever, for the genre, for the platform, and just in general.\nFirst off I would like to note that my scores take changes in the standards in video and audio performance into account, that being said it\u0027s still an amazing AAA game. The graphics are somewhat dated, but there still m... ",
    "gameID": 0,
    "author": "MronoC"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-01-13T00:00:00.000Z",
    "score": 9.4,
    "comments": "Yet another great Valve game.\nOpposing Force lets you play as one of the soldiers you had hard time killing as Gordon Freeman. It may confuse you at first but you will get used to it. Opposing Force puts you into the boots of Corporal Shepherd who is... ",
    "gameID": 0,
    "author": "Fixer38"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 5,
    "date": "2007-01-14T00:00:00.000Z",
    "score": 7.0,
    "comments": "I was really loving this game...\u0026quot;was\u0026quot; being the key word here.\nI\u0027ve been addicted to this game for a couple of weeks now playing it after I get out of work. I couldn\u0027t believe how good this game is for how old it is. The game is just massive. There are just tons of different areas t... ",
    "gameID": 0,
    "author": "starsdestroy"
  },
  {
    "helpfulCount": 33,
    "helpfulScore": 2,
    "date": "2007-01-17T00:00:00.000Z",
    "score": 3.5,
    "comments": "After all I heard about this game, I can\u0027t help but feel disapointed. I will never play this game again.\nI got this game when I bought the Holiday package that Valve put out this christmas season. Since it was the first game made out of the bunch I figured I should start with this one. The Gameplay of this game is... fr... ",
    "gameID": 0,
    "author": "Xymos"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-01-18T00:00:00.000Z",
    "score": 9.5,
    "comments": "Half Life is THE most realistic action game that still to this date does not show it\u0027s age even nine years after.\nHalf Life for a long time I heard it to be the best of all in action shooters.So I thought I`d try it out.And...it was a game that was the only one of its kind that let me feel that I really belong to the game.The times ... ",
    "gameID": 0,
    "author": "lightwarrior179"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-01-19T00:00:00.000Z",
    "score": 9.4,
    "comments": "While time can be told with the graphics, the game still proves to be one of the most interesting shooters of all time.\nTHE-MUCH-LOVED-QUICK-REVIEW Gameplay: 10/10: Simply top notch puzzles and shooting Graphics: 9/10: While today the textures are bland, at the time they were great Sound: 9/10: When the alarm goes off, you\u0027re into it ... ",
    "gameID": 0,
    "author": "lilt0193"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-01-28T00:00:00.000Z",
    "score": 9.0,
    "comments": "A faithful expansion to one of the best games of all time offers amazing moments of gameplay.\nWhile not the greatest game of all time, opposing force offers great gameplay and a story that is a different view of the Black Mesa incident. THE-MUCH-LOVED-QUICK-REVIEW Gameplay: 9/10: You don\u0027t know how good it is ... ",
    "gameID": 0,
    "author": "lilt0193"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-02-01T00:00:00.000Z",
    "score": 9.6,
    "comments": "How do you improve the aspects of the first-person shooter genre? The ways Valve did it with Half-Life is astounding.\nI will start by saying this: I love Half-Life. Ever since I first played it back in 2002, I had a fondness for the game. Now, about a few years later, I still play the darn thing. So for me to review this game is a littl... ",
    "gameID": 0,
    "author": "TonicBH"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-02-03T00:00:00.000Z",
    "score": 9.3,
    "comments": "one of the greatest fps of all time\nHalf-life is the ultimate PC FPS experience. Not only is it immersive, but the presentation, the style and solid gameplay all makes it a polished product. It\u0027s graphics (for that time) represented a convincing researc... ",
    "gameID": 0,
    "author": "zombieman666"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-02-08T00:00:00.000Z",
    "score": 9.2,
    "comments": "If sex had to be in form of a video game this comes pretty close. A true orgasmic stuff\nhalf-life started on the P.C. it was a game that was split into the types the story, decay, online and one more which I forget because I didn\u0027t own it. though some people will pick up the front cover of the game and say ... ",
    "gameID": 0,
    "author": "Cooljon"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-02-13T00:00:00.000Z",
    "score": 9.8,
    "comments": "behold, the game that would become one of the greatest game series of all the time\nwhen i first heard aboutt his game, i thought it would be some common game. but then it all changed when i started playing. i immediently grew immersed when i got on the train (the introduction) right there, my great jou... ",
    "gameID": 0,
    "author": "lordofwarX"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-02-17T00:00:00.000Z",
    "score": 9.6,
    "comments": "Opposing Force adds upon the already revolutionary game, and is arguably even better than its predecessor.\nHow can you possibly improve upon a commercially successful product like Half-Life, its almost impossible? How is it possible to improve upon a game that has set new limits in gameplay, technology and plain old fun? Amaz... ",
    "gameID": 0,
    "author": "iminthepink"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2007-02-18T00:00:00.000Z",
    "score": 8.3,
    "comments": "This game rocks!!!!!!!\nHalf- Life may be very old but I still like it, it is very scary especially when those creatures jump right onto your face. The first time I played this game it was at night and it was so so scary, the sound in this game... ",
    "gameID": 0,
    "author": "hutapamo"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-02-20T00:00:00.000Z",
    "score": 8.5,
    "comments": "Though it has not aged gracefully, still among the best ever.\nHalf-Life for the PS2 is among the best FPS\u0027s ever transitioned to a console. In this version, you get the original game, decay, and the VS mode. It gives you a chance to play as Gordon, but also as two of his fellow sci... ",
    "gameID": 0,
    "author": "sapphiremicx"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-02-25T00:00:00.000Z",
    "score": 8.9,
    "comments": "Possibly the most well known FPS of all time, and for a good reason\nI\u0027ll tell the turth, I had never played this game before I played and finished Half Life 2, and that was an experience that I originally though could never be beaten by another game, Im glad I played the first one now. ... ",
    "gameID": 0,
    "author": "Whacy_Mac"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-03-08T00:00:00.000Z",
    "score": 9.9,
    "comments": "The best expansion for a FPS ever! (at the time) :)\nAn expansion should outshine its predecessor.. thus giving the incentive to buy the expansion. Opposing Force (OF) not only lets you see what goes on \u0026quot;behind the scenes\u0026quot; as one would say to the HL1 story, but l... ",
    "gameID": 0,
    "author": "Alkpaz"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-03-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "Still one of the better FPS games!\nI recently replayed through HL1 and HL1 Source.. (yes both) what I found was that some errors were still there like getting stuck on an elevator or a clipping issue in \u0026quot;On a rail\u0026quot; these errors were there at rel... ",
    "gameID": 0,
    "author": "Alkpaz"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-03-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "The Game that forever changed The FPS Genre\nI remember when this game first came out my mom got it for me for Christmas in 98. That was when Video cards started to get popular and had to purchase one just to get the game to run. I was floored by the graphics at th... ",
    "gameID": 0,
    "author": "Miniguzzler"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-03-11T00:00:00.000Z",
    "score": 9.0,
    "comments": "The greatest FPS ever created.\nGames like Doom and Wolfenstein started it off and then the next titles like Duke3D tried to carry that success on but not until Half-Life did we get the first true revolutionary 2 gen FPS title. It set the standard f... ",
    "gameID": 0,
    "author": "Terrorantula"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2007-03-13T00:00:00.000Z",
    "score": 9.6,
    "comments": "A beautiful side story to the original Half-Life that shows the game a soldier\u0027s perspective...\nHalf-Life: Opposing Force is not an mission pack, nor is it an expansion pack. In fact, its a whole game in it self, from the view point of Adrian Shepherd, one of the US Marines sent to clear Black Mesa of the Alien inf... ",
    "gameID": 0,
    "author": "Suicidal_Healer"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-03-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "Exhilarating\nI still remember this game when my brother got it in 1998. The graphics were considered very good at that time so I\u0027ll give it a Ten. The AI was good, when you throw a grenade the soldiers will all scatter. The zombies w... ",
    "gameID": 0,
    "author": "lokyou"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-03-14T00:00:00.000Z",
    "score": 9.2,
    "comments": "10 line review of Half-Life\nGameplay: 9/10 The little physics is cool, AI is good but sometimes stumbles. Graphics: 9/10 A stunning variety of textures and character models. Sound: 9/10 The ambience is excellent, the sounds are good but get ... ",
    "gameID": 0,
    "author": "blackleech"
  },
  {
    "helpfulCount": 26,
    "helpfulScore": 3,
    "date": "2007-03-15T00:00:00.000Z",
    "score": 6.5,
    "comments": "Whilst it is a revolutionary game for its time, Half Life has not aged gracefully...\nIts characters are repeated, textures are blurred and sound should be improved. The story has been called epic, I call it average. You play as a man called Gordan Freeman, you think your day is going to be normal, but it... ",
    "gameID": 0,
    "author": "forever_blank"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-03-17T00:00:00.000Z",
    "score": 8.1,
    "comments": "Oppossing Forces gives Half Life the much needed depth, that was sadly missed in the revolutionary, but average original\nWell here we are again, returning to the \u0026quot;Black Mesa\u0026quot; research facility we once weathered through. Except this time we see the chaos through a different point of view. Subject: Adrian Shephard - 22 Status: D... ",
    "gameID": 0,
    "author": "forever_blank"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-03-26T00:00:00.000Z",
    "score": 9.1,
    "comments": "Even with such revolutionary game play and ground-breaking A.I., can there be any less of a story?\nThe Good: Well architected 3D environments; Good AI; Immersive story telling; Clever puzzles; An enemy that actually \u0027hears\u0027 you. The Bad: Repetitive character models; lackluster plot; Easy to get lost in certain area... ",
    "gameID": 0,
    "author": "darkDemyze"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-03-26T00:00:00.000Z",
    "score": 8.7,
    "comments": "The king is still alive 9 years later.\nI bought my first Copy of HalfLife almost 9 years ago. It\u0027s better today for many reasons. When you buy HL you get about 8 games and CS and TFC can keep you BZ for months if you never played it for $20. i still play it ... ",
    "gameID": 0,
    "author": "peacebringer"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-04-05T00:00:00.000Z",
    "score": 8.4,
    "comments": "Very nice (expansion) to Halflife\nHalflife was a blast, then they released opposing force and oh my it was a great game. In HL opposing force, you dont play as Dr. Freeman but as a soldier. You will start out at bootcamp, which is really nice and prese... ",
    "gameID": 0,
    "author": "woef"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-04-06T00:00:00.000Z",
    "score": 9.1,
    "comments": "It may not be pretty, but Half Life has maintained its place at the top because of fun factor and nostalgia.\nHalf Life.......... It has been a while since the original has been in the spotlight. Not that it is a bad game, just that others have taken away some of the roomy living quarters that Half Life used to have. However, if... ",
    "gameID": 0,
    "author": "w00tcolors"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2007-04-07T00:00:00.000Z",
    "score": 9.5,
    "comments": "if you have a gaming computer and don\u0027t own this game, you suck and you will die alone\nThis game, especially whe nit came out, was the standard that every other game maker looked to to make their games better. it is a beacon of perfection that guides stray programmers to success and fame and fortune and g... ",
    "gameID": 0,
    "author": "ryguybond"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2007-04-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "Almost a decade after it\u0027s release, Half-Life Maintains it\u0027s position at the top of the genre\nHalf-Life is truly one of the most immersive games ever created. The entire game is presented from the bespectacled Gordon Freeman, without any of the cutscenes, text briefings, or level breaks that the genre was so fond... ",
    "gameID": 0,
    "author": "Mediocre_man90"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-04-18T00:00:00.000Z",
    "score": 9.2,
    "comments": "This is a classic game with great online play; this is a great game and one you shouldn\u0027t turn away from.\nHalf Life was the beginning of a great series of games and the graphics where amazing at that time with a high scare level that will have you truly sucked into it and you\u0027ll love every minute of it. This has to do with ... ",
    "gameID": 0,
    "author": "DzeTSNotorious"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-04-18T00:00:00.000Z",
    "score": 9.8,
    "comments": "It doesn\u0027t get any better than this!\nHalf-Life is probably the single greatest PC game ever. Sure the FPS formula has been done to death, but with Half-Life, it goes in a completely new direction. No longer do we have levels that give your statistics on how... ",
    "gameID": 0,
    "author": "NitroDriven"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2007-04-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "One Of The Best PC FPS Games Ever Made\nTake control of a scientist charged with destroying the alien invasion force that arrived, courtesy of government experiments gone wrong. Of course, in the post-X-Files world, there\u0027s additional bad guys in the form of f... ",
    "gameID": 0,
    "author": "RussianYulia17"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-04-27T00:00:00.000Z",
    "score": 9.2,
    "comments": "Half-Life is such a wonderful game for a 1998 game.\nI was playing through this game in 2006 and still after all this time, it felt like an awesome game. It\u0027s so good for a 1998 game. There were no good first person shooters back then and Half-Life changed it all with it\u0027s... ",
    "gameID": 0,
    "author": "Triple_H90"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-05-22T00:00:00.000Z",
    "score": 9.0,
    "comments": "Half Life - The best shooting game of the 20th century\nI first played half life round a friends house. I loved it, the constant anticipation got me addicted from the very beginning. Every day for a month I went round his house to play it. That was until i bought it. The s... ",
    "gameID": 0,
    "author": "chromearrowz"
  },
  {
    "helpfulCount": 34,
    "helpfulScore": 3,
    "date": "2007-05-22T00:00:00.000Z",
    "score": 6.5,
    "comments": "The only FPS to make me want to vomit. And all those stupid jumping puzzles! Half Life 2 can do without a back story.\nAfter playing most the popular FPS games right back to the original Wolfenstein I\u0027d always looked back and wondered how I\u0027d missed Half Life. With Valve packaging up Half Life 2 now was the perfect time to catch-up, h... ",
    "gameID": 0,
    "author": "HeavyBinary"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-05-25T00:00:00.000Z",
    "score": 8.5,
    "comments": "CLASS OF ITS OWN !\nHalf life is one of those game those games which really helps you get rid of stress by beating the **** out of aliens Half-Life utilized scripted sequences, which instead of cutscenes, enables the character to be in the... ",
    "gameID": 0,
    "author": "slow_death"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2007-05-28T00:00:00.000Z",
    "score": 9.4,
    "comments": "Half Life is one of the greatest steps mankind has ever taken in the FPS department...\n(Note: Marks given for graphics and sound are based on what was available at the time of release; 1998) Half-Life is a revolutionary title in a genre that the PC does best: First Person Shooters. I love FPS and this i... ",
    "gameID": 0,
    "author": "ChestyMcGee"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-06-04T00:00:00.000Z",
    "score": 8.6,
    "comments": "Innovative\nThis is one of the best games i have ever played, it has a good story and the charecters are also good. Hardly any games are good these days, but this game is still good for being released in 1998. The FPS in this game R... ",
    "gameID": 0,
    "author": "mosa911"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-06-09T00:00:00.000Z",
    "score": 9.9,
    "comments": "Play it or die!\nA A A A AAAAAAA A A A A AA A AA A a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a a aa a a a a a a a a aa a a a a a a a a a a a a a a a a a a a a a a a a a a a a a aa a a aa a a a a aa a a a a a a... ",
    "gameID": 0,
    "author": "tanns13"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 0,
    "date": "2007-06-14T00:00:00.000Z",
    "score": 8.3,
    "comments": "Nice game with BAD story.\nGameplay: This is really good , the campaign has kick ass maps and the MP does so! and its really good to play, enjoyable, You should get this one if u want a low-req BADASS FPS! Every single puzzle its enjoyable and coo... ",
    "gameID": 0,
    "author": "FPSeXtreme"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-06-15T00:00:00.000Z",
    "score": 8.2,
    "comments": "ok here we go again\nim a big half life fan so i wanted to get this game... not in stock in most places like ebgames and walmart... so i found it at a local movie gallery and just had to rent it... never played single player since ive beaten... ",
    "gameID": 0,
    "author": "someone111"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-06-24T00:00:00.000Z",
    "score": 9.6,
    "comments": "One of the best games of all time\nIt\u0027s hard to imagine where the first person shooter genre would be nowadays if Half-Life was never released. In a time when the genre typically only pushed graphics and left story-telling and immersion into the world to ... ",
    "gameID": 0,
    "author": "BenderUnit22"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-06-26T00:00:00.000Z",
    "score": 9.6,
    "comments": "Anomalously great\nThis game reminds us all why we love shooters so much. Playing Half LIfe is like being in a good sci-fi movie. This impression is immediately conveyed as instead of passivel watching a cutscene to introduce you to the st... ",
    "gameID": 0,
    "author": "RebornInFlames"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-07-05T00:00:00.000Z",
    "score": 9.2,
    "comments": "Immersive plot. Good engine up to offer a great modification made by players/modders worldwide.\nAs first you play this game, it\u0027s really a great experience. The plot, the environment, the easyness of gameplay and the fast-passed action offers many a great time. Gameplay is easy getting aquainted with. There are com... ",
    "gameID": 0,
    "author": "norton158"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-07-05T00:00:00.000Z",
    "score": 9.3,
    "comments": "This is one of those games that proves graphics isnt everything and that it will always be a classic!\nThis is a game that mixes great story,plot,atmosphere and gameplay, This was the FPS that made me fall in love with the genre. The \u0026quot;feeling\u0026quot; to Half-life is what makes it so distinct.You play as Gordan Freema... ",
    "gameID": 0,
    "author": "Yari-ken"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2007-07-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "half life is the best shooter ever made\nI played this game for the first time in may 1999, and i have so many great memories 1.climbing out of the elevator shaft to confront the military, two gys one who flanked me, and the other who threw a grenade 2. k... ",
    "gameID": 0,
    "author": "mestizoman"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-07-08T00:00:00.000Z",
    "score": 9.3,
    "comments": "Crowbars, crates and critters.\nGameplay: 9/10 PC gaming, and especially the first-person shooter genre, can be looked at as two eras: before Half-Life and after Half-Life. The ‘run and gun’ approach versus the ‘run and gun and think’ approach. Whil... ",
    "gameID": 0,
    "author": "totalgridlock"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2007-07-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Outstanding game that still rates as one of the best games of all times.\nI got Half-life when I first got my PS2 but put it donw shortly thereafter becasue frankly I was lousy at the controls. I have since gotten better and have gotten back into it. I have played for hours and hours and I\u0027m ... ",
    "gameID": 0,
    "author": "Cas533"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-07-11T00:00:00.000Z",
    "score": 9.6,
    "comments": "Another lover\u0027s review.\nBack in 1999 I bought my first computer and a couple of games, I didn\u0027t really knew anything about HL yet. So I installed it, and got it running. At first it looked ok, I was flying trough some sort of tunnel of some ki... ",
    "gameID": 0,
    "author": "oldbluekid"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-07-16T00:00:00.000Z",
    "score": 9.6,
    "comments": "This is one FPS you\u0027ll always come back to and never let go. Yeah, it\u0027s that good.\nI got Half-life around two years after it was released. I liked it a whole lot, but I always played the expansion pack Opposing Force because it was easier. Now I see how great this game really is. It was an advanced gam... ",
    "gameID": 0,
    "author": "Bigbomb2"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-07-17T00:00:00.000Z",
    "score": 8.9,
    "comments": "Created the way for FPS games.\nHalf-life is a game that just draws you in. With its great graphics and sounds, it just creates an atmosphere that gets you hooked. The games starts off a little slow, but in no time you\u0027ll be gunslinging your way past... ",
    "gameID": 0,
    "author": "liquid_ninja"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-07-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "This was one of the first and greatest games I ever played and still to this day, in 2007, still is.\nThis was one of the first and greatest games I ever played and still to this day, in 2007, still is. The intro, enemy ai, weapons, and characters were just great, but the story was the best part of the game that intrigu... ",
    "gameID": 0,
    "author": "skate411"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-07-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "Valve starts a revolution... they better not stop.\nWolfenstein set the foundation, Doom gave it some flare, Quake showed what you can get out of gore, and Half-Life revolutionized it all. Before Half-Life busted in the picture, Shooters threw you into some complex with v... ",
    "gameID": 0,
    "author": "afjhk_58"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-08-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "this game is like System Shock 2 in both linearity and content.\nwhile playing this I played System Shock 2 simultaneously and noted that HalfLife is by far more successful of the two, ignoring the commercial success or populairity of those games. HalfLife while showing its age in tis... ",
    "gameID": 0,
    "author": "deactivated-59c574bab7628"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-08-05T00:00:00.000Z",
    "score": 9.8,
    "comments": "ALL FPS\u0027 preceeding it immediately became obsolete; and all that since followed have felt it\u0027s influence!\nI\u0027m not sure what else can be said about this truly revolutionary game, so I\u0027ll keep this short and to-the-point... ANYONE who rates this game less than a 9.0 (out-of-10) is either brain-dead, lacks any knowledge of (or ... ",
    "gameID": 0,
    "author": "JackBurton"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2007-08-07T00:00:00.000Z",
    "score": 9.5,
    "comments": "A response to the bad reviews posted.\nI\u0027m not going to recount all the aspects of the game. With over 200 user reviews on this site I think it\u0027s been covered. I consider the game an instant classic and one of my all-time favorites. It is well deserving of it... ",
    "gameID": 0,
    "author": "grommyfrog"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2007-08-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of a kind; can\u0027t be remade!\nWow! That was my first reaction when I got my hands on Half-Life. Even with the old-gen graphics, this game is the bomb! Well the gameplay is great. With lots of weapons to choose from, from teleportation guns to the sim... ",
    "gameID": 0,
    "author": "ilikemuffins000"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-08-18T00:00:00.000Z",
    "score": 9.5,
    "comments": "Probably the best FPS in the 1990\u0027s\nIf your looking for an FPS game from the 1990\u0027s, this is the game for you. The graphic\u0027s are probably the best I have seen in a classic FPS game to date. Some things in the game, graphic wise, are bad. Gameplay is ... ",
    "gameID": 0,
    "author": "gmreedy"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-08-23T00:00:00.000Z",
    "score": 9.5,
    "comments": "Half-Life took what Unreal did and pushed it beyond boundaries, and beyond sanity.\nTo write a review for Half-Life is like trying to inform people just how awesome and revolutionary a graphics accelerator card was. We all know it was the turning point of the genre, it was a great game to play with fan... ",
    "gameID": 0,
    "author": "TUnified"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 4,
    "date": "2007-08-29T00:00:00.000Z",
    "score": 9.0,
    "comments": "Half-Life: Opposing Force\nAs regular PC Gamer readers will know, our reviews section is reserved for complete games, while expansion packs are left to the scrutiny of Tom McDonald\u0027s Extended Play column. In fact, Half-Life: Opposing Force is only... ",
    "gameID": 0,
    "author": "majesticcryx"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-09-01T00:00:00.000Z",
    "score": 9.5,
    "comments": "Still the best FPS ever created that revolutionized the genre and amazed millions of people.\nNo FPS game since Half-Life has been better and not even Half-Life 2 could live upto this wonderful game. Before this FPS games were short and just lots of short levels that you\u0027d load up into different locations. Half-L... ",
    "gameID": 0,
    "author": "Grantelicious"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-09-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game made me sweat, while my computer stalled. I had a pretty old pc then,but all though i had to wait minutes to..\nload, i still finished it 5 times on that PC. I don\u0027t think that there is somebody that doesn\u0027t know the story of HL, but for those who don\u0027t here is a short intro: You are a scientist, Gordon Freeman, in a secret facil... ",
    "gameID": 0,
    "author": "JunK-tion"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-09-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "As an \u0026quot;addon\u0026quot; to Half-Life, I wasn\u0027t expecting much but Gearbox made a flawless mission pack that is just as e\nI have to say when I first heard about Opposing Force, I wasn\u0027t too thrilled with a 3rd party doing the official expansion mission pack for Half-Life. Needless to say, I was surprised. Opposing Force has a military fe... ",
    "gameID": 0,
    "author": "theheavydrinker"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-09-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "How would you handle an experiment gone wrong, a government cover up, and a creepy and ominous \u0026quot;Man in Black?\u0026quot;\nWelcome to the Black Mesa Research Facility. With that one sentence, the entire world of video gaming as we knew it changed forever. Gordon Freeman became something of gaming legend. Everyone knows at least one aspect... ",
    "gameID": 0,
    "author": "thatguy0130"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-09-17T00:00:00.000Z",
    "score": 9.0,
    "comments": "Halo may have brought me into the FPS but Half Life made me a Gamer.....\nGameplay: You a scientist did something wrong, and then BOOM, Aliens Perfect setting for some Geeky nerd guy with a crowbar to kick some alien ASS! The game, although a 1999 kinda game is the FPS shooter! You got your ... ",
    "gameID": 0,
    "author": "Hermitkermit"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-09-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best First Person Shooters of its time and is still one of the best.\nOne of the best First Person Shooters of its time and is still one of the best. One of the first FPSs with an intriguing storyline, its not just some \u0026quot;kill all the monsters and you win\u0026quot; type games. It introdu... ",
    "gameID": 0,
    "author": "Adam-117"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-09-22T00:00:00.000Z",
    "score": 9.5,
    "comments": "a immersive game that was so revalutonary for its time that it changed games for ever\nif it wasn\u0026amp;#8217;t for half-life then we would not have scripted sequences. That means instead of cuts it is actually using the game and making characters do set things and you can move around and play at the same t... ",
    "gameID": 0,
    "author": "dan171717"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-10-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "this game is a instant classic and I still play today\nHalf life 1 is one of the greatest games of all time and is given full credit for it. This game was a revolutionary step in pc gaming. The graphics at the time were amazing and so was the game play. The story in half lif... ",
    "gameID": 0,
    "author": "fat_cats_4_life"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2007-10-02T00:00:00.000Z",
    "score": 9.5,
    "comments": "Half-Life\nYou\u0027ve got to hand it to these guys. Valve Software is a start-up, a relative unknown, with no track and, really, no business making such a mighty game. But mighty it is, the best single player shooter I\u0027ve ever played. ... ",
    "gameID": 0,
    "author": "majesticcryx"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-10-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "10 years ago it was the greatest shooter the world had ever seen. Today it remains the pinnacle of first person adventur\nSome games age well, others have now been eclipsed. Previous trend setters have been bettered and left obsolete in the face of the new generation of gaming. Sometimes however there are games that do it right the first ti... ",
    "gameID": 0,
    "author": "samusarmada"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-10-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "Greatly Different\nIn a world where you play as a common worker, Gordon Freeman, you start off your normal day going to work at the Black Mesa research facility. Then every thing takes a turn for the worse, your asked to put a specimen in... ",
    "gameID": 0,
    "author": "Dementedioser10"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-10-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "Half Life, best FPS.\nI\u0027ll try to be quick and clear. The story of the First Person Shooters is divided by two. Before Half Life and after Half Life. Maybe it\u0027s not the better on graphics but, beginning with original and fantastic enemies who... ",
    "gameID": 0,
    "author": "vladimirgm"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-10-18T00:00:00.000Z",
    "score": 9.0,
    "comments": "It\u0027s even worth playing in 2007 if you never played it before.\nI played it for the first time in April of 2007. It was still great. Of course, I didn\u0027t get the feel of revolutionary while playing it, but it was still very fun. Great weapons, story, enemies, and puzzles. People sti... ",
    "gameID": 0,
    "author": "FriendlyCrono"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-10-24T00:00:00.000Z",
    "score": 9.0,
    "comments": "man, definitely a darn cool game even for its age.\nyeah, i decided to pick this one up for a little history lesson. man, what a great game! REALLY loved it quite a bit though it\u0027s definitely old school. For anyone looking for a game that can make it through the tests ... ",
    "gameID": 0,
    "author": "TheBatFreak777"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 0,
    "date": "2007-10-29T00:00:00.000Z",
    "score": 7.5,
    "comments": "Pretty good for a nine year old game.\nI can easily recommend this game if you have never played it, and It may be hard to really put in perspective nine years out, but given all the hype and high ratings I was a little disappointed. I\u0027m sure it was great whe... ",
    "gameID": 0,
    "author": "jdavidb"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2007-11-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "Where did good games like this go?\nWow i never played this game but i have seen Halflife being played by my friends on their outdated computers at the time. Plus this game is so old now Halflife 2 has an orange box out now lol. I also seen this game onlin... ",
    "gameID": 0,
    "author": "Geminidevine"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-11-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "This was a genre defining game.\nAhh, we all remember Half Life. If you\u0027ve not yet played it, this may contain a bit of spoilers, so be wary. Assuming you\u0027ve played HL2 though, then don\u0027t worry too much. First thing I thought when I started up Half... ",
    "gameID": 0,
    "author": "Fauxjangles"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-11-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "Basically the coolest shooter ever. The game that breathed new life into the endless corridor shooter genre.\n1998\u0027s Half-Life is truly a masterpiece of gaming that unfortunately has not reached enough of the masses. You needed a computer (expensive) as opposed to an inexpensive N64 to play Ocarina of Time, and as a result only ... ",
    "gameID": 0,
    "author": "zubidoo"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2007-11-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "MMMM\nI\u0027ve had this game since before Christmas, but tearing myself away from it to write these words has been something of a problem. Half-life is, you see, not your average run-of-the-mill 3D action shoot-em-up. Not by a lon... ",
    "gameID": 0,
    "author": "gate131966"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2007-11-21T00:00:00.000Z",
    "score": 8.5,
    "comments": "Opposing Force is a certainly a fun game, though hard at times.. (contains spoilers)\nIn this expansion pack for the original Half Life entitled Opposing Force, you play as Corporal Adrian Shephard. You and your fellow US Marines (Hazardous Environment Combat Unit division) are sent to the Black Mesa Rese... ",
    "gameID": 0,
    "author": "spoogan"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-11-22T00:00:00.000Z",
    "score": 9.0,
    "comments": "The revolutionary Half-Life set the standard for subsequent first-person shooters.\nAs each new section or level is reached, the game pauses to load it, making for massive, seamless environments. Nearly all levels are located in or around the Black Mesa Research Facility, including subterranean railroad... ",
    "gameID": 0,
    "author": "red_raven01"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-11-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best action based creation there is!\nCharge up your hazard-protected suit and once again step forward to face new species of Zen. They can roam in water, air, toxic waste and even in human bodies. Be one of the survivors of the terrible scientific project, ... ",
    "gameID": 0,
    "author": "Cmpunmu3"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2007-11-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "Yes, it is 2007 and yes, I just played though Half-Life for the first time.\nI felt compelled to make the first game on my new PC a classic. One I felt guilty about not having played. This isn\u0027t my first foray into PC gaming but I still am relatively new. This was probably the perfect game to ... ",
    "gameID": 0,
    "author": "jdknight21"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-12-05T00:00:00.000Z",
    "score": 9.0,
    "comments": "Many FPS games don\u0027t even get close to being as fun as this little gem.\nHalf-Life is a name that has been thrown around a lot lately, since Half-Life 2 was released and its subsequent expansions. Many people never had the opportunity to see where this series began (including myself), and tho... ",
    "gameID": 0,
    "author": "Bowser05"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-12-05T00:00:00.000Z",
    "score": 9.5,
    "comments": "Excellent game, good balance and tough AI, some very minor bugs but were fixed.\nThis game is one of the first to portray a story in a smooth and convincing way. The weapons are nicely balanced with no uberpowerful weapons to blow though the campaign. First time is the best though playing at midnight... ",
    "gameID": 0,
    "author": "Lord_Dementia"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-12-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the most greatest and most tresured pc game of all-time...\nI got this game in 1999 and the graphics were just unbelievable when I first saw half-life. Actually pretty much everything amazed me in this game back in 1999. I sounds still sound great when I play the game. The gamepl... ",
    "gameID": 0,
    "author": "00chaos8"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2007-12-27T00:00:00.000Z",
    "score": 8.5,
    "comments": "An alternate perspective to the events of Half-Life, this expansion does a great job of mixing things up.\nIt is often easy for a company to create a mediocre expansion pack for a successful game, but don\u0027t tell that to the creators of Opposing Force. This game is full of the same kind of fun that made Half-Life such a great ... ",
    "gameID": 0,
    "author": "Bowser05"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-01-01T00:00:00.000Z",
    "score": 9.5,
    "comments": "Simple things are sometimes the core of great and true pieces of art.\nThis is my first review ever and i do it because of the respect i hold for this great game. A have to say that this is the first FPS i have ever played and it is the one that made me play shooters in the first place. ... ",
    "gameID": 0,
    "author": "visanbogdan"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-01-01T00:00:00.000Z",
    "score": 9.5,
    "comments": "Expect the unexpected with Half-Life.\nHalf-Life is a FPS developed for the PC back in 1998 that was ported to the PS2 in 2001. If you haven\u0027t had the chance to play it on the PC then you can on your PS2. Now, let me say that FPS aren\u0027t my cup of tea, but som... ",
    "gameID": 0,
    "author": "Sim_genius"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 0,
    "date": "2008-01-02T00:00:00.000Z",
    "score": 7.0,
    "comments": "half-life is good but not very thrilling.check your purse mate and your brain.if it is in short supply ,i cant help\ncastle wolfenstein is lot better when u compare it with half-life.but it is the gameply,the feeling of being involved in the real time shooting with hideous and creepy enemies always looking out for you.scary dear,very s... ",
    "gameID": 0,
    "author": "mithu1234"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-01-06T00:00:00.000Z",
    "score": 9.5,
    "comments": "Found Platinum Collection for $5. Almost didn\u0027t play it due to content. Glad I did; might have passed on sequels.\nI found the Platinum Collection for 5 bucks. Played it for about an hour. Some of the content bugged me, so I put it down. Several weeks later, with nothing else to do, I picked it up again, and have played it several ti... ",
    "gameID": 0,
    "author": "jeffgarrett"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-01-20T00:00:00.000Z",
    "score": 9.5,
    "comments": "One of the Greatest! Dont like HL? DEAL WITH IT\nI don\u0027t think anyone out there will try to argue too much with me when I say Half-Life is one of the greatest FPS games of all time. And for once, I won\u0027t try to argue with them either. This game really is great. From th... ",
    "gameID": 0,
    "author": "C0VAWLIMIT"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-01-26T00:00:00.000Z",
    "score": 9.5,
    "comments": "The best in the last decade!\nThe game that evolutionized the PC game market. Half-Life is the known to be the best PC game EVER. With the hundreds of mods and expansions, Half-Life lives on. Half-Life has it all. The Best storyline, the best graphic... ",
    "gameID": 0,
    "author": "mircea_calarasu"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-01-31T00:00:00.000Z",
    "score": 8.5,
    "comments": "It may not impress you by today\u0027s standards, but this game has been the blueprint for all future FPS games to come.\nWhen I finished Half-Life, I had to sit there and think back about why this game was held in such high regards, and what that did for me during my experience with the game. I\u0027ve been a gamer for nearly ten years now, an... ",
    "gameID": 0,
    "author": "rockstar_88"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-02-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "the holy grail of the first peson shooter\nahhh back in 1998 gordon freeman going down into his top secret laboratoy all to make a mistake that changed the fake and the real world forever okay im going to say this once HALF LIFE IS THE BEST VIDEO GAME OF ALL TIM... ",
    "gameID": 0,
    "author": "evilcupcake"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2008-02-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Half Life is the best game ever created.\nHalf Life is one of the best games ever created. It is revolutionary and features something different instead of mindless shooting. You are Gordan Freeman a scienctist who has to escape a laboratory in the middle of the ... ",
    "gameID": 0,
    "author": "SteamPipe"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2008-02-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "Half Life is simply one of the greatest if not the best games of all time.\nHalf Life reinvented the genre. And not just the first person genre, but every game that tells a story. And not many games have reached it\u0027s level of immersiveness. The gameplay was brilliant to a point where every game ... ",
    "gameID": 0,
    "author": "battlefieldguy9"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-02-09T00:00:00.000Z",
    "score": 9.0,
    "comments": "one of the best early PS2 games out there...ever\nill open with this,Half Life kicks ass.it truly is something. everything about it is great.to help you guys at gamespot, ill give you the review in sections. Graphics:compared to some of the early games out there the... ",
    "gameID": 0,
    "author": "TS3dude"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-02-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best games out there\nThis game is amazing. You start out playing as scientist, Gordon Freeman who is apparently taking part of some expirement. But the expirement goes horribly wrong. So you automatticly start trying ecaspe the horror but ev... ",
    "gameID": 0,
    "author": "ADDADAC"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-03-01T00:00:00.000Z",
    "score": 9.0,
    "comments": "First of it\u0027s kind First Person Adventure game.\nThis game did its job well in putting you inside the game, not because of the detailed graphics or the voice acting but because of all the different events happening right in front of you while you move around the place.... ",
    "gameID": 0,
    "author": "Yorro"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-03-03T00:00:00.000Z",
    "score": 8.0,
    "comments": "What an adventure...it\u0027s a 10 years old game, still it really worth playing it\nThis is the single player review from the source version I was a bit concerned at first playing this game since it\u0027s a 10 years old game and since I\u0027ve already went through half life 2 first.....but after reading all ... ",
    "gameID": 0,
    "author": "lamx30108200"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-03-04T00:00:00.000Z",
    "score": 9.0,
    "comments": "The best game in the series of Half-life (1).\nExplanation of the game: Half life Opposing force is sort of missioned based, but not exactly, in this game you have to know where to go and how you have to go to achieve your purpose. The game starts off as a group of m... ",
    "gameID": 0,
    "author": "mircea_calarasu"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-03-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "The one FPS to rule then all. You never played HL it before?ORDER IT NOW, YOU REALLY DONT KNOW WHAT YOU LOSING!\nAnyone who call himself a expert in FPS and never played HL should be locked in a prison.Till it get a copy from steam, of course. It bring history to the FPS , not jus ol\u0027plain alien kill(of course , its fun but not ... ",
    "gameID": 0,
    "author": "Agentel"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-03-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "great game. a must play for FPS fans\nHalf-life is an excellent game and must be played by everyone. I have played many games but the half-life series is one of the best games of all time. You play Gordon freeman, who works in the black mesa. The story line... ",
    "gameID": 0,
    "author": "zapbomb"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-03-19T00:00:00.000Z",
    "score": 9.5,
    "comments": "Call yourself a gamer?! And you haven\u0027t played HALF LIFE?!\nPositive: Perfect AI. Great Graphics. Big chance of replayability. Lots of classic weapons, and some awesome new ones too *Sinister Laugh* Lots of surprises packed in that will either make you want to play more, o... ",
    "gameID": 0,
    "author": "Doom_blaster"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-03-21T00:00:00.000Z",
    "score": 9.5,
    "comments": "This game changed the way we think about FPS.\nBack before 1998. Quake was king. However, it stuck to the same formula that had been there since Doom. Not much of a story. Put the player in a map full of enimies and give him a gun. Then he fights his way through. The... ",
    "gameID": 0,
    "author": "Nicolas101"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-03-21T00:00:00.000Z",
    "score": 9.0,
    "comments": "Action-packed, mysterious, fun shooting strategic game that creates a whole new level of gameplay.\nSTORYLINE: Opposing Force is not an mission pack, nor is it an expansion pack. In fact, its a whole game in it self, from the view point of Adrian Shepherd, one of the US Marines sent to clear Black Mesa of the Alien in... ",
    "gameID": 0,
    "author": "_EXCON_"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2008-03-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "Only in Half Life that among the chaos your fellow scientists still have time to say \u0027Hi\u0027 before running away.\nGameplay 9 Graphics 9 Sounds 8 Value 10 Tilt 9 (Actual Score 9.1) Valve; an unknown developer company entering an ever choking FPS world particularly in the \u0027golden year\u0027 of 1998 PC gaming is definitely a dauntin... ",
    "gameID": 0,
    "author": "Azghouls"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-03-31T00:00:00.000Z",
    "score": 9.5,
    "comments": "The game that completely changed the most famous genre of computer gaming.\n***PLEASE NOTE: All my reviews are based off the single player version of the game only.*** The most famous genre ever to debut on the PC is without a doubt the First Person Shooter. Wolfenstien 3D made it famous, D... ",
    "gameID": 0,
    "author": "DrewTheSchu"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2008-04-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "Valve definitely must be crazy, because only crazy people invent the best of things...\nThere is simply nothing too much that can be said about this game, absolutely stunning... The thing that makes it great are it\u0027s battles with the huge variety of enemies it contains. The puzzles are just fun and amazing ... ",
    "gameID": 0,
    "author": "Str1keR-S1R"
  },
  {
    "helpfulCount": 43,
    "helpfulScore": 7,
    "date": "2008-04-10T00:00:00.000Z",
    "score": 5.0,
    "comments": "Surprisingly disappointing\nA lot of things annoyed me about this game. -The intro movie was soooo long and boring -The story wasn\u0027t really that good -It was just wandering through the same building -Gameplay was static -I just plain got BORED ... ",
    "gameID": 0,
    "author": "musicdemon"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-04-12T00:00:00.000Z",
    "score": 9.0,
    "comments": "Excellent Science Fiction First-Person Shooting game, falls nothing short of almost perfect. Instant Classic.\nHalf-Life simply set a new standard for all shooters. It had everything a game should ever need - amazing graphics, exhilirating gameplay, immersive environments, big weapons to kill big aliens, and a badass scientist wi... ",
    "gameID": 0,
    "author": "_EXCON_"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 6,
    "date": "2008-04-22T00:00:00.000Z",
    "score": 8.0,
    "comments": "Calling it an \u0026#8216;expansion\u0026#8217; pack is an insult. And to those Black Ops \u0026#8211; Foxtrot Uniform.\nGameplay 8 Graphics 8 Sounds 8 Value 7 Tilt 9 Expansion packs normally are for the die-hard fans. That is: those who want more of the original title plus a little extra to get the momentum going. So naturally I\u0027ll... ",
    "gameID": 0,
    "author": "Azghouls"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2008-04-26T00:00:00.000Z",
    "score": 8.0,
    "comments": "No DeusEx, but some fun run and gun action\nI enjoyed this game ultimately. It wasn\u0027t one that I rushed to finish. It\u0027s taken me about a year or more to work through it, it just didn\u0027t always hold my interest. It could be fun in spurts. I think the main gripe Ihav... ",
    "gameID": 0,
    "author": "JerWroten"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-04-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "All I can say is that the game is a classic FPS. Try a demo on STEAM or ask a friend every one has played it.\nThe Half Life series is kind of strange. Your a scientist and an experiment goes horribly wrong. The problem creates headcrabs which creats the zombies by sucking on their head or as barny says in the second game \"head h... ",
    "gameID": 0,
    "author": "hayner225"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 1,
    "date": "2008-05-08T00:00:00.000Z",
    "score": 8.0,
    "comments": "A Good FPS but Highly over rated.\nI just do not understand what the big deal is with this game. I mean it is like people think the wheel was invented or something. There are other shooters that are far far more revolutionary than Half-Life. Don\u0027t get ... ",
    "gameID": 0,
    "author": "dannyatkinson"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-05-14T00:00:00.000Z",
    "score": 9.3,
    "comments": "A very good game\nHalf life In half life you are a scientist call Dr Gordon freeman, The game play You are the scientist Gordon freeman and you and your staff conduct experiments and a new crystal that you put in to a energy be... ",
    "gameID": 0,
    "author": "titanic100"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2008-05-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "Get ready to see \u0027Unforseen Consequnces\u0027 !\nOverview- Alot of games have came and went, but Half life is one of those games which shook the world. It has a pretty great engine back in 1998. I can tell which game is gonna rule and which is gonna suck majorly, this... ",
    "gameID": 0,
    "author": "unemerge1"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-05-15T00:00:00.000Z",
    "score": 8.9,
    "comments": "Half life opposing forces is another instalment to the half life family\nHalf life opposing forces Half life opposing forces is another instalment to the half life family The game play You are a soldier call corporal shepherd and it is your job to kill all of the aliens that are abou... ",
    "gameID": 0,
    "author": "titanic100"
  },
  {
    "helpfulCount": 14,
    "helpfulScore": 4,
    "date": "2008-06-05T00:00:00.000Z",
    "score": 5.0,
    "comments": "A very erratic game. At times fun, at times incredibly boring and frustrating. Very mixed reactions. True\nPLEASE NOTE: Firstly, I am only reviewing the single-player aspect of the game. Secondly, I am using the High Definition Pack with regards to graphics, and, as such, can only judge the graphics based on this, and not its... ",
    "gameID": 0,
    "author": "Mamba219"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 3,
    "date": "2008-06-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "truly. the best shooter. EVER\nwell.. what can i say, this is half-life the experience that still holds strong against all other games even today (being 1st june \u002708) and will remain the largest step that the FPS genre will ever take away from other g... ",
    "gameID": 0,
    "author": "I-AM-THE-G-MAN"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2008-06-19T00:00:00.000Z",
    "score": 7.5,
    "comments": "It will take the player a heavy dose of patience, but after ten years the game is still worth playing.\nIt\u0027s 1998. Half-Life is released for the PC to much fanfare and critical acclaim. Lauded for its innovations in storytelling, excellence in graphics and sound design, integration of puzzle and shooter gameplay, and ten... ",
    "gameID": 0,
    "author": "SkylinePigeon"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 6,
    "date": "2008-06-19T00:00:00.000Z",
    "score": 7.5,
    "comments": "It will take the player a heavy dose of patience, but after ten years the game is still worth playing.\nIt\u0027s 1998. Half-Life is released for the PC to much fanfare and critical acclaim. Lauded for its innovations in storytelling, excellence in graphics and sound design, integration of puzzle and shooter gameplay, and ten... ",
    "gameID": 0,
    "author": "SkylinePigeon"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-06-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "great game\n.. addictive and has a fantastic story to boot. First off, the graphics in HL were, for it\u0027s time, absolutly gorgeous. The game and many of it\u0027s mods are still being widely played today, even though it\u0027s been out for ... ",
    "gameID": 0,
    "author": "bmsaareagles"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2008-07-04T00:00:00.000Z",
    "score": 9.5,
    "comments": "Classic\nIts the First Person game that started it all. Ofcourse Doom was the first ever FPS game but this game really revolutionarized everything that a FPS needed to have. It comes with an expansion called Counter-Strike Con... ",
    "gameID": 0,
    "author": "hotbodyboy_2006"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2008-07-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Possibly the greatest classic of all time.\nTHE GOOD: Solid FPS action from start to finish, deep involving story that truly makes you feel like you are the one experiencing the events, great variety of weapons and enemies. THE BAD: Very long opening sequence. ... ",
    "gameID": 0,
    "author": "chesterocks7"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-07-16T00:00:00.000Z",
    "score": 8.5,
    "comments": "Valve Poops GOLD NUGGETS!!!\nOpposing Force is just as good if not better than the original. -Pros- *Play as a Soldier not Freeman *New Weapons and Toys *Can Control Allies which can Hold their Own *Awesome Voice Acting *More of the same Goo... ",
    "gameID": 0,
    "author": "Ghaz013"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2008-07-21T00:00:00.000Z",
    "score": 9.5,
    "comments": "Revoulutionary.\nThis game is amazing. I remember this is the first FPS I ever played. I spent hours on the computer messing around with this game. You play as Gordon Freeman, a scientist at the Black Mesa research facility. An experimen... ",
    "gameID": 0,
    "author": "zombiepanda13"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-08-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "While Half- Life is ugly by today\u0027s PS2 standards, it doesn\u0027t take away from the terribly engaging story and gameplay.\nConsidered one of the best PC games ever released (Just check out Metacritic) the original Half-Life has only seen one official console release. Since I don\u0027t do PC games the PS2 version was the perfect outlet for me to... ",
    "gameID": 0,
    "author": "liugeaux"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2008-08-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Expansions don\u0027t get better than this.\nTHE GOOD: Experience the Half-Life story from the view of an enemy soldier, same things that made Half-Life great make this expansion just as great, having squadmates makes larger battles easier and somewhat more tactica... ",
    "gameID": 0,
    "author": "chesterocks7"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-08-24T00:00:00.000Z",
    "score": 9.5,
    "comments": "Possibly the most ground-breaking game ever created.\nI remember the first time my buddy showed me this game, I was blown away. It was the first time a FPS had a real storyline and a character you cared about. The developers did a fantastic job of creating mood with light... ",
    "gameID": 0,
    "author": "jakesm1"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2008-09-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "If you like shooters, and dont play this game, you should give up gaming altogether. Thats how important this game is.\nWhen Half-life came out in 1998, it rocked the gaming world. Immersive story, intense gameplay, and a modable engine kept people coming back for more. Today, many gamers dismiss it as an old game that is incapable of sta... ",
    "gameID": 0,
    "author": "Halcyon670"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2008-09-28T00:00:00.000Z",
    "score": 7.5,
    "comments": "Half-Life on PS2 could have been improved in many ways, but the facts remain the same, this is still an awesome game\nIn November 2001, way before Half-Life 2 was even announced, Valve were getting increasingly famous due the popularity of Half-Life; it\u0027s expansion packs and various mods like Counter Strike and Team Fortress designed fo... ",
    "gameID": 0,
    "author": "loopy_101"
  },
  {
    "helpfulCount": 47,
    "helpfulScore": 4,
    "date": "2008-10-02T00:00:00.000Z",
    "score": 4.5,
    "comments": "While Half-Life was an innovative masterpiece when it came out, it\u0027s not worth playing today.\nI understand how Half-Life was an innovative masterpiece at the time it came out. However, it hasn\u0027t aged well, and is not worth playing nowadays. If you\u0027re playing it to relive a classic then it could be worth your time... ",
    "gameID": 0,
    "author": "danmam2"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-10-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "The classic shooter. Engrosing, fun, intellegent from the get go, and leaves you wanting more. A must for any gamer.\nAn amazing game from start to finish. I remember seeing the preview for this game in a summer issue of pc gamer back in 98 and feeling overwhelemed with anticipation. 90% of my life was now infront of my monitor, with a ... ",
    "gameID": 0,
    "author": "Predator123"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-11-02T00:00:00.000Z",
    "score": 8.5,
    "comments": "Still worth playing.\nHalf-Life came at a phenomenal time. Just as the X-Files was really hitting its stride, just when first person shooters were starting to get in a rut, Half-Life materialized, showing just what an incredible, cinematic s... ",
    "gameID": 0,
    "author": "Va0"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-11-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "The most important game of the last ten years.\nEvery game made since 1998\u0027s Half-Life, of whatever genre, owes something to it. Every first-person-shooter since, on some level, is trying to be it. The success of a post-Half-Life FPS depends on how well it deals... ",
    "gameID": 0,
    "author": "Emilyek_1"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-11-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "The One and Only #1 King of multiplayer and EVEN TODAY in 2008 it remains the most competitive FPS out there. BEST EVER\nFrom 1996-2001 I played one game. C\u0026C Red Alert. In college in 2002 I found my first FPS game, and Half Life would revolutionize the gaming industry as we know FPS\u0027s today. Story Line - The story line is by far the b... ",
    "gameID": 0,
    "author": "Buchsbaumy"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-11-21T00:00:00.000Z",
    "score": 9.5,
    "comments": "The single biggest contribution to gaming in the past 10 years. Hail to the king, mortals.\nEven after 10 years, this game remains the single greatest FPS ever made. Sure, plenty of games have improved on aspects of Half Life, but Half Life defined the genre. Just as Doom created FPS games, Half Life made them ... ",
    "gameID": 0,
    "author": "DarthNader26"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2008-11-23T00:00:00.000Z",
    "score": 8.5,
    "comments": "Half-Life is the king of the FPS genre but HL1\u0027s age really shows compared to today\u0027s shooters.\nThe Good: Game holds up 10 years later, one of the best told stories in gaming history, a lot of memorable moments, tons of mods available The Bad: Graphics look hideous these days, newer gamers will hate this due to ... ",
    "gameID": 0,
    "author": "ivory_soul"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-11-30T00:00:00.000Z",
    "score": 9.0,
    "comments": "Valves pc masterpeice has arrived on the ps2\nTHE GOOD: improved graphics, excellent soundtrack, the new co-op mode, decent multiplayer, wide range of weapons,well balanced difficulty THE BAD: no online, decay is short GRAPHICS: at the time half life was one o... ",
    "gameID": 0,
    "author": "jimmywire1996"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-12-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "The first great expansions to one of the first great first person shooters in history.\nJust about everyone who played 1/5 or so into Half-Life eventually encountered the Military sent in by the US in order to silence the facility. Players could easily identify them as the enemies in the game. But what if t... ",
    "gameID": 0,
    "author": "EyeWierd20"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2008-12-12T00:00:00.000Z",
    "score": 9.0,
    "comments": "A worthy addition to the original Half-Life which is no small feat.\nOne Gearbox software has done us a great service by making this game. The original Half-Life was a masterpiece and a water-shed moment in gaming.Gearbox decided to give us more of that, and yet add enough new things to ... ",
    "gameID": 0,
    "author": "tuff_gong92"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2008-12-14T00:00:00.000Z",
    "score": 9.5,
    "comments": "Don\u0027t be mislead by the title: Half-life is the experience of a lifetime.\nHalf-life may be very old, but as they say, the older wine is the better one. Despite its age, this game offers tons of realism, which is contained and serious. You take the role of Gordon Freeman, a scientist of B.M.... ",
    "gameID": 0,
    "author": "fandom888"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2008-12-17T00:00:00.000Z",
    "score": 9.5,
    "comments": "Even better than half life 1 !\nIn opposing force you play as HECU marine called Adrian Shephard, he was sent in black mesa so he could kill \"gordon freeman(the main character in half life 1)\" . But your osprey gets attacked by aliens and you hardly su... ",
    "gameID": 0,
    "author": "arvuti12"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2008-12-17T00:00:00.000Z",
    "score": 9.0,
    "comments": "A game from 1998, and it still looks good ? Seems impossible, but it is possible.\nHalf life 1 at first seems your typical shooter, you get a lot of diffrent and creative weapons and you fight aliens and HECU soldiers who want to sabotage the facility. But it actually has depth by making a good and mys... ",
    "gameID": 0,
    "author": "arvuti12"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2008-12-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "Is it the best FPS ever created... um... Dam Ya It Is!\n\"Catch me later I will buy you a beer!\" - Barney Calhoun You are Gordon Freeman, 27, and you have accepted a job in Black Mesa Research Facility, Texas by the telephone and some time later you\u0027re on the train waiting ... ",
    "gameID": 0,
    "author": "Sardinar"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-01-12T00:00:00.000Z",
    "score": 9.0,
    "comments": "Half-Life holds up as a superb game that has aged very gracefully.\nHalf-Life remains in the top 3 in my mental list of \"best games evar\". Its completely stood the test of time, just like a brilliant musical piece or a beautiful painting. Nomatter who you are, or how much you enjoy these... ",
    "gameID": 0,
    "author": "FabulousGamer90"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2009-01-12T00:00:00.000Z",
    "score": 9.5,
    "comments": "Half-Life is a must have for the PS2.\nHalf-Life hit the Playstation 2 in 2001 and gaming was at least for me changed after I played this game. This is a fantastic game one of the first games to be on the PS2 and one that no one will ever forget. Just an awes... ",
    "gameID": 0,
    "author": "bigd575"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-02-03T00:00:00.000Z",
    "score": 9.0,
    "comments": "A great FPS that really helped to bring life back to the genre.\nAh, Half-life. What can one say after just over a decade? Well for starters, how about wow? Even after ten years Half-life holds up to the hype it has generated and you can see why this game started a computer FPS leg... ",
    "gameID": 0,
    "author": "wreckem406"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-02-10T00:00:00.000Z",
    "score": 8.5,
    "comments": "A great addition to one of FPS\u0027s finest.\nIf you want to fill in any of the gaps left in the original Half-Life, Opposing Force is most certainly a game for you. In Opposing Force you take the role of Adrian Shephard a Marine in the Hazard Environment Containme... ",
    "gameID": 0,
    "author": "wreckem406"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-04-22T00:00:00.000Z",
    "score": 9.5,
    "comments": "Valve\u0027s debut venture that hit the spot.\nI had many games on my PC when I installed Half-Life for the first time in 2008. After having had played its first few levels, I gladly uninstalled most of my other games to save disk space and improve performance, and n... ",
    "gameID": 0,
    "author": "acxler8"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-05-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "If you have a ps2, buy this game. It exceeded all expectations I set for it.\nHeadcrabs, barnacles, zombified scientists, soldiers, and a man in a hazard suit. It can only be valves infamous \"Half Life\". When I first played this game on the pc I didn\u0027t have a clue what to do. I didn\u0027t even to... ",
    "gameID": 0,
    "author": "KILLER999999991"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-05-16T00:00:00.000Z",
    "score": 8.5,
    "comments": "It\u0027s great\nBut not awesome. I\u0027m saying this in an overall context. Not as when it was released and how was it then. I\u0027m not taking graphics in consideration. Having said that- the good:- 1. game play. extraordinarily sim... ",
    "gameID": 0,
    "author": "dibyajyoti_mond"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2009-05-22T00:00:00.000Z",
    "score": 9.5,
    "comments": "This game had such realistic graphic for its time and an immerse gameplay and story it is just an amazing fps.\nHalf Life still has to be the best FPS series i have played and a great place to start with the game is the first, because it really has a story that does not change it continues, unlike most game series for example, the... ",
    "gameID": 0,
    "author": "ExtremeGamer99"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-06-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "This game should be considered a classic for the PlayStation 2!\nGranted the graphics are not the greatest, it still should be considered a classic PS2 shooter. It has a great variety of weapons, listed below. • Crowbar • 9mm • Assault Rifle with Grenade Launcher • Shotgun • Cro... ",
    "gameID": 0,
    "author": "zemafia08974"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2009-06-25T00:00:00.000Z",
    "score": 8.0,
    "comments": "Gives you new weapons, locations, and perspective but sadly improves none of Half-Life\u0027s flaws.\nWell it took much longer to beat Opposing Force than I expected. I started it in the Winter of 2008 and just finished it at a month ago. This was because some Steam update back in the Winter made it impossible to get pas... ",
    "gameID": 0,
    "author": "PublicNuisance"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2009-07-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "If you\u0027ve never played Half-Life, you were deprived in life.\nThere are 3 glorious moments in a persons life. 1. Birth 2. Birth of a child 3. First time playing Half-Life Forget about Doom, forget Quake and Wolfenstein. Half-Life is the quintessential FPS game. Every 3d f... ",
    "gameID": 0,
    "author": "Vispyr"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-07-09T00:00:00.000Z",
    "score": 9.5,
    "comments": "The Pc\u0027s golden eye!!! a must own for PC owners\nThe first time I played Half life was about there months ago, I was amazed of the incredible graphics for the year of 1998, I was also amazed of the outstanding plot. Most alien shooters are about to destroy humanity or ... ",
    "gameID": 0,
    "author": "gmankiller81"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2009-07-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "The FPS that changed a genre.\nI\u0027m kind of writing this in response to all three of the Half-Life I games /expansions. My feelings are pretty much the same about all three (except I could truthfully say I felt Opposing Force was even better), so it j... ",
    "gameID": 0,
    "author": "snared04"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-07-31T00:00:00.000Z",
    "score": 9.0,
    "comments": "Valve poops GOLD!!!\nHalf Life is one of the best games ever made which helped revolutionize the FPS genre. ATTENTION to people below the ages of 17. I know your young and you are growing up with games like Crysis but that is because y... ",
    "gameID": 0,
    "author": "Ghaz013"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-08-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "I remember playing this game for hours and loving it and I still do\nStory - In Half-Life, players assume the role of Dr. Gordon Freeman, a recent graduate theoretical physicist who must fight his way out of a secret underground research facility, whose research and experiments into telep... ",
    "gameID": 0,
    "author": "aramoe"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 1,
    "date": "2009-08-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "the king of fps\nhalf life is a new age in gameing (story) you are fr.gorden freeman a 20 physis wahtever and you work in a research facility and well hell breaks lose (graphics) good graphics for its time thats all i can say (gameplay) ... ",
    "gameID": 0,
    "author": "epicgamer33"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-08-30T00:00:00.000Z",
    "score": 8.0,
    "comments": "Half Life opposing force is a must have for Half life fans\nOk so, the first time I played Half life opposing force i was like this was gonna be great!!! Well, believe me, the first 5 hours the single player is fantastic, But the nearing the end of the game, The game became to co... ",
    "gameID": 0,
    "author": "gmankiller81"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2009-09-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "To not play this game is blasphemous to your career as a true gamer.\nThis is where, in my opinion, the BEST game of any kind was started. Half Life 1 is not that special these days, but you MUST play it to understand the background of half life 2. In fact, half life 2 starts almost direct... ",
    "gameID": 0,
    "author": "THE_BRUTALIZER"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2009-09-22T00:00:00.000Z",
    "score": 9.0,
    "comments": "one of the biggest titles in its time! Buy it !\nSo well iv played Half Life sadly im not old enough to have played it when the grapich was good for the games that was released. Anyhow the story in Half Life is really good, i enjoyed playing it and the difficulty wasnt... ",
    "gameID": 0,
    "author": "MiniDudeLive"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2009-09-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "Gordon Freeman, a.k.a. you, are the hero. Trusty companion: a crowbar.\nEver wanted to be a scientist with a PhD, in addition to having awesome talents with guns AND epic crowbar-style fighting skills!? Then you\u0027ve come to the right place! Half-Life puts you in the shoes of Dr Gordon Free... ",
    "gameID": 0,
    "author": "sequekhan"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-10-01T00:00:00.000Z",
    "score": 9.0,
    "comments": "Valve\u0027s masterpiece hits the PS2 and, like the PC version, will give you an FPS experience you will never forget.\n--------The Good-------- Interesting Story • Nice Soundtrack • Decay is really fun • Everything the original had and more • Cool Enemies • Lock-on Feature can be handy for newcomers • Puzzles that keep you thinking • Ch... ",
    "gameID": 0,
    "author": "Bluekunai22001"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2009-10-08T00:00:00.000Z",
    "score": 9.5,
    "comments": "half life revolutionized fps games\nHalf life is an amazing game and is the second best pc game, the best pc game is half life 2. Half life is an amazing game and the first fps game to revolutionize the the fps catogory of games. The story to half life is ... ",
    "gameID": 0,
    "author": "damonster0004-2307137279573678"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2009-10-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "$12.00 must be a lot these days for a game this good. If you missed 1998\u0027s Half-Life get the upgrade on PS2.\n1998:Half-Life, the greatest PC shooter ever is realeased. 2001:It gets better. Much, much, much better. Half-Life on the Playstation 2 should b considered as the son of DooM. Great graphics, keyboard USB connectivity,... ",
    "gameID": 0,
    "author": "boogiebot5000"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2009-11-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Half-Life is revolutionary, and it\u0027s one of the best games I\u0027ve ever played.\nEverything is terrific in Half-Life. The story. The voice acting. The characters. The graphics. The controls. The online play. The way it revolutionized gaming. You don\u0027t even have to play Half-Life to know how revolutio... ",
    "gameID": 0,
    "author": "prkprkprk"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2009-11-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "the greatest old school game ever! buy it now!\nThe good:cool weapons,story is amazing,the crowbar is the perfect weapon to smash anything,it feels almost like real,too easy but too hard. The bad:graphic not that good,AI allies are stubborn,Black Mesa Research Faci... ",
    "gameID": 0,
    "author": "Proto135type"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2009-11-21T00:00:00.000Z",
    "score": 8.5,
    "comments": "Aside from the sometimes annoying controls and somewhat outdated visuals, Half-Life proves to be a very good FPS...\nAs a pretty big fan of first person shooter\u0027s, and someone that never played any of the highly-praised Half Life games, I decided to make a purchase of the original classic for my PS2. Needless to say, after a bit of ti... ",
    "gameID": 0,
    "author": "ForzaAbruzzo"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 1,
    "date": "2009-11-22T00:00:00.000Z",
    "score": 7.0,
    "comments": "First, I thought it was awful, now I think it\u0027s OK.\nI originally thought this game was poorly thought out, and too realistically gory with a hint of \"extraordinary realism\". Now I am getting used to it. You play as Ph.D Scientist Gordon Freeman. You are in the Black Me... ",
    "gameID": 0,
    "author": "DanielL5583"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2010-02-07T00:00:00.000Z",
    "score": 8.5,
    "comments": "A great game, one of the best ever made but with couple of flaws. Also some notes on green robots vs marines and more...\nFirst of all, I am a big fan of the entire Half Life series with all its games (HL, OF, BS, HL2, HL2E1 and HL2E2). Although I did not quite like E1 and E2, they look a bit like linear cheezy movies with no new stuff real... ",
    "gameID": 0,
    "author": "duke_bitterman"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2010-02-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "half life is the best FPS game to date, despite its 12th anniversary coming this year!\nhalf life is simply put.... the best! i have played it and its expansions over a dozen times and love it everytime i play it Gamplay: half life\u0027s gameplay is one of the best, its smooth, its simple and most important ... ",
    "gameID": 0,
    "author": "nomad12345"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2010-02-19T00:00:00.000Z",
    "score": 8.5,
    "comments": "The first expansion for Half-Life is one of the best expansion out there and it\u0027s just as awesome as the original game.\nOpposing Force is the first expansion for Half-Life and it\u0027s just as awesome as Half-Life. In this expansion you play as the HECU soldier Adrian Shepard and his mission is to evacuate the Black Mesa research facility ... ",
    "gameID": 0,
    "author": "Teh_Sockpuppet"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2010-02-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "Half-Life is the only FPS in history to retain its originality even after consoles like ps3 and xbox started production.\nHalf-Life is one of the gaming landmarks companies like Valve have had the pleasure of creating. Its been 12 years since its release, and still we notice today the large number of people intrested in it. Perhaps its grea... ",
    "gameID": 0,
    "author": "Lebaneze_RPGist"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2010-02-21T00:00:00.000Z",
    "score": 9.0,
    "comments": "Half-Life is just amazing in every way from the guns to the setting and to the characters and gameplay.\nWhen i played this game for the first time it immediately became one of my favourite games. You play as Gordon Freeman, a scientist who works in the Black Mesa Research facility and he is involved in a mysterious proj... ",
    "gameID": 0,
    "author": "Teh_Sockpuppet"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2010-03-24T00:00:00.000Z",
    "score": 9.0,
    "comments": "One hell of a shooter\nWhat\u0027s the point in introducing this? It\u0027s frigging half-life! Graphics: for the time, excellent. Now, they\u0027re passable, imo. I still like the early gore stuff with the low-res gibbing :P Sound: Pretty good, alt... ",
    "gameID": 0,
    "author": "Frankenstrat247"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2010-03-25T00:00:00.000Z",
    "score": 9.0,
    "comments": "Half-life may have choppy graphics, but it makes up for it with addictive gameplay, and an awesome story!\nHalf-life is without a doubt one of my favorite games on ps2 (or any console for that matter) you take on the role of a scientist named gordon freeman, and run around shooting aliens! doesnt get musch better than that! t... ",
    "gameID": 0,
    "author": "rojo12689"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2010-05-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "They do not make games like this anymore.\nThis is quite possibly the best game that will ever be made. This game, like everybody says, has revolutionized the genre, but even that point does not do this game justice. Its difficult to imagine anyone who hates this... ",
    "gameID": 0,
    "author": "CrysisFPS"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2010-05-10T00:00:00.000Z",
    "score": 9.0,
    "comments": "Half Life offers a single player FPS adventure that still holds up today...\nBack in the 1990\u0027s, when first person shooters were still a growing genre, there really weren\u0027t very many to choose from aside from Doom, Wolfenstein, Marathon or maybe Goldeneye if you had a Nintendo 64 instead. Then c... ",
    "gameID": 0,
    "author": "SR71halo"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2010-05-17T00:00:00.000Z",
    "score": 9.0,
    "comments": "HL has become not only one of the best games of all times, but a point of reference for many games created after.\nIt was many years ago when this game was released, but i think there are many reasons to write something about it, since HL became a living legend.. 1st time i saw HL was, If i remember well, on a Diablo expansion pack.... ",
    "gameID": 0,
    "author": "etchcorp"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2010-06-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "Gameplay at its best.Immerse yourself into an old, yet always fresh Sci-Fi world and let the hero become you.\nHalf Life is a groundbreaking game, and one of the best FPS games ever.The Half Life experience lives up to this day no matter how old the graphics are.This is again, the first FPS to feature a story and scripted sequenc... ",
    "gameID": 0,
    "author": "Crystal_Helix"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 5,
    "date": "2010-07-06T00:00:00.000Z",
    "score": 9.0,
    "comments": "With its great story and design, Half-Life arrives to bring rejuvenation to a genre at risk of stagnation.\nDuring the time of this game, it was not expected of FPS games to offer well-crafted and memorable stories that actually promise even better sequels. Then came Half-Life by Valve, who would be known for greater things to... ",
    "gameID": 0,
    "author": "Gelugon_baat"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2010-07-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "Beating Headcrabs since ´98.\nI was 8 when i got this game. I was on a trip to Sweden, and i bought this game from there. When i got back to home, i popped this game to my trusty old Pentum 133mhz with voodoo 1, and i installed it. My first impressio... ",
    "gameID": 0,
    "author": "jurpo90"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2010-08-27T00:00:00.000Z",
    "score": 9.0,
    "comments": "If you can get past the dated presentation, this is a game everybody needs to play. Even on the PS2.\nHalf-Life Epic: • Simple, tightly-woven story • Fantastic atmosphere • Excellent level and enemy design • Balanced arsenal means each weapon is useful • Set-pieces are still cool today (Blast Pit, anybody?) • T... ",
    "gameID": 0,
    "author": "Fusionmix"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2010-09-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Half-Life maybe 12 years old, but is still amazing\nHalf-life maybe 12 years old, but it never gets boring!!! It is a very addictive game, and the graphics maybe terrible for now but that does not stop me from playing it. A first Person shooter that hopefully will live f... ",
    "gameID": 0,
    "author": "skeleme"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2010-09-12T00:00:00.000Z",
    "score": 9.5,
    "comments": "The oldest game I\u0027ve ever played, and also one of the best.\nTo start this review, I will say that, when it comes to gaming, I\u0027m the kind of person who enjoys being up to date in everything. I only have ever played the newest games on the market, and graphics have always been as ... ",
    "gameID": 0,
    "author": "Halak41"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2010-09-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "THE most perfect fps ever made\nNot only this game is as perfect as a fps can be, but it\u0027s also a great game besides shooters. Some say it\u0027s graphics are bad, the voice acting is repetitive, the models are the same all along the game. I say they\u0027ve nev... ",
    "gameID": 0,
    "author": "tomgas"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2010-12-13T00:00:00.000Z",
    "score": 9.5,
    "comments": "Valve\u0027s debut title remains the best in what is (and will continue to be) the best First Person Shooter series. Read on!\nWhen I was first told about Half-Life, I never would have imagined it as a game that could \"impress\" me, since my expectations are often very high. For a debut title, I was more lenient. However I soon realized that that... ",
    "gameID": 0,
    "author": "Tristan-117"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2011-01-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "From Nerd to Legend.............\nFirst and foremost, Half-Life came out when first person shooters were simply run and gun (Doom, Quake, etc.). Considered an overly ambitious project by many, it contained amazing graphics for 1998 and pioneered the use... ",
    "gameID": 0,
    "author": "franzfranman"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2011-01-17T00:00:00.000Z",
    "score": 9.5,
    "comments": "Half Life is the most important First-Person Shooter ever made.\nHalf-Life is a First-Person Shooter developed by Valve and released for the PC in 1998. Half-Life is the game that started the boom of First-Person Shooter\u0027s on the PC, it is widely regarded as one of the greatest and mo... ",
    "gameID": 0,
    "author": "widdowson91"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-01-31T00:00:00.000Z",
    "score": 9.5,
    "comments": "Revolutionary indeed...\nI finished Half-Life 3 times because it is such a great FPS ! Sound: Very good voice acting , music and sound effects . Gameplay: Fast paced gameplay , with the ability to strafe , run , 2 jump types with you... ",
    "gameID": 0,
    "author": "TaoJeetKuneDo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-02-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "Well, Half Life is the best game ever made in this FKing galaxy. it just is, and if you didn\u0027t play when it was...\nWell, Half Life is the best game ever made in this FKing galaxy. it just is, and if you didn\u0027t play when it was launched, yes in 1999, you haven\u0027t got a clue about what it\u0027s real fans are talking about. back then (ou yea... ",
    "gameID": 0,
    "author": "G-Man4ever"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-02-24T00:00:00.000Z",
    "score": 9.5,
    "comments": "The game that made FPS games what they are today.\nThis is the game that started the widespread FPS market that we still enjoy today, Call of Duty, Medal of Honor, Halo, all of the modern First-Person-Shooters we know today, are inspired by Half-Life 1, it is already 13 ... ",
    "gameID": 0,
    "author": "Oskulock"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2011-03-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Maybe the best and most revolutionary FPS of all time.\nStory: You take the role of Gordon Freeman a scientist who works in the Black Mesa Research Facility. He is called to test a dangerous experiment, but it failed, and summons hundreds of alien through all the facility an... ",
    "gameID": 0,
    "author": "Rekvan"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-03-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "Nothing can change the greatness of this game. Not even Half life 2 and beyond.\nMan this game is by far one of my favorite games of all time no matter what game I play nothing is gonna beat it. This game had a great story your gordon freeman working at black mesa and your expereimented on and it fai... ",
    "gameID": 0,
    "author": "JosephOz"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2011-03-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "Nothing short of perfection describes this game.\nThis game sets the bar to what all other first person shooters should have been, should be and maybe one day will be. This game single handedly set a bar, a line to which all other first person games and possibly all gam... ",
    "gameID": 0,
    "author": "True_Avery"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-05-14T00:00:00.000Z",
    "score": 9.5,
    "comments": "You are Adrian Shephard and its your job to be on the Opposing Force.Who will you be fighting.Just look at half life 1.\nHalf-Life: Opposing Force as many of you know already is an expansion pack for Valve Software\u0027s science fiction first-person shooter video game Half-Life. Hence the game being called Half life and the expansion being cal... ",
    "gameID": 0,
    "author": "Darthpathfinder"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2011-06-29T00:00:00.000Z",
    "score": 9.5,
    "comments": "Comparable with the disaster of Chernobyl...\none of my favourite games.this is an absolute masterpiece.a milestone in the world of gaming.revolutionary.ground-breaking.amazing.subtile.funny.claustrofobic.radio-active.the mystery of g-man.action-packed.\u0027\u0027with my bra... ",
    "gameID": 0,
    "author": "snes_vs_ps1"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-09-07T00:00:00.000Z",
    "score": 8.0,
    "comments": "Old-school FPS that\u0027s still worth playing today. Revolutionary at it\u0027s release.\nDespite the fact that Half Life was released way back in 1998 it still remains very playable today. In the single player campaign you assume the role of Gordon Freeman, a physicist in the Black Mesa Research facility, a... ",
    "gameID": 0,
    "author": "angelfon"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2011-11-05T00:00:00.000Z",
    "score": 9.0,
    "comments": "Half Life offers a brilliant campaign, and in my opinion, is better than it\u0027s successor; Half Life 2.\nMy earliest gaming memory was walking around with a SPAS-12 shot gun killing monsters and commando soldiers in Half Life. I enjoyed games alot more when I was a little 6 year old more, now days only call of duty and poke... ",
    "gameID": 0,
    "author": "Aurdreyen"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-01-03T00:00:00.000Z",
    "score": 9.5,
    "comments": "Half-Life over the years has shown its age, but still it\u0027s an innovative, engaging game experience.\nHalf-Life is one gem of a game, and although it is getting old, one cannot deny the revolutionary qualities that it contains. The reason for this is not only the innovative way the story is told compared to other FPS ga... ",
    "gameID": 0,
    "author": "potentpillow"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-03-03T00:00:00.000Z",
    "score": 9.5,
    "comments": "It combines a balance of tense action, puzzle solving, story, and fun that has yet to be equaled on in the FPS arena.\nWhat can possibly be said about a game that captured just about every Game of the Year award in 1998? Half-Life has changed the way that first person shooters (FPS) are played and designed. The single player game has yet... ",
    "gameID": 0,
    "author": "PSFreak1"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-03-11T00:00:00.000Z",
    "score": 8.5,
    "comments": "Really fun, Mega hard.\nAhh Half-life, you pissed me off so much and created some of the most fun times I ever had in gaming. Half-life is a must for any fun on the first person shooter genre. Gameplay: 9/10 My god, this is one of the h... ",
    "gameID": 0,
    "author": "dahaoleboy69"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2012-04-11T00:00:00.000Z",
    "score": 9.5,
    "comments": "Fourteen years later, Half-Life still impress with its superior quality, being a must play to any FPS player.\nThere are two types of FPS players in the world: the ones who played Half-Life, back in 1998, and the ones who doesn\u0027t. This not only happens with Half-Life, but with every revolutionary game that born in the world, like... ",
    "gameID": 0,
    "author": "Cunhao"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2012-04-13T00:00:00.000Z",
    "score": 6.5,
    "comments": "It\u0027s still a great game like it was on the PC, but it simply doesn\u0027t work as well on the PS2.\nHalf-Life was a fantastic game that I still play even today. That is, on the PC. Few months ago, I bought the PS2 version. Apparently it\u0027s really rare, but luckily, they actually had it. Only $8.00. Thought I would bu... ",
    "gameID": 0,
    "author": "skeleme"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-05-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "Opposing Force is a game that changes and rise what an expansion pack is mean to be.\nSeriously... how it is possible that a game that is already a masterpiece be incremented to be better than before? This is what Opposing Force is about, an expansion for the original Half-Life, with a new awesome big sin... ",
    "gameID": 0,
    "author": "Cunhao"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-06-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best games of all time. (^_^) Best of old-school. Check it out.\nThis is a game from the time where games were more than 10 hours long, teeth-griddingly difficult, were well written, and had balance between adventure, action, exploration, puzzles, and a rainbow of enemies. •GRAPHIC... ",
    "gameID": 0,
    "author": "Ghost-inZeShell"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-06-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "The greatest first person shooter of all time!\nwell what can we say about Half-life that has not already been said? Not much, but im going to give my own personal review anyway. you play as Gordon Freeman a theoretical physicist assigned to Black Mesa Labs to take... ",
    "gameID": 0,
    "author": "thenerd1989"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-06-28T00:00:00.000Z",
    "score": 9.0,
    "comments": "Gameplay so simple, yet so fun.\nGood: -simple, yet extremely fun gameplay -good balance of shooting and puzzle solving -good variety of weapons and equipment -mysteriously interesting story that makes you want to keep playing -numerous types of ... ",
    "gameID": 0,
    "author": "fazio93"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-07-04T00:00:00.000Z",
    "score": 9.0,
    "comments": "The same great gameplay, from a different perspective.\nGood: -same great gameplay -fun new weapons (e.g. chain gun, portal gun, magnum, grapple hook, etc.) -cool experiencing the first Half Life through a different perspective -same mysteriously intriguing story -some... ",
    "gameID": 0,
    "author": "fazio93"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-08-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "The godfather of first person shooters.\nI remember those days of games like Doom, Quake, and Unreal ruling the planes of the first person shooter. Suddenly, there was Half -Life. At first, I was a bit reluctant to jump the hype wagon this game created ove... ",
    "gameID": 0,
    "author": "jeremylst1"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-09-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "half life 1 original ,is one of the most creative,,thrilling,,addictive,,fun puzzled ,,interesting,,nerdy,,enthraliling\ngame i have ever witnessed and played ,,, with deep whacky story ,,clever and weird dialogs,,which comes with many funny moments,,great story,, this is one bizarr,,clever,,futuristic ,,well game made,, ... ",
    "gameID": 0,
    "author": "gamespot2DBOne"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-09-14T00:00:00.000Z",
    "score": 8.5,
    "comments": "A great single player game experience\nIf there is a game in FPS genre has a story of its this game is Half-Life. Available also for PS2 being released in the early years of life of machine and following just the same game came out some years before on PC. ... ",
    "gameID": 0,
    "author": "hurriflash"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-09-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best game of all time.\nI remember when reading about Half Life and the unknown (at the time) Valve Software. Having played Quake, Quake II and Doom I thought, I thought that it\u0027d be impossible to equal the quality and the success of those titl... ",
    "gameID": 0,
    "author": "Mauro_Rosati"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-10-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "beautifull game and its big game from valve nice\nbeautifull game and its big game from valve nicebeautifull game and its big game from valve nicebeautifull game and its big game from valve nicebeautifull game and its big game from valve nicebeautifull game and its big ... ",
    "gameID": 0,
    "author": "mahdig"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-10-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "Classic Role Play that has fond memoreies for all who played it.\nOne of the all time great games. I loved the way Gordon Freeman, gets unexpectedly dragged into the plot to become our hero fighting not only the alien life forms but also the big brother of Black Mesa. The idea of star... ",
    "gameID": 0,
    "author": "Skeggsinator"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-11-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "Great game promising a great experience\nThis is basically the best first person shooter, together with its expansions, I have ever played. I asked myself through playing why I, as a person not too much fan of that genre, was liking it that much. An obvious ans... ",
    "gameID": 0,
    "author": "cenneli"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-01-30T00:00:00.000Z",
    "score": 9.5,
    "comments": "Once you play Half Life you won\u0027t Half a life!\nThis is one my most favorite games of all time. I love this game. It has to be one of the most immersive first person shooters of all time. I had no idea that Half-Life was going to be this good of a game. I thought it w... ",
    "gameID": 0,
    "author": "Alexander2cents"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-05-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "The game that stood out in a flood of mediocre first person shooters.\nHalf-Life was the first game released by Valve, who is well-known for Portal, Team Fortress 2, and Left 4 Dead. In a time where first person shooters were pretty much only \"Walk to Point A to Point B and kill everything.... ",
    "gameID": 0,
    "author": "GoldenEye2010"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-07-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "Never mind the graphics or age, you can\u0027t stop coming back...\nWhat to say, really... Anyone who knows their FPS stuff should know what a milestone this was, and in many ways is. From the start you\u0027re involved. The often complete lack of pointers leaves you totally immersed, and c... ",
    "gameID": 0,
    "author": "FattM"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-09-02T00:00:00.000Z",
    "score": 9.5,
    "comments": "The game is amazing.\nJust an beautiful amazing game. In a game what would you want more? \u0027Detail, Gameplay, Story, Interaction with world, what else I am not sure\u0027. Half Life gave it all. Even the initialization of the game was a Wow. Yo... ",
    "gameID": 0,
    "author": "FearTheKnighT"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-10-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "The Best Game Ever Made.\nHalf Life. Genius. Those are the words you first hear whenever you ask someone that. Half Life has changed me. The games I now play are FPS games because of this. This is the first time I played a M Rated Game. I was 13 ... ",
    "gameID": 0,
    "author": "awesomeman246"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-07-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "Favorite game. Hands down.\nHaven\u0027t played it yet? In the words of Arnold Schwarzenegger \"DO IT! NAOOO!\"Amazing story (which you won\u0027t need to understand to love the gameplay), great gameplay, stunning graphics (for the time.. Don\u0027t hold up as wel... ",
    "gameID": 0,
    "author": "victorfff"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-10-04T00:00:00.000Z",
    "score": 7.0,
    "comments": "Half-Life is a great FPS and Horror game mixed together!\nGame: Half-LifeGenre: FPS/HorrorDeveloper: ValveSystem: Steam (PC)Total Score: 77/100Value Score: 7.7/10\u0026bull; Story: 7/10\u0026bull; Characters: 7/10\u0026bull; GamePlay: 10/10\u0026bull; Graphics: 8/10\u0026bull; Sound: 8/10\u0026bull; Musi... ",
    "gameID": 0,
    "author": "BasilVZero"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-12-24T00:00:00.000Z",
    "score": 9.0,
    "comments": "half-Life: The Father of Modern FPS Genre\nFirst of all, I know this game looks painfully old for someone used to beautiful graphics and a map telling you where you should go. However, Half-Life is a must-have fps. And, when I say this, I\u0027m guaranteeing you that ... ",
    "gameID": 0,
    "author": "exp3rtgam3r089"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2015-04-09T00:00:00.000Z",
    "score": 8.0,
    "comments": "Half Life is the best first person shooter out there, followed by Halo.\nThe best part of playing a first person shooter is to actually play the game itself rather than have all those collectibles and a 100 upgrades that are hidden in corners for you to discover. The game means business; It d... ",
    "gameID": 0,
    "author": "marker_1988"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2016-12-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "A turning point...\nI remember, back when print was relevant subscribing to PC GAMER UK. Flicking through the pages, my young eyes came across bold lettering proclaiming \"The Woodstock of gaming\" accompanied by a vividly bright orange and b... ",
    "gameID": 0,
    "author": "uninspiredcup"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2017-03-30T00:00:00.000Z",
    "score": 9.0,
    "comments": "A watershed in the FPS genre\nHalf-Life is one of the most important games of the history, mainly of Genero FPS, Valve began with everything, the game revolutionized the genre, did innovating things, like the physics in the games, where it was someth... ",
    "gameID": 0,
    "author": "netosilva"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2017-06-11T00:00:00.000Z",
    "score": 9.0,
    "comments": "A watershed in the FPS genre\nHalf-Life is one of the most important games of the history, mainly of Genero FPS, Valve began with everything, the game revolutionized the genre, did innovating things, like the physics in the games, where it was someth... ",
    "gameID": 0,
    "author": "phantomdark"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2017-07-14T00:00:00.000Z",
    "score": 8.0,
    "comments": "High quility, but not quite Half-Life\nReplaying this it\u0027s not quite as great as I remember. Back to back with Half-Life it quickly becomes apparent what the better game is.Start with the positives though. It has a meaty 9-10 hour campaign, longer than most f... ",
    "gameID": 0,
    "author": "uninspiredcup"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-04-25T00:00:00.000Z",
    "score": 5.0,
    "comments": "Half-Life Review\nI have just completed playing Half-Life, and the game left me with some mixed feelings about it. I initially chose to play Half-Life due to the fact that it\u0027s known as one of the best video games of all time, and I wante... ",
    "gameID": 0,
    "author": "ulycc"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-09-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Half-Life is everything to me.\nHi! I\u0027m brazilian gamer and i love games, of course. The Half-Life is a thing important to my life, he so good and awesome mechanics and the sounds is so good and realistic, a game 1998 year impressed me, this so magnif... ",
    "gameID": 0,
    "author": "bhekouhai"
  }
]
