[
  {
    "source": "http://www.2404.org/modules.php?name\u003dReviews\u0026rop\u003dshowcontent\u0026id\u003d73",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "Nothing less than a revolution in the gaming industry that will keep gamers busy for years to come, just as the original did.",
    "gameID": 4,
    "author": "CPUGamer"
  },
  {
    "source": "",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "A graphics overhaul delivers detailed facial animations and sophisticated physics that leave battle zones strewn with debris after intense shootouts with shuffling corpses, overfed curstaceans and other assorted foes. [October, p.37]",
    "gameID": 4,
    "author": ""
  },
  {
    "source": "http://pc.gamespy.com/pc/half-life-2/566585p1.html",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "From its opening moments to its spectacular closing sequences, Half-Life 2 assaults you with a variety of gameplay styles and memorable moments, all executed with amazing precision.",
    "gameID": 4,
    "author": "GameSpy"
  },
  {
    "source": "http://www.gamerarchive.com/site/reviews/pc/halflife2.php",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "Valve have once again managed to transform a genre, and taken pure gaming pleasure to brand new, unthought of heights. The sheer number of moments you\u0027ll be astounded by the graphical touches, by the storyline, by the sheer polished nature of the title, and even the incredible level design is quite astounding.",
    "gameID": 4,
    "author": "GamerArchive"
  },
  {
    "source": "http://www.cincinnati.com/freetime/games/reviews/120204_half-life2.html",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "I found the little things most impressive. Telephone lines ripple from the wind kicked up by passing alien gun ships. Even motes of dust meander into view as they casually flit through rays of sunshine.",
    "gameID": 4,
    "author": "Cincinnati Enquirer"
  },
  {
    "source": "http://www.etoychest.org/content.php?review.773",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "The delivered promise of video games to stand alongside cinema and literature as works of art. It accomplishes this through extraordinary graphical and audio prowess, wrapped around a riveting story and conveyed by unsurpassed gameplay...It is, bar none, the finest game I\u0027ve ever played.",
    "gameID": 4,
    "author": "eToychest"
  },
  {
    "source": "http://www.avault.com/reviews/review_temp.asp?game\u003dhl2",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "Valve\u0027s inclusion of an interactive physics-based environment and the wonderful gravity gun lends itself to fun gravity puzzles, making use of good old-fashioned common sense and intuition - something I\u0027ve found to be absent in the average first-person shooter.",
    "gameID": 4,
    "author": "Adrenaline Vault"
  },
  {
    "source": "http://www.gamevideovault.com?id\u003d1096",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "We laughed, we gaped, we cried, screamed, and on a few occasions, came dangerously close to wetting ourselves.",
    "gameID": 4,
    "author": "Gamer.tv"
  },
  {
    "source": "http://pc.gamerfeed.com/gf/reviews/546/",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "There is extensive use of lighting, shadows, and sounds. There is nothing like the howl of an evolved head-crab zombie to completely freeze a player in his tracks. The giant spidery Striders never fail to be both threatening and awe-inspiring.",
    "gameID": 4,
    "author": "GamerFeed"
  },
  {
    "source": "http://www.thunderboltgames.com/reviews/viewreview.php?rid\u003d576",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "As excellent as the storyline is, you could completely ignore it and still have an amazing experience.",
    "gameID": 4,
    "author": "Thunderbolt"
  },
  {
    "source": "http://www.eurogamer.net/article.php?article_id\u003d57222",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "Half-Life 2 has astonished us from start to finish. Valve has done to the FPS genre what restaurants in Chinatown do to ducks; shredded it, smothered it in a delicious sauce of their own devising, and served it up in a way which you simply couldn\u0027t have imagined when looking at them in the pond.",
    "gameID": 4,
    "author": "Eurogamer"
  },
  {
    "source": "http://www.xequted.com/article.php?subaction\u003dshowfull\u0026id\u003d1101858684\u0026ucat\u003d4\u0026type\u003dreviews",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "To put it simply, there is never a dull moment in Half-Life 2. In playing the game we could hardly account for a moment when we didn\u0027t have some kind of excitement or anxiety. The Source engine is a truly remarkable achievement.",
    "gameID": 4,
    "author": "Xequted"
  },
  {
    "source": "http://www.g4techtv.com/xplay/features/50469/HalfLife_2_Review.html",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "Half-Life 2 hits the ground running and never stops, and playing it for long periods of time can actually be exhausting. Just when you think you\u0027ve seen the coolest thing it has to throw at you, the next sequence tops it.",
    "gameID": 4,
    "author": "G4 TV"
  },
  {
    "source": "http://www.gamepro.com/computer/pc/games/reviews/39548.shtml",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "The way things fly, catch fire, and fall not only carries consequences that add weight to your war of the worlds, but also creates situations that reward guile, guts, and instinct... Everything about Half-Life 2 is remarkable.",
    "gameID": 4,
    "author": "GamePro"
  },
  {
    "source": "http://entertainment.timesonline.co.uk/article/0,,14935-1358760,00.html",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "A simple but elegant narrative imbues the experience with considerable inertia. Urgent, funny, frightening and bleak, Half-Life 2 tells its tale of rebellion against a grim European dystopia with ease and vigour.",
    "gameID": 4,
    "author": "Times Online"
  },
  {
    "source": "http://www.cgonline.com/content/view/142/50/",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "Every time you feel that you\u0027ve had your fill of a particular type of gameplay, Half-Life 2 introduces some new wrinkle that reinvigorates the entire experience...It\u0027s certainly one of the most masterfully paced [games ever]. It\u0027s the type of game that you can\u0027t wait to talk about with other people. [Jan 2005, p.60]",
    "gameID": 4,
    "author": "Computer Games Magazine"
  },
  {
    "source": "http://www.smh.com.au/news/Games/Pick-of-the-bunch/2004/12/01/1101577493985.html",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "No other game provides such rich atmosphere or better blends exciting action with sublime storytelling. It is much more than a science-fiction shoot-\u0027em up: the adventure has convincing characters with great emotional depth and thrilling cinematic set pieces providing astonishing spectacle.",
    "gameID": 4,
    "author": "The Sydney Morning Herald"
  },
  {
    "source": "http://www.justadventure.com/reviews/HL2/HL2.shtm",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "It\u0027s solid and requires, thanks to the variety and great AI of the enemy you meet throughout, more than a modicum of strategic thinking to get through with a good selection of interesting weapons on offer.",
    "gameID": 4,
    "author": "Just Adventure"
  },
  {
    "source": "http://www.fourfatchicks.com/Reviews/Half_Life_2/HL2.shtml",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "Represents the pinnacle of great action shooters because it strictly adheres to the one rule that makes an FPS great, the one rule that so many developers ignore, or break due to ineptitude and then conceal behind a shroud of tacked-on complexity: in a first person shooter, level design is everything.",
    "gameID": 4,
    "author": "Four Fat Chicks"
  },
  {
    "source": "http://www.frictionlessinsight.com/archives/2004/12/halflife_2_revi.html",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "A game that is best experienced rather than described. It\u0027s like trying to describe \"Blade Runner\" or \"Minority Report\" to someone. You\u0027re better off just experiencing it.",
    "gameID": 4,
    "author": "Frictionless Insight"
  },
  {
    "source": "http://www.gaming-age.com/cgi-bin/reviews/review.pl?sys\u003dpc\u0026game\u003dhalflife2",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "Where it goes beyond a typical first person shooter is in its story telling. The graphics engine is so realistic that you feel like you are participating in a movie. The character\u0027s facial animation is incredible. It\u0027s done so well, you can get a sense of how the characters are feeling.",
    "gameID": 4,
    "author": "Gaming Age"
  },
  {
    "source": "http://pc.boomtown.net/en_uk/articles/art.view.php?id\u003d6711",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "A game designed to excel in all areas with one goal \u0027 making the player feel at the centre of the action and in control. The level of interaction with the world is breathtaking and heightens the sense of danger and the rewards for success.",
    "gameID": 4,
    "author": "Boomtown"
  },
  {
    "source": "http://www.totalvideogames.net/pages/articles/index.php?game_id\u003d2039\u0026article_id\u003d6791",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "It\u0027s a perfect cocktail of action, suspense, logic, style and substance; you simply couldn\u0027t ask for anything more.",
    "gameID": 4,
    "author": "Total Video Games"
  },
  {
    "source": "",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "Half-Life 2 is a first-person shooter. But in action, storytelling, technical achievement, atmosphere and intensity it has far outdone its peers. Valve just hit the top note no other PC game developer could reach...The excuse that \u0027it\u0027s just a game\u0027 won\u0027t cut it anymore. [Dec 2004, p.102]",
    "gameID": 4,
    "author": ""
  },
  {
    "source": "",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "Stripped of its hype-induced hysteria and lore, and isolated as a pure action showcase, Half-Life 2 is one of the most satisfying efforts in recent years. [Dec 2004, p.82]",
    "gameID": 4,
    "author": ""
  },
  {
    "source": "http://gamesdomain.yahoo.com/pc/halflife_2/review/53636",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "This is a jaw-dropping, exhilarating game. It\u0027s the game you\u0027ll remember for years.",
    "gameID": 4,
    "author": "Yahoo!"
  },
  {
    "source": "http://www.gamers-depot.com/games/action/hl2/review/001.htm",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "If you can take the best puzzle-guessing, enemy-fighting, graphically beautiful shooters out there and combine them \u0027 you\u0027d come close to hitting the mark that makes up HL2.",
    "gameID": 4,
    "author": "Gamers Depot"
  },
  {
    "source": "http://www.armchairempire.com/Reviews/PC%20Games/half-life-2.htm",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "Half-Life 2 isn\u0027t flawless, just like any great work of art, but that doesn\u0027t make it any less of a masterpiece.",
    "gameID": 4,
    "author": "Armchair Empire"
  },
  {
    "source": "http://www.nytimes.com/2004/11/25/technology/circuits/25game.html?ex\u003d1102400752\u0026ei\u003d1\u0026en\u003de3a5cf6f48defd10",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "No other game does as many things as well as Half-Life 2; I had so much fun that I can forgive the game its abysmal ending. I was continually enthralled and amazed.",
    "gameID": 4,
    "author": "The New York Times"
  },
  {
    "source": "",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "It\u0027s a game that somehow manages to simultaneously fulfill all expectations yet finish with the player unsatisfied and craving for more. [Feb 2005, p.92]",
    "gameID": 4,
    "author": ""
  },
  {
    "source": "http://www.gamepro.com.au/index.php/id;1181166017;fp;2;fpid;36",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 10.0,
    "comments": "No other game has ever lived up to six years of hype and then left gamers so glued to their PCs that 24 hours later.",
    "gameID": 4,
    "author": "Australian GamePro"
  },
  {
    "source": "http://www.gamechronicles.com/reviews/pc/halflife2/halflife2.htm",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.9,
    "comments": "Lighting is outstanding and there is a definitive passage of time that is reflected with various night and day conditions.",
    "gameID": 4,
    "author": "Game Chronicles"
  },
  {
    "source": "http://insidegameronline.com/pc.php?view\u003dreviews\u0026id\u003d122",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.8,
    "comments": "Half-Life 2\u0027s greatest triumph, however, is not in any of these individual elements, but in the Orwellian milieu created by constant reminders that you are not the hunter, but the hunted.",
    "gameID": 4,
    "author": "Inside Gamer Online"
  },
  {
    "source": "http://www.viavga.com/default.asp?PageID\u003d30\u0026Review\u003d20",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.8,
    "comments": "The seamless collaboration of sight and sound, storytelling and fast paced game play gell with the animations, physics, and environment interaction to make for the most suspenseful, gripping and action packed FPS game ever made.",
    "gameID": 4,
    "author": "VIA Gamers Arena"
  },
  {
    "source": "http://www.ic-games.co.uk/index.php?location\u003d1\u0026\u0026articleid\u003d2306",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.8,
    "comments": "There just isn\u0027t anything that can touch Half-Life 2. It\u0027s the bees\u0027 knees, the cats\u0027 whiskers; hell it\u0027s the dogs bo- lets just say it\u0027s pretty damned good.",
    "gameID": 4,
    "author": "IC-Games"
  },
  {
    "source": "",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.8,
    "comments": "History in the making. It raises the bar for interactive entertainment, and then uses that bar to club all other games into submission...Valve has forged the framework for the next generation of games, demonstrating what our medium can and should be able to accomplish - an exhilarating entertainment that can emotionally move you one moment, kick ass the next, and keep you immersed the whole time. [Dec 2004, p.48]",
    "gameID": 4,
    "author": ""
  },
  {
    "source": "http://www.jolt.co.uk/index.php?articleid\u003d2950",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.8,
    "comments": "On the whole, Half-Life 2 manages to be an incredible new game while still retaining that unique Half-Life magic.",
    "gameID": 4,
    "author": "Jolt Online Gaming UK"
  },
  {
    "source": "http://reviews.gaminghorizon.com/media2/1112204880.26.html",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.8,
    "comments": "Half-Life 2, simply put, is a complete masterpiece; once again, the definition of what gaming is all about. Shame on you if you haven’t already played it. Loser.",
    "gameID": 4,
    "author": "Gaming Horizon"
  },
  {
    "source": "http://pc.ign.com/articles/566/566202p1.html",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.7,
    "comments": "Simply a masterpiece -- a work of art in the genre. Not only does it engage the mind with mysterious happenings, vagaries, and mostly intelligent dialogue, but also captures the senses with a superb visual style made possible by brilliant technology.",
    "gameID": 4,
    "author": "IGN"
  },
  {
    "source": "http://www.computerandvideogames.com/reviews/reviews_story.php?id\u003d111902",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.7,
    "comments": "This game is so close to flawless it\u0027s painful to the eye. It\u0027s so beautifully constructed, so immaculate, I can barely bring myself to divulge its details...Simply the most essential gaming experience of the year, the game the entire FPS genre has been building towards for the past decade, and one of the defining moments of the videogame medium as a whole. [PC Zone]",
    "gameID": 4,
    "author": "Computer and Video Games"
  },
  {
    "source": "http://www.game-over.net/reviews.php?id\u003d963",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.7,
    "comments": "It\u0027s a beautiful game with fantastic design and writing that\u0027s a little short but delivers boatloads of action in what time you do end up playing.",
    "gameID": 4,
    "author": "Game Over Online"
  },
  {
    "source": "http://www.gamezilla.com/review.aspx?review\u003d8990",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.7,
    "comments": "One of the least entertaining things in Half-Life 2 is the weaponry. With the exception of the gravity gun, this game features the same boring weaponry that we\u0027ve seen time and time again.",
    "gameID": 4,
    "author": "Gamezilla!"
  },
  {
    "source": "http://www.worthplaying.com/article.php?sid\u003d21529\u0026mode\u003dthread\u0026order\u003d0",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.7,
    "comments": "Half-Life 2 doesn\u0027t have any radically new technology under its hood, but every bit of it is as polished as the floor of a palace...A lock for Game of the Year but also as the yardstick against which future first-person shooters will be compared for years to come.",
    "gameID": 4,
    "author": "Worth Playing"
  },
  {
    "source": "http://www.gamebiz.com.au/reviews.php?action\u003ddisplay\u0026id\u003d493",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.7,
    "comments": "If you\u0027re looking for a game that sucks you right into the screen, this is it. This is your FPS benchmark, this is the game of the year; this game is the beautiful, imaginative, detailed masterpiece of 2004.",
    "gameID": 4,
    "author": "GameBiz"
  },
  {
    "source": "http://pgnx.net/reviews.php?page\u003dfull\u0026id\u003d7240",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.7,
    "comments": "The game, simply put, looks absolutely spectacular...The best thing about the graphics is how great the game will look and perform on today\u0027s entry-level rigs.",
    "gameID": 4,
    "author": "PGNx Media"
  },
  {
    "source": "http://www.atomicgamer.com/article.php?id\u003d96",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.7,
    "comments": "Half-Life 2 will dominate the first person shooter market for years.",
    "gameID": 4,
    "author": "AtomicGamer"
  },
  {
    "source": "http://gamesradar.msn.co.uk/reviews/default.asp?pagetypeid\u003d2\u0026articleid\u003d32810\u0026subsectionid\u003d1609",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.6,
    "comments": "A game of a higher order of magnitude than any of the previous pretenders to the throne. The polish and the stratospheric production values mean that Half-Life 2 is a magnificent, dramatic experience that has few peers. [PC Gamer UK, Dec 2004, p.66]",
    "gameID": 4,
    "author": "Games Radar"
  },
  {
    "source": "http://www.pcformat.co.uk/reviews/default.asp?pagetypeid\u003d2\u0026articleid\u003d33131\u0026subsectionid\u003d680",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.6,
    "comments": "Revel, savour and bask in the brilliance; this is a game that no gamer can afford to ignore... The PC\u0027s finest gaming moment, with a half-life of forever. [Nov 2004, p.83]",
    "gameID": 4,
    "author": "PC Format"
  },
  {
    "source": "http://www.gamershell.com/pc/half_life_2/review.html",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.6,
    "comments": "The mods that will be developed with the Source engine will be some of the best games that we will play. Only the future holds what Half Life 2 can bring us.",
    "gameID": 4,
    "author": "Gamer\u0027s Hell"
  },
  {
    "source": "http://www.xgpgaming.com/content.php?category\u003dDeskPC\u0026type\u003dreview\u0026id\u003d1042",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.6,
    "comments": "The graphics are marvelous, the sounds enthrall you, the character models are remarkably realistic looking, the environment is engrossing and the controls are optimized to control Gordon Freeman and all of his actions.",
    "gameID": 4,
    "author": "XGP Gaming"
  },
  {
    "source": "http://www.ferrago.com/story/4805",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.5,
    "comments": "An ephemeral and controversial ending, along with the few issues described above, means that for me, Half-Life 2, while a compelling and highly enjoyable game, falls short of the size of impact that the first title had on the gaming world.",
    "gameID": 4,
    "author": "Play.tm"
  },
  {
    "source": "",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.5,
    "comments": "Technical wizardry is married to artistic brilliance throughout the presentation, from the oddly beautiful vistas of a post-apocalyptic Earth to the creepy alien Citadel...This will be remembered as a historic occasion in gaming. [Dec 2004, p.184]",
    "gameID": 4,
    "author": ""
  },
  {
    "source": "http://www.3davenue.com/index.php?mod\u003darticle\u0026id\u003d912",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.5,
    "comments": "You will be hard pressed to find a FPS that looks better than Half Life 2 when it is played at its max settings.",
    "gameID": 4,
    "author": "3DAvenue"
  },
  {
    "source": "http://www.gamerseurope.com/articles/633",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.5,
    "comments": "The closest thing to perfection you\u0027ll play this year. You\u0027d be a fool to miss out.",
    "gameID": 4,
    "author": "Gamers Europe"
  },
  {
    "source": "http://www.firingsquad.com/games/half_life_2_review/",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.5,
    "comments": "It\u0027s more polished, refined and spit-shined than any game since \"StarCraft\"...The most remarkable thing about Half-Life 2 is that it manages to perfectly recapture that magical feeling from the original of being there.",
    "gameID": 4,
    "author": "FiringSquad"
  },
  {
    "source": "http://www.loadedinc.com/review.php?temp_view\u003dreview.php\u0026game\u003dHalf%20Life%202\u0026id\u003d455",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.5,
    "comments": "So while there are problems this game is still a cracker. It\u0027s one of those games that reminds PC gamers why they prefer PC gaming over console.",
    "gameID": 4,
    "author": "IncGamers"
  },
  {
    "source": "http://www.gamepower.com.au/?aid\u003d2243",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.5,
    "comments": "It\u0027s true that Valve\u0027s sequel isn\u0027t as revolutionary as the original was back in 1998, but it\u0027s arguably the best first person shooter you\u0027ve ever played, and that certainly makes it worth your while.",
    "gameID": 4,
    "author": "Game Power Australia"
  },
  {
    "source": "http://www.nlgaming.com/nl/asp/id_1074/nl/reviewDisp.htm",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.5,
    "comments": "This game is well made and has a level of polish that tends to be only found in Blizzard games.",
    "gameID": 4,
    "author": "Next Level Gaming"
  },
  {
    "source": "http://www.gamingtrend.com/Reviews/review/review.php?ReviewID\u003d297",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.5,
    "comments": "I have had a dream of how good this game could be for a long time, and it was immediately kicked out the door for not being grand enough.",
    "gameID": 4,
    "author": "GamingTrend"
  },
  {
    "source": "http://www.computergames.ro/site/p/articles/o/review/lng/en/artid/588/half_life_2.html",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.5,
    "comments": "The attention to detail is simply staggering and I\u0027m not referring just to City 17. The sky is beautiful, regardless of the time of day, a lot of the surfaces are bump-mapped and I often found myself using the zoom to see just how good the objects looked in the distance.",
    "gameID": 4,
    "author": "Computer Games Online RO"
  },
  {
    "source": "http://www.elecplay.com/reviews_article.php?article\u003d11199",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.5,
    "comments": "With tasty graphics and gameplay that is sheer madness, Half-life 2 is sweeter than a chocolate-and-honey lollipop coated with sugar, and it provides twice the rush.",
    "gameID": 4,
    "author": "Electric Playground"
  },
  {
    "source": "http://pc.gamezone.com/gzreviews/r21320.htm",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.5,
    "comments": "The great graphics, incredible physics\u0027 engine, impressive sound/music and engaging story line all add up to a classic game.",
    "gameID": 4,
    "author": "GameZone"
  },
  {
    "source": "http://www.cnet.com.au/games/0,39029241,40002562,00.htm",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.5,
    "comments": "Simply extraordinary. It’s clear from the start that Valve have pulled out all the stops, resulting in a well polished game that’s graphically spectacular.",
    "gameID": 4,
    "author": "GameSpot AU"
  },
  {
    "source": "http://www.mygamer.com/index.php?page\u003dgameportal\u0026mode\u003dreviews\u0026id\u003d69",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.4,
    "comments": "Some may find it tedious and even frustrating at times, but there are enough jaw-dropping moments throughout the campaign that still make Half Life 2 one of the greatest first person shooters ever.",
    "gameID": 4,
    "author": "My Gamer"
  },
  {
    "source": "http://wham.canoe.ca/pc/reviews/2004/11/21/724326.html",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.4,
    "comments": "A gaming masterpiece that combines groundbreaking technology, atmosphere and all-out action. It\u0027s the closest you\u0027ll get to starring in your own sci-fi flick.",
    "gameID": 4,
    "author": "WHAM! Gaming"
  },
  {
    "source": "http://www.gamerstemple.com/games4/000684/000684r01.asp",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.4,
    "comments": "If you want to lose yourself completely in a game or need a reminder of why you enjoy gaming so much, Half-Life 2 is exactly what you need.",
    "gameID": 4,
    "author": "Gamers\u0027 Temple"
  },
  {
    "source": "http://www.totalgames.net/pma/21461",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.4,
    "comments": "Half-Life 2 establishes a class-step in gaming we haven\u0027t seen since \"Elite\" on the BBC Micro.",
    "gameID": 4,
    "author": "TotalGames.net"
  },
  {
    "source": "http://www.actiontrip.com/reviews/halflife2.html",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.3,
    "comments": "Half-Life 2 is not perfect. The bizarre decision to include teammates in the way that Valve has, as well as the many and annoying loading times can actually diminish some of the fun factor. That said, this is still a game you don\u0027t want to miss.",
    "gameID": 4,
    "author": "ActionTrip"
  },
  {
    "source": "http://www.gamingnexus.com/Review.asp?ID\u003d630",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.2,
    "comments": "A crowning achievement for Valve and one game that I thoroughly enjoyed. A few problems do exist such as the crashing and minor engine quirks. All in all, a wonderful PC game and one that fans of the original will love.",
    "gameID": 4,
    "author": "Gaming Nexus"
  },
  {
    "source": "http://www.pcgameworld.com/review.php/id/545/Half-Life_2/",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.2,
    "comments": "One issue that pops up early is the game\u0027s rather inept AI. Enemies just do not have the kind of intelligence or cleverness the first game had. Combine soldiers do little to evade your fire, preferring to just stand there shooting at you.",
    "gameID": 4,
    "author": "PC Gameworld"
  },
  {
    "source": "http://www.warcry.com/scripts/columns/view_sectionalt.phtml?site\u003d15\u0026id\u003d67\u0026colid\u003d5809",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.2,
    "comments": "The only part that was truly lacking was the multiplayer—hopefully, we see something better in the coming weeks from either Valve or from the fans. The modding community will definitely rally behind Half Life 2 for years to come.",
    "gameID": 4,
    "author": "Warcry"
  },
  {
    "source": "http://www.gamespot.com/pc/action/halflife2/review.html?q\u003d1\u0026tag\u003dgs_hp_flashtop_bg",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.2,
    "comments": "While Half-Life 2 breaks little new ground, it\u0027s still a superb and engaging first-person shooter, as well as an amazing technological accomplishment.",
    "gameID": 4,
    "author": "GameSpot"
  },
  {
    "source": "http://www.game-revolution.com/games/pc/action/half-life_2.htm",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.1,
    "comments": "It presents the most exciting single-player first-person game you\u0027ll find on any system this year. It\u0027s a shame that the product is marred by issues that have little to do with the game itself, because ultimately, the games are what matter most.",
    "gameID": 4,
    "author": "Game Revolution"
  },
  {
    "source": "",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.0,
    "comments": "Considering how well Valve got the action down pat, I was very unpleasantly surprised that they managed to fumble the storyline so badly. HL2 starts off with such promise and ends with something akin to what you\u0027d find in \"[deleted]\" which is a travesty of a mockey of a sham, if there ever was one.",
    "gameID": 4,
    "author": ""
  },
  {
    "source": "http://www.1up.com/do/reviewPage?cId\u003d3136772\u0026did\u003d1",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.0,
    "comments": "Frankly, it seems like much of the game\u0027s technological potential is being squandered on a 3D game whose actual road to progress is every bit as two-dimensional as an 8-bit platformer.",
    "gameID": 4,
    "author": "1UP"
  },
  {
    "source": "http://cgw.1up.com/do/reviewPage?cId\u003d3137399\u0026did\u003d4",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.0,
    "comments": "The biggest and only serious bummer of Half-Life 2 is the installation -- and it\u0027s so bad that we\u0027re knocking the game\u0027s final score.",
    "gameID": 4,
    "author": "Computer Gaming World"
  },
  {
    "source": "http://www.gameshark.com/index.asp?s\u003d240_33a0401e-d9ae-49d3-8c2b-392ea569f87\u0026a\u003dreviews\u0026id\u003d1979",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.0,
    "comments": "While it may do what other games have already done, the important point is that it does it better.",
    "gameID": 4,
    "author": "GameShark"
  },
  {
    "source": "http://www.gamecritics.com/review/halflife2/main.php",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.0,
    "comments": "More than anything else, I suppose, Half-Life 2 is the story of a group of developers in love with their physics engine.",
    "gameID": 4,
    "author": "GameCritics"
  },
  {
    "source": "http://www.gamenikki.com/Pages/Reviews/PC/Half-Life2//index.php4",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.0,
    "comments": "One of the best games ever made. Not getting this game should be a crime.",
    "gameID": 4,
    "author": "Gamenikki"
  },
  {
    "source": "http://www.vgpub.com/Half-Life-2-Review/review",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 9.0,
    "comments": "What matters is that Valve has managed to put together an excellent FPS with a gripping plot, eye candy graphics, and thrilling combat. Those three are rarely seen together in an era of copycat FPS games, which makes Half-Life 2 a breath of fresh air.",
    "gameID": 4,
    "author": "VGPub"
  },
  {
    "source": "",
    "date": "1970-01-01T07:30:00.000Z",
    "score": 8.5,
    "comments": "I think this is probably the worst teammate AI I\u0027ve seen in an FPS since \"Daikatana.\" It\u0027s like every one of your followers are the Redshirt sidekicks from \"Star Munchkin.\"",
    "gameID": 4,
    "author": ""
  }
]