[
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2018-02-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "Amazing game but only for few people.\nA lot of words have been said before I only want to say that I adored this game. If you don\u0027t pay an attention to bugs, glitches and give an opportunity to this game you\u0027ll won\u0027t regret this. Okey, sometimes you just ca... ",
    "gameID": 0,
    "author": "microl"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2018-02-17T00:00:00.000Z",
    "score": 8.0,
    "comments": "Unfinished Materpiece\nThere it was. Finally. A game that seemed to do where Skyrim failed. True amazing deep immersion in a thriving responding game world. And it turned out to be just that. And yet at the same time turned out to be not. The... ",
    "gameID": 0,
    "author": "matheo81"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2018-02-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "Good game worth the money\nI love this game because it’s a medieval open world 100% realistic you haft to go to bed eat you can read sharpen your weapons play how you want and when I was playing bf hardline when it came out I wanted to create a re... ",
    "gameID": 0,
    "author": "wnewsome"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2018-03-12T00:00:00.000Z",
    "score": 8.0,
    "comments": "sometimes being very realistic works.\nit is very common to see medieval RPG games, but when a game decided to be a realistic medieval RPG? Kingdom Come Deliverance promises to be a mediocre simulator, does he achieve this? When I saw Kingdom Come Deliverance... ",
    "gameID": 0,
    "author": "phantomdark"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2018-03-13T00:00:00.000Z",
    "score": 1.0,
    "comments": "Liars\nWhen I started playing this game, I liked it and I even went through it, and after that I went to see what they were saying about it on YouTube and I was surprised! I saw the trailers of the game and realized that I was ... ",
    "gameID": 0,
    "author": "joseph_joffre"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-04-07T00:00:00.000Z",
    "score": 8.0,
    "comments": "A must play for RPG fans but buggy\nAs far as RPG concepts go this one takes the cake. It is the most realistic game i have ever played. You get dirty, if your horse stinks you stink, your gear gets worn out and if it is destroyed then it is beyond repair... ",
    "gameID": 0,
    "author": "rallierf1"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2018-07-01T00:00:00.000Z",
    "score": 7.0,
    "comments": "Henry has his own developing story, from nothing to know to beat them all\nUpdate on 1.7. The patch 1.7 seems to have broken more things than it fixed.It brought a lot of visual bugs to me which were not happening in previous version.Henry is sitting in the air while to talking to Stephanie dur... ",
    "gameID": 0,
    "author": "savvym"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2018-07-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "I love the peace of the game\nIf you are like me and you like to take games slow I think this is the right game for you.Do not think that Kingdom Come will be like the typical RPG such as Skyrim or The Witcher where there is a lot of actions and fast... ",
    "gameID": 0,
    "author": "jmarcher"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2018-08-18T00:00:00.000Z",
    "score": 5.0,
    "comments": "Not optimized for an openworld game\nThe game\u0027s developers have tried to imitate something roughly in between Skyrim and Witcher, yet they came up with a poor design for an open-world game. There are a number of flaws that absolutely tear the joy out of pla... ",
    "gameID": 0,
    "author": "garrythesloth"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-02-27T00:00:00.000Z",
    "score": 9.0,
    "comments": "Reviewing one year after release\nWhen Kingdom Come was first released, I read many warnings to avoid the game until bugs were fixed. So bear in mind, my review is for the completed end product, and an experience lightened with a mod that allowed for unl... ",
    "gameID": 0,
    "author": "antipunt1"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-03-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "about this game\nthe best game i played in my life. i played ac origins , odisey , far cry 5 and primal , but this game named kingdom come dleiverance changed my life and my vision about video games. Bugs don\u0027t exist! I played with veris... ",
    "gameID": 0,
    "author": "muieusr102"
  }
]
