[
  {
    "source": "https://www.gamingnexus.com/Article/5609/Kingdom-Come-Deliverance/",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "Kingdom Come will break you down. It will humble you. It will remind you that you’ve got a lot to learn. Whether that means making your fingers do more WASD gymnastics than you’ve ever done in a first-person game, or giving you the down and dirty as to the extended services provided in the bath house. It acknowledges what a thorough hell it is for women living under a complete patriarchy. It’ll also give you a feel for what it was like to walk through the streets of the Late Middle Ages, with its still-primitive technologies and its utter lack of plumbing.",
    "gameID": 0,
    "author": "Gaming Nexus"
  },
  {
    "source": "http://www.gamerevolution.com/review/368221-kingdom-come-deliverance-review-hardcore-henry",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "If you want a bug-free experience, don\u0027t get Kingdom Come. If you want an excellent, open-world RPG that feels like a hardcore version of an Elder Scrolls game, then don\u0027t hesitate...Warhorse did a magnificent job crafting Kingdom Come: Deliverance with only a fraction of the funding that an Elder Scrolls game would receive, and I can\u0027t wait to see how it supports this game and what its future titles have in store for us.",
    "gameID": 0,
    "author": "Game Revolution"
  },
  {
    "source": "https://www.gamespew.com/2018/02/kingdom-come-deliverance-review/",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "In Kingdom Come: Deliverance you\u0027re just a small cog in a reasonably big world, but your actions feel like they have worth and impact. You\u0027ll prove yourself to be helpful many a time, but often you\u0027ll have to rely on others for assistance, or to even do the job for you. It goes a long way to make the land of Bohemia a living, breathing place rather than just your personal playground, and I admire that. It\u0027s by no means free of frustration, but Kingdom Come: Deliverance is a special game. It\u0027s a game that isn\u0027t afraid of being different - of not holding the player\u0027s hand every step of their adventure - and for that, it\u0027s an experience to be treasured.",
    "gameID": 0,
    "author": "GameSpew"
  },
  {
    "source": "https://multiplayer.it/recensioni/194995-kingdom-come-deliverance-la-recensione-di-kingdom-come-deliverance.html",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 8.9,
    "comments": "Kingdom Come: Deliverance works as a whole, less in its single mechanics. It is not easy to explain how a game can be unforgettable and flawed at the same time, but sooner or later the world of video games will have to start to deal with the philosophical truth that perfection is sterile.",
    "gameID": 0,
    "author": "Multiplayer.it"
  },
  {
    "source": "https://www.thegamesmachine.it/kingdom-come-deliverance/kingdom-come-deliverance-recensione/",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 8.6,
    "comments": "It\u0027s almost impossible not to compare Kingdom Come: Deliverance with the Witcher series: there\u0027s absolutely no fantasy in the Warhorse production, but it boasts a strong character, an enormous quantity of content, choices that matter, and an adult and mature storyline. You can\u0027t expect the same visual quality or a comparable level of polish (pun intended), but the battles are like nothing you\u0027ve ever seen, and the depth of the simulation really drags the player into a beautiful medieval novel.",
    "gameID": 0,
    "author": "The Games Machine"
  },
  {
    "source": "https://www.gamewatcher.com/reviews/kingdom-come-deliverance-review/12970",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 8.0,
    "comments": "Kingdom Come: Deliverance is a very good and immersive title, but it suffers from technical issues and some surprisingly misguided design decisions. I was completely enthralled by the first three hours of the game, but the more I explored its systems, the more grating they became. It never stopped it from being a great title – and it occasionally recaptured that magical immersion from the first few hours – but its issues are so severe that they effectively ruined my enjoyment of what is an otherwise very good game.",
    "gameID": 0,
    "author": "GameWatcher"
  },
  {
    "source": "http://www.darkstation.com/reviews/kingdom-come-deliverance-review",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 8.0,
    "comments": "I’m still surprised with how well the drama is acted and how the script effortlessly transports you into a Medieval Europe frame of mind without too many anachronisms to ruin the flow. You don’t see very many video games like this and even though there’s still more game to play, I find the whole thing very cool. Kingdom Come: Deliverance requires a whole lot of patience, reading, studying, and analyzing how things work. Beyond these hurdles lies a fine piece of interactive historical fiction.",
    "gameID": 0,
    "author": "DarkStation"
  },
  {
    "source": "http://www.eurogamer.it/articles/2018-02-13-kingdom-come-deliverance-recensione",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 8.0,
    "comments": "Kingdom Come: Deliverance is a huge first person GDR that can count on an higher level of immersion when compared with other similar productions. The combat system is amazing and, even if it will take you some hours to handle a sword correctly, all the time will spent will be worth it. A must-have for all fans of open-world RPGs in search of deeper gameplay mechanics.",
    "gameID": 0,
    "author": "Eurogamer Italy"
  },
  {
    "source": "https://www.everyeye.it/articoli/recensione-kingdom-come-deliverance-del-gdr-warhorse-studios-37337.html",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 8.0,
    "comments": "Kingdom Come: Deliverance is a surprising, unique and precious experience, whose imperfections disappear in the embrace of a world in which you will leave a small part of yourself.",
    "gameID": 0,
    "author": "Everyeye.it"
  },
  {
    "source": "http://www.gamestar.de/artikel/kingdom-come-deliverance-das-tschechische-gothic,3325978.html",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 7.7,
    "comments": "Kingdom Come offers an impressively atmospheric medieval world, which now works a lot better technically after a few patches.",
    "gameID": 0,
    "author": "GameStar"
  },
  {
    "source": "http://it.ign.com/kingdom-come-deliverance-pc/136732/review/kingdom-come-deliverance-la-recensione",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 7.5,
    "comments": "Great story and medieval atmosphere, but with some technical problems, like low frame-rate, graphic pop-ups and improvable artificial intelligence.",
    "gameID": 0,
    "author": "IGN Italia"
  },
  {
    "source": "http://www.cubed3.com/review/4613/1/kingdom-come-deliverance-pc.html",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 7.0,
    "comments": "As realistic, historically accurate, unrelenting, casual-unfriendly, open-word RPG games go, Kingdom Come: Deliverance is probably the best on offer right now. It\u0027s only worthy of the bronze medal, though, as it\u0027s very far from perfect, and the amount of flaws at hand mean that this is quite the dirty kind of bronze medal.",
    "gameID": 0,
    "author": "Cubed3"
  },
  {
    "source": "https://www.hardcoregamer.com/2018/02/13/review-kingdom-come-deliverance/289947/",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 7.0,
    "comments": "Had the initial forty-to-fifty hour campaign not delivered the level of bugs and problems present in the current build, you\u0027d easily be looking at potentially one of the year\u0027s best all-round experiences in an RPG and an essential for everyone no matter your affiliation with the genre. As it stands, visually, technically and mechanically sound as its foundation is, Kingdom Come: Deliverance\u0027s performance is an unruly and occasionally unpredictable beast.",
    "gameID": 0,
    "author": "Hardcore Gamer"
  },
  {
    "source": "https://www.windowscentral.com/kingdom-come-deliverance-pc-review",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 6.0,
    "comments": "Kingdom Come: Deliverance\u0027s large open world is packed full of things to do in a setting many can relate to. It\u0027s by no means perfect, which is unfortunately down to the sheer scope of the project for such a small team of developers. Still, you\u0027re going to get many hours of entertainment from this game. It\u0027s available now for around $60.",
    "gameID": 0,
    "author": "Windows Central"
  },
  {
    "source": "https://attackofthefanboy.com/reviews/kingdom-come-deliverance-review/",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 5.0,
    "comments": "Technical issues aside Kingdom Come: Deliverance is at best an ambitious game. There are flashes of brilliance in the implementation of Warhorse Studios\u0027 unique RPG systems, as it truly does have interestingly deep survival and progression elements. Though when you do take into account the technical issues it becomes a frustrating experience in which the bad completely outweighs the good.",
    "gameID": 0,
    "author": "Attack of the Fanboy"
  },
  {
    "source": "http://www.thesixthaxis.com/2018/02/13/kingdom-come-deliverance-review/",
    "date": "2018-02-13T00:00:00.000Z",
    "score": 4.0,
    "comments": "If Kingdom Come: Deliverance has a ton of bug fixing to improve the performance drastically, it could be a hidden gem. It’s clear that the game, despite its grand ambitions, was simply not ready for public consumption. Shimmers of brilliance are there and had it seen more time in the oven, or set its expectations at a more reasonable level, it could have been brilliant and scored significantly higher as a result. Alas, Kingdom Come: Deliverance is another cautionary tale rather than a trend setter.",
    "gameID": 0,
    "author": "TheSixthAxis"
  },
  {
    "source": "https://www.pcgamer.com/kingdom-come-deliverance-review/",
    "date": "2018-02-14T00:00:00.000Z",
    "score": 8.4,
    "comments": "Kingdom Come is a mess of bugs, and there’s the constant feeling that independent developer Warhorse is biting off more than it can chew. But there’s a charm to its scrappiness, and it does enough interesting stuff that I’m willing to tolerate the creaky framework struggling to prop everything up. It’s one of the most satisfying, rewarding role-playing experiences I’ve enjoyed on PC for a while, but the inconsistent performance and the game’s tendency to completely break does test my patience from time to time.",
    "gameID": 0,
    "author": "PC Gamer"
  },
  {
    "source": "https://www.pcgamesn.com/kingdom-come-deliverance/kingdom-come-deliverance-pc-review",
    "date": "2018-02-14T00:00:00.000Z",
    "score": 8.0,
    "comments": "Kingdom Come is as stubborn as it is embracing, making for a potentially tumultuous relationship between player and game. But it is a relationship I absolutely feel compelled to nurture.",
    "gameID": 0,
    "author": "PCGamesN"
  },
  {
    "source": "http://www.gameblog.fr/tests/2971-kingdom-come-deliverance-pc-ps4-xb1",
    "date": "2018-02-14T00:00:00.000Z",
    "score": 8.0,
    "comments": "Despite its technical issues and many bugs, Kingdom Come Deliverance is an excellent and really unique RPG. Its system reaches depths that has never been seen before, and assumes its diehard historical aspect at the risk of cutting itself off from a big part of the public. Here is a true ode to the European medieval period, and eventually the typical game that you will love or hate with passion.",
    "gameID": 0,
    "author": "Gameblog.fr"
  },
  {
    "source": "http://fandom.wikia.com/articles/kingdom-come-deliverance-review",
    "date": "2018-02-14T00:00:00.000Z",
    "score": 7.0,
    "comments": "Despite its lack of polish, Kingdom Come: Deliverance is an engaging ride. If players are willing to embrace the beauty of history and the challenge of survival in a world that cares nothing for its inhabitants, role-playing doesn’t come much more satisfying than this.",
    "gameID": 0,
    "author": "FANDOM"
  },
  {
    "source": "https://www.hookedgamers.com/pc/kingdom_come_deliverance/review/article-1906.html",
    "date": "2018-02-15T00:00:00.000Z",
    "score": 9.8,
    "comments": "Is this the real life? Is this just fantasy? Thankfully, Kingdom Come: Deliverance is not a landslide, a mix of game and reality. It may not capture the appeal of the overall mainstream, but that’s okay. Anyone willing to take a dive into the niche waters of the gaming world, and not afraid of games being unforgiving, should definitely check this out. I love this game. Open your eyes, give this game a try and see.",
    "gameID": 0,
    "author": "Hooked Gamers"
  },
  {
    "source": "http://cogconnected.com/review/kingdom-come-deliverance-review/",
    "date": "2018-02-15T00:00:00.000Z",
    "score": 8.1,
    "comments": "Kingdom Come: Deliverance is quite the enjoyable epic journey, warts and all. When realism is the aim, it’s hard not to notice imperfections. We do live in the real world, so it’s hard not to compare. But all the little imperfections don’t keep this from being one heck of a great ride. The story alone is 50-hours of gameplay and overall there are around 100 hours of quests to complete. There is a lot there. I couldn’t help but be reminded of the first time I played Elder Scrolls: Arena 20+ years ago. The sense of scale, that awe of something you were not expecting to be so grand.",
    "gameID": 0,
    "author": "COGconnected"
  },
  {
    "source": "https://www.spaziogames.it/recensioni_videogiochi/console_multi_piattaforma/22076/kingdom-come-deliverance-la-recensione-del-gdr-medievale.aspx",
    "date": "2018-02-15T00:00:00.000Z",
    "score": 8.0,
    "comments": "Though has some evident flaws, Kingdom Come: Deliverance is a very different RPG: great historical accuracy, well-crafted combat system, a stunning world, with some brilliant ideas and a few awful Skyrim-esque gameplay flaws.",
    "gameID": 0,
    "author": "SpazioGames"
  },
  {
    "source": "http://www.3djuegos.com/juegos/analisis/18142/0/kingdom-come-deliverance/",
    "date": "2018-02-15T00:00:00.000Z",
    "score": 8.0,
    "comments": "Kingdom Come: Deliverance is a brutal medieval RPG full of war, vengeance and beautiful environments. There are great ideas inside Warhorse Studios’ work, but the problem comes from the fact that is a very irregular game, with a few annoying bugs and a weak AI.",
    "gameID": 0,
    "author": "3DJuegos"
  },
  {
    "source": "https://www.xgn.nl/review/kingdom-come-deliverance-review",
    "date": "2018-02-15T00:00:00.000Z",
    "score": 6.5,
    "comments": "Kingdom Come Deliverance doesn\u0027t deliver on its expectations. Although the game looks stunning and the Middle Ages come to life beautifully, it\u0027s a technical mess.",
    "gameID": 0,
    "author": "XGN"
  },
  {
    "source": "https://www.theguardian.com/games/2018/feb/15/kingdom-come-deliverance-review-medieval-rpg",
    "date": "2018-02-15T00:00:00.000Z",
    "score": 6.0,
    "comments": "It wants us to take its medieval world seriously, but also wants it to be a playground, and it constantly struggles to balance these two sides of its personality. If you can embrace its quirks, it’s easy enough to lose yourself in its luscious and dynamic medieval landscape, but you’re unlikely to emerge with much insight into the historical period that it so faithfully depicts.",
    "gameID": 0,
    "author": "Guardian"
  },
  {
    "source": "http://www.ign.com/articles/2018/02/17/kingdom-come-deliverance-review",
    "date": "2018-02-16T00:00:00.000Z",
    "score": 8.0,
    "comments": "There’s a shining suit of mail underneath Kingdom Come: Deliverance’s authentically medieval grime. Strong characters and storytelling, one of my favorite first-person melee combat systems ever, and special attention given to building moment-to-moment immersion come together as a mighty alloy that ranks among the most unique, memorable RPGs I’ve played in years.",
    "gameID": 0,
    "author": "IGN"
  },
  {
    "source": "https://gamer.nl/artikelen/review/kingdom-come-deliverance-2/",
    "date": "2018-02-19T00:00:00.000Z",
    "score": 8.0,
    "comments": "Kingdom Come Deliverance is an ambitious and unique role playing game that has a lot of things to improve on. The middle ages are very real and there is lots of freedom, but the bugs and the story are in the way of this being an instant classic.",
    "gameID": 0,
    "author": "Gamer.nl"
  },
  {
    "source": "http://www.merlininkazani.com/Kingdom_Come_Deliverance-oyun_inceleme-99630p1.html",
    "date": "2018-02-19T00:00:00.000Z",
    "score": 7.5,
    "comments": "Kingdom Come: Deliverance is one of the most ambitious games we have seen in recent years. Despite its bugs and issues, it has huge potential. Warhorse has successfully delivered a game for which gamers have waiting a very long time.",
    "gameID": 0,
    "author": "Merlin\u0027in Kazanı (Turkey)"
  },
  {
    "source": "http://pu.nl/artikelen/review/kingdom-come-deliverance-review/",
    "date": "2018-02-19T00:00:00.000Z",
    "score": 7.1,
    "comments": "Kingdom Come: Deliverance is insanely deep and ambitious, but really not suitable for every casual gamer who has played Skyrim once. Not because there\u0027s no fantasy in this historically accurate RPG, but mainly due to old-fashioned gameplay mechanics, bugs and a general contempt for our precious time.",
    "gameID": 0,
    "author": "Power Unlimited"
  },
  {
    "source": "http://www.4players.de/4players.php/dispbericht/PC-CDROM/Test/35377/83014/0/Kingdom_Come_Deliverance.html",
    "date": "2018-02-19T00:00:00.000Z",
    "score": 6.8,
    "comments": "I cherish the medieval authenticity that Kingdom Come strives for. And that Warhorse implements some mechanics that separate it from other roleplaying games. But there are also loads of elements that are not worked out well enough, that are just painful to see unfold or plain buggy that I am really torn. I want to applaud the devs, but sometimes I just hate them.",
    "gameID": 0,
    "author": "4Players.de"
  },
  {
    "source": "http://letsplayvideogames.com/2018/02/review-kingdom-come-deliverance/",
    "date": "2018-02-19T00:00:00.000Z",
    "score": 4.0,
    "comments": "Kingdom Come should’ve been good. It was perfectly positioned to be a unique and refreshing break from the magical, mystical medieval worlds we so often inhabit. Thanks to the bolted-together systems that just don’t fit together, technical issues galore, and a niggling sense the game isn’t presenting its historical foundations in good faith, though, it manages to fall flat in every way.",
    "gameID": 0,
    "author": "Let\u0027s Play Video Games"
  },
  {
    "source": "https://www.gamespot.com/reviews/kingdom-come-deliverance-review-the-past-comes-at-/1900-6416861/",
    "date": "2018-02-20T00:00:00.000Z",
    "score": 8.0,
    "comments": "Even with these issues in mind, anyone who can appreciate the down-and-dirty nature of history should play Kingdom Come: Deliverance. It\u0027s an impressive and unflinching look at the medieval era that transports you inside the compelling story of a real person caught in the middle of a civil war.",
    "gameID": 0,
    "author": "GameSpot"
  },
  {
    "source": "https://www.gry-online.pl/S020.asp?ID\u003d12509",
    "date": "2018-02-20T00:00:00.000Z",
    "score": 7.5,
    "comments": "Kingdom Come: Deliverance guarantees excellent fun. It truly is a unique RPG that has all the qualities needed to become a cult classic among the fans of more hardcore games. The world, the story and the urge to explore are superb. Unfortunately, some technical issues and a controversial saving system can taint the overall impression.",
    "gameID": 0,
    "author": "GRYOnline.pl"
  },
  {
    "source": "http://worthplaying.com/article/2018/2/20/reviews/107306/",
    "date": "2018-02-20T00:00:00.000Z",
    "score": 6.7,
    "comments": "If you\u0027re looking for an open-world RPG that tends to throw you into the deep end, Kingdom Come: Deliverance definitely scratches that itch. The game could still use some patches, and I suspect many people are going to want to dip into mods to smooth down some of the title\u0027s rougher edges. There\u0027s a fine game under the layers of clunky systems and punishing early mechanics, but Kingdom Come: Deliverance is enjoyed as much as it is endured, and how often that wavers back and forth is perhaps the game\u0027s largest shortcoming.",
    "gameID": 0,
    "author": "Worth Playing"
  },
  {
    "source": "http://meristation.as.com/pc/kingdom-come-deliverance/analisis-juego/1944633",
    "date": "2018-02-21T00:00:00.000Z",
    "score": 8.5,
    "comments": "A flawed gem, but a gem nonetheless. Fantastic world building and stellar mission design for an ambitious and really interesting game that only needs an extra month of polish.",
    "gameID": 0,
    "author": "Meristation"
  },
  {
    "source": "http://www.jeuxactu.com/test-kingdom-come-deliverance-un-forgeron-et-des-bugs-a-foison-112777.htm",
    "date": "2018-02-21T00:00:00.000Z",
    "score": 6.5,
    "comments": "Kingdom Come: Deliverance has the potential to be one of the greatest RPGs of this year, but the sheer abundance of bugs make it almost unplayable. A perfect example of a game that would have benefited from an early access release.",
    "gameID": 0,
    "author": "JeuxActu"
  },
  {
    "source": "http://www.levelup.com/PC/juegos/49475/Kingdom-Come-Deliverance/review",
    "date": "2018-02-23T00:00:00.000Z",
    "score": 8.3,
    "comments": "Kingdom Come: Deliverance is an unusual success story that leaves us with an important message: in this day and age, a large amount of players can —and will enjoy— a complex game that doesn’t hold you back. We loved every second: getting lost in Bohemia sprawling forests, riding horseback on green prairies, bleedin in the thick of combat and getting stuck between some odd bushes. Kingdom Come: Deliverance it’s a game we can recommend, with caution due its numerous rough edges.",
    "gameID": 0,
    "author": "LevelUp"
  },
  {
    "source": "https://www.gamespace.com/kingdom-come-deliverance/review/",
    "date": "2018-02-23T00:00:00.000Z",
    "score": 8.0,
    "comments": "Kingdom Come is nothing short of awe-inspiring, with its flaws and all. I hope we see many more games like this from Warhorse.",
    "gameID": 0,
    "author": "GameSpace"
  },
  {
    "source": "https://www.ragequit.gr/reviews/item/kingdom-come-deliverance-pc-review",
    "date": "2018-02-25T00:00:00.000Z",
    "score": 8.8,
    "comments": "One can\u0027t help but feel awe when considering Warhorse Studios\u0027 attention to historical detail in recreating 15th century Bohemia. Kingdom Come: Deliverance is a truly unique and memorable experience from start to finish, but its hardcore mechanics (that sometimes border on pure LARPing) make it a game that is certainly not for everyone.",
    "gameID": 0,
    "author": "Ragequit.gr"
  },
  {
    "source": "http://www.pcgames.de/Kingdom-Come-Deliverance-Spiel-16151/Tests/Review-Wertung-Release-Patch-Performance-1250097/",
    "date": "2018-02-25T00:00:00.000Z",
    "score": 7.5,
    "comments": "An ambitious, beautiful and rewarding experience with great atmosphere and enjoyable quests, if you can overlook some of its questionable design choices and technical shortcomings.",
    "gameID": 0,
    "author": "PC Games"
  },
  {
    "source": "http://www.gamersky.com/review/201802/1017729.shtml",
    "date": "2018-02-26T00:00:00.000Z",
    "score": 8.6,
    "comments": "Though there are several annoying glitches, Kingdom Come: Deliverance still can be considered as a masterpiece. It is somewhat like an uncut diamond, which oozes wild but soul-shaking charms.",
    "gameID": 0,
    "author": "Gamersky"
  },
  {
    "source": "https://www.newgamenetwork.com/article/1863/kingdom-come-deliverance-review/",
    "date": "2018-02-26T00:00:00.000Z",
    "score": 7.5,
    "comments": "Kingdom Come: Deliverance deserves a lot of credit for succeeding in its highly ambitious and original realism-driven approach to role-playing game design, though the amount of broken quests and general lack of polish in combination with an ill-conceived save system bring down the experience significantly.",
    "gameID": 0,
    "author": "New Game Network"
  },
  {
    "source": "http://riotpixels.com/kingdom-come-deliverance-review/",
    "date": "2018-02-28T00:00:00.000Z",
    "score": 7.4,
    "comments": "There are many ways to enjoy Kingdom Come: Deliverance: help beautiful damsels, hack and slash bandits, marvel at pretty sunsets… Just don’t expect it to shatter your world. This is a typical case of “my dream game” — a fun, but flawed experience that staggers under a crushing weight of ambitions.",
    "gameID": 0,
    "author": "Riot Pixels"
  },
  {
    "source": "http://twinfinite.net/2018/02/kingdom-come-deliverance-review/",
    "date": "2018-02-28T00:00:00.000Z",
    "score": 7.0,
    "comments": "In the end, however, despite the flaws, there’s enough charm, compelling storytelling, and immersive atmosphere to see it through.",
    "gameID": 0,
    "author": "Twinfinite"
  },
  {
    "source": "http://www.playground.ru/articles/stradayuschij_renessans_obzor_kingdom_come_deliverance-55837/",
    "date": "2018-03-01T00:00:00.000Z",
    "score": 8.5,
    "comments": "Despite its technical imperfection, Kingdom Come: Deliverance is the best collection of unique and mostly believable medieval stories.",
    "gameID": 0,
    "author": "PlayGround.ru"
  },
  {
    "source": "http://opnoobs.com/reviews/adventure/kingdom-come-deliverance",
    "date": "2018-03-01T00:00:00.000Z",
    "score": 7.0,
    "comments": "With stunning and immersive graphics, Kingdom Come: Deliverance is an RPG for those who enjoy a deep, pronounced story with a focus on realism.",
    "gameID": 0,
    "author": "The Overpowered Noobs"
  },
  {
    "source": "http://www.shacknews.com/article/103645/kingdom-come-deliverance-review-fantastically-frustrating",
    "date": "2018-03-04T00:00:00.000Z",
    "score": 7.0,
    "comments": "Kingdom Come: Deliverance is a fantastic and absolutely frustrating experience. I was treated to a memorable lead character whose agency and development was largely wiped away with a twist late in the game and a collection of incredible gameplay mechanics and quests repeatedly stifled by bugs. Despite its downfalls, though, the good parts of the game are so good.",
    "gameID": 0,
    "author": "Shacknews"
  },
  {
    "source": "http://www.game-debate.com/articles/3103/kingdom-come-deliverance/swords-not-sorcery-kingdom-come-deliverance-review",
    "date": "2018-03-05T00:00:00.000Z",
    "score": 8.0,
    "comments": "While I’ve greatly enjoyed my time with Kingdom Come: Deliverance though, I have ultimately bounced off for now due to crippling performance issues that I’m suffering. If there’s the slightest doubt that your PC is going to struggle to run Kingdom Come: Deliverance at playable frame rates then I have to recommend you take a wait and see approach in order to see how it’s patched over the coming months.",
    "gameID": 0,
    "author": "Game Debate"
  },
  {
    "source": "https://apptrigger.com/2018/03/05/kingdom-come-deliverance-review-dont-bring-dagger-sword-fight/",
    "date": "2018-03-05T00:00:00.000Z",
    "score": 5.0,
    "comments": "Kingdom Come: Deliverance is an extremely immersive and ambitious open-world medieval RPG unlike any we’ve ever seen. But its attempts to remain engaging are ruined by a plethora of technical issues and an overall lack of polish.",
    "gameID": 0,
    "author": "App Trigger"
  },
  {
    "source": "http://darkzero.co.uk/game-reviews/kingdom-come-deliverance-pc-review/",
    "date": "2018-03-13T00:00:00.000Z",
    "score": 7.0,
    "comments": "There are incredible things going on in Kingdom Come: Deliverance that it’s a shame I have to score it lower than I would like, due to the issues with bugs and glitches that soil the experience. If those problems eventually get fixed, then look at this score with an additional point, but for the meantime, those problems can cause a loss of progression, which isn’t a good thing.",
    "gameID": 0,
    "author": "DarkZero"
  },
  {
    "source": "https://www.rpgsite.net/review/6920-kingdom-come-deliverance-review",
    "date": "2018-03-16T00:00:00.000Z",
    "score": 7.0,
    "comments": "Kingdom Come: Deliverance satisfies that itch if you are looking for something a little different than typical western high fantasy or Japanese style RPGs. It\u0027s rough around the edges and some narrative \u0026 mechanical quirks don\u0027t always hit their mark, but it\u0027s still an enjoyable experience if you can put up with a little bit of uneveness.",
    "gameID": 0,
    "author": "RPG Site"
  },
  {
    "source": "http://www.gameover.gr/reviews/37199-kingdom-come-deliverance-review",
    "date": "2018-03-17T00:00:00.000Z",
    "score": 9.0,
    "comments": "Warhorse delivers a completely fresh experience, being the first time an open world RPG is set in a truly authentic and grounded medieval setting. The adventure of the likable Henry is filled with unique and expansive quests, with a truly commendable variety in both their objectives and approaching strategies, giving urgency and purpose to the beautifully vibrant and troubled world of Kingdom Come’s Bohemia.",
    "gameID": 0,
    "author": "GameOver.gr"
  },
  {
    "source": "http://play.co.rs/2018/03/review-kingdom-come-deliverance/",
    "date": "2018-03-17T00:00:00.000Z",
    "score": 9.0,
    "comments": "Despite some bugs and technical issues at the launch, this game will offer you almost 100 hours of pure historical RPG joy.",
    "gameID": 0,
    "author": "PLAY! Zine"
  },
  {
    "source": "",
    "date": "2018-03-20T00:00:00.000Z",
    "score": 8.7,
    "comments": "Kingdom Come isn’t perfect, but it’s unique. If its deliberately slow pace doesn’t click with you – skip it, the storyline here isn’t something to suffer gameplay for. But, if it does click, you’re guaranteed to spend dozens of hours in virtual Bohemia, poaching hares and stalking bandits through the woods. [Issue#227, p.36]",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "",
    "date": "2018-03-22T00:00:00.000Z",
    "score": 7.2,
    "comments": "The love that\u0027s gone into developing KCD shows through its outer skin of bugs and bloody violence. [Apr 2018, p.66]",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "",
    "date": "2018-04-05T00:00:00.000Z",
    "score": 7.0,
    "comments": "An unflinchingly hardcore RPG that trades promises of \"realism\" for just another fantasy. [Issue#270, p.49]",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "",
    "date": "2018-04-24T00:00:00.000Z",
    "score": 8.0,
    "comments": "A robust RPG deserves your attention not only for its domestic origin. You will easily forgive its smaller mistakes because of a great narration and a complex gameplay. [Issue#283]",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "https://games.tiscali.cz/recenze/kingdom-come-deliverance-recenze-309248",
    "date": "2018-04-24T00:00:00.000Z",
    "score": 8.0,
    "comments": "Kingdom Come: Deliverance is a different kind. It\u0027s incredibly absorbing in its pace, it amazes with a manically detailed medieval era features and a totally true atmosphere, a series of skillfully built quests and, and when you get used to it, a fantastic combat system. There is a one-too-much cliché in the story arc, but the main problem lies in the technical issues. The game is, however, such a remarkable, huge, different and fresh experience that the occasional bug can be simply ignored.",
    "gameID": 0,
    "author": "Games.cz"
  },
  {
    "source": "",
    "date": "2018-05-16T00:00:00.000Z",
    "score": 8.5,
    "comments": "Upon the release the PC version is the only reasonable way to enjoy Kingdom Come. And there’s a lot to enjoy, because historically accurate Middle Ages are an awesome setting. The beginning of the game might not be spectacular, but give Deliverance a chance and it will develop into a unique, deep, gripping experience. [04/2018, p.42]",
    "gameID": 0,
    "author": ""
  }
]