[
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-07-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best MOBA !!!\nThe best MOBA...amazing graphics and amazing gameplay!!!No other game will give you this level of teamwork and intensity. However it can be argued that this game requires people skills as you will be forced to deal w... Read Full Review",
    "gameID": 0,
    "author": "Yaphetss"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-07-11T00:00:00.000Z",
    "score": 8.0,
    "comments": "Free to play, whether you like it or not.\nThe community is awful, there\u0027s no getting around that. Awful in every sense of the word; the people are horrible. At the game and in their personalities. You will rage and rage often if you elect to solo queue. There... Read Full Review",
    "gameID": 0,
    "author": "learningd2"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2013-07-11T00:00:00.000Z",
    "score": 9.0,
    "comments": "I know a lot of people hate the term E-sport... and I tend to agree with them, but Dota 2 does works a lot like a sport\nWhy dota 2 is like a sport?? well when you are new to a sport for example basket ball, and you start playing it you will feel stupid, you will have a lot of faults, travellings, violations, you will get stomped by the ri... Read Full Review",
    "gameID": 0,
    "author": "makafri"
  },
  {
    "helpfulCount": 33,
    "helpfulScore": 9,
    "date": "2013-07-11T00:00:00.000Z",
    "score": 2.5,
    "comments": "Only enjoyable if you mute the entire population or only run premade groups. Don\u0027t waste your time.\nI played the beta a while back and I have to say this game is terrible. Not because I\u0027m a fan of another MOBA and think there are better options, but because the game is a cesspool in terms of other players. If you are... Read Full Review",
    "gameID": 0,
    "author": "SerOlmy"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2013-07-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "The Legend. Idolized by Basshunter and notorious for its crushing difficulty and required in game socializing skills.\nDota 2 conquers the moba scene and here is why. No other game will give you this level of teamwork and intensity. A mix of strategy and tactics like many games but requires reflexes like with starcraft. In-fact, starc... Read Full Review",
    "gameID": 0,
    "author": "cboyuno"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2012-07-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "Dota is back and better than ever.\nDota 2 has reached all my expectations and more. I honestly cannot think of any downside to the game. Characters are well built, the sound effects and soundtrack is amazing, the characters comments is the best of all the... Read Full Review",
    "gameID": 0,
    "author": "Voredor"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2012-05-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is great I would rather to play this game FOREver!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\nThis is an awesome game!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!........................................ Read Full Review",
    "gameID": 0,
    "author": "sancejajb123"
  },
  {
    "helpfulCount": 29,
    "helpfulScore": 4,
    "date": "2013-07-22T00:00:00.000Z",
    "score": 5.5,
    "comments": "Almost there.\nI desperately wanted to stop playing League of Legends and switch to Dota 2. Not that i don\u0027t like League of Legends, it\u0027s just some things that can be improved by my opinion for example champions balance, more arenas et... Read Full Review",
    "gameID": 0,
    "author": "KHE3HC"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-07-21T00:00:00.000Z",
    "score": 9.5,
    "comments": "Blend of great multiplayer experience all the while frustrating from the difficulty.\nThis sort of game is not for the feint of heart. If you do not have a thick skin, lack the ability to take criticisms, or genera dislike the idea of competitiveness, avoid this game. DotA 2 is one of those games you will... Read Full Review",
    "gameID": 0,
    "author": "KazeNilrem"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2013-07-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "1644 hours played so far\nI have been playin this for 2 years and man let me tell you this game hooks you. It never feels like you are getting cheated in a battle rather every time you lose you can think of 10 ways you could have done better. If ... Read Full Review",
    "gameID": 0,
    "author": "IevildirkI"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2013-07-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Most addictive gameplay and best ARTS game ever made!\nI have played Dota since it first came on WC3, and I must say that I have never gotten tierd of the game. The main reason for this is because every single match is unique and there are endless possibilities and choices a... Read Full Review",
    "gameID": 0,
    "author": "Scryll"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2013-07-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "The complex gameplay mechanics combined with detailed audio, graphics, and lore makes this game a true masterpiece.\nDota 2 is probably the hardest game to learn you will ever come across. The game mechanics, character diversity, and the wide range of ways to play the game makes this game insanely hard to learn and get better at. There... Read Full Review",
    "gameID": 0,
    "author": "known_not"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2013-07-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Unsurprisingly Rewarding!\nUnsurprisingly Very Rewarding and challenging game. With the dedication put into it by Valve, Its a true masterpiece of a game, from the graphics, art and storyline to the voice acting and steam integration, its truly on... Read Full Review",
    "gameID": 0,
    "author": "nga911"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2013-07-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best games available and entirely free to play, no bullshit.\nI cannot think of any other game that will cost you nothing but will offer you this degree of entertainment. If you played DOTA1 when it came out as a mod for Warcraft3 then you simply need to get this. Most of your favo... Read Full Review",
    "gameID": 0,
    "author": "Kasheall"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2013-07-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "People who give this game a low score because of the community ignorantly neglect how incredible the game actually is.\nDota 2 is the most addictive game I\u0027ve ever played in my entire life. And it\u0027s legitimately free, with all heroes playable at all times unlike LoL. I don\u0027t often feel compelled to write video game reviews, but I felt ... Read Full Review",
    "gameID": 0,
    "author": "mk_ultr4"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-07-16T00:00:00.000Z",
    "score": 9.5,
    "comments": "Great MOBA\nThe original DoTA was the first MOBA. This game captures all the original elements with a better interface and graphics. Hope for more playable heroes and more game modes. The current content is solid and the tutorials ... Read Full Review",
    "gameID": 0,
    "author": "Dan889"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2013-07-13T00:00:00.000Z",
    "score": 9.5,
    "comments": "Not friendly for newbies but deadly addictive IF yu master the basics,learning the basics probable gonna take min 200 hr\nplayed 800+ hrs still haven\u0027t played many heroes yet,,that\u0027s a good sign !! ,but playing with pro gamer or making a mistake in team fight or not joining the fight is worse than feeding a/c to many players,...,player rep... Read Full Review",
    "gameID": 0,
    "author": "ujwalv"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-07-27T00:00:00.000Z",
    "score": 9.5,
    "comments": "As a former DOTA player, DOTA 2 has the taste of its predecessor but with much more community support\nI remembered the day that i started playing DOTA.(i thing i chose Skeleton King) There was so much hero and item combination that are waiting to be discovered. Experiencing hero item combinations were pure fun. In orde... Read Full Review",
    "gameID": 0,
    "author": "jediclub"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 4,
    "date": "2013-07-26T00:00:00.000Z",
    "score": 7.5,
    "comments": "DOTA 1 with better graphics\nThere is nothing new here and that is the disappointing part about it. You would think several years of development would give more than just better graphics. I played DOTA 1 from an early stage and was a player for like... Read Full Review",
    "gameID": 0,
    "author": "Act_Chill"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 4,
    "date": "2013-07-26T00:00:00.000Z",
    "score": 7.5,
    "comments": "Impressions of a newcomer\nI just played Dota 2 for the first time last night and came away with mixed feelings. I am not new to the MOBA genre, having played Demigod and tinkered a bit with League of Legends. I really like the idea behind these... Read Full Review",
    "gameID": 0,
    "author": "the_hunger"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2013-07-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best online game ever and it\u0027s FREE\nI started playing DOTA2 at the beginning of the beta and since then I play almost every day 1 hour. For those who are unfamiliar with the MOBA genre, it is a mix between RPG and RTS and I truly believe it is the greatest... Read Full Review",
    "gameID": 0,
    "author": "klaretos"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-07-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "Great game! Challenging multiplayer! Very addictive! Why? Read my story...\nWell, to start this review I want to tell you that I haven\u0027t play DOTA. Just know it from my friends, and not interested. Last month, I see the advertisement of this game (DOTA 2 beta). Just curious, I take the survey, ... Read Full Review",
    "gameID": 0,
    "author": "yosipramajaya"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-07-23T00:00:00.000Z",
    "score": 9.0,
    "comments": "A early difficulty curve is a small price, to play to a fun game with incredibly depth. And its free.\nWith some good tutorials, limited hero mode (so you don\u0027t have to dive straight in to learning 100+ heroes) bot and co-op games, DotA 2 is accessible for beginners. And the competitive games provide many hours of fun and... Read Full Review",
    "gameID": 0,
    "author": "ThKng"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-07-23T00:00:00.000Z",
    "score": 9.5,
    "comments": "Best arts/moba game out there? sure! Once you try it you can\u0027t stop playing it.\nI am proud to say that DotA2 is the best game you will experience if you get tired of Warcraft 3\u0027s graphics and gameplay. No LoL, no HoN and other horrible copy-cats. My 1.2k hours spent playing can\u0027t prove otherwise. S... Read Full Review",
    "gameID": 0,
    "author": "g3orge13"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 8,
    "date": "2013-07-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "Please, be gentle to the noobs.\nThis is indeed the chess of the modern era. Just one map, lots of useful pieces that compliment each other in a very balanced manner. Just as the official gamespot review has suggested; this has the potential to take ove... Read Full Review",
    "gameID": 0,
    "author": "iansoup"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-07-22T00:00:00.000Z",
    "score": 9.0,
    "comments": "The best MOBA out there!\nThe best MOBA out there! The game looks beautiful on the Steam Source engine and looks much better than the cartoony graphics of LoL. The game has an in-game mic system that is used a good amount by the players. The... Read Full Review",
    "gameID": 0,
    "author": "deactivated-5bb196d4ab501"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2013-07-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is the one game I want my friends to play! A blend of RTS, Hack\u0027n Slash, RPG, online only and competitive only!\nDon\u0027t try it unless you want to commit and lose yourself to this game... It takes a very long time to learn and community can be very toxic at times. But it\u0027s really rewarding once you get into it. RTS and competitive pl... Read Full Review",
    "gameID": 0,
    "author": "KelGhu"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-09-29T00:00:00.000Z",
    "score": 9.5,
    "comments": "Defenders of The Ancients 2 is a great game coming from one of the best mods available.\nValve made a great choice by making a modable standalone version of DOTA. It raised the bar for making the modding community stronger with having the game to run on the source engine and also made it \"stand-alone\" in one... Read Full Review",
    "gameID": 0,
    "author": "Creamos"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-09-18T00:00:00.000Z",
    "score": 9.5,
    "comments": "Very hard to get into at first but once you are in, you\u0027ll play it for a decade. When the fun begins it never ends!\nFirst i should mention this, this game is probably the hardest game you will ever play. Because skill cap is so high, even after playing it for years you\u0027ll realize how little you actually can play the game. There is no ... Read Full Review",
    "gameID": 0,
    "author": "Fistan87"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 1,
    "date": "2013-09-06T00:00:00.000Z",
    "score": 1.0,
    "comments": "Broken\nAfter being in the beta for 2 long years, This game fall short in disappointment broken MM, bugs still not fixed and a developer that have 0 interaction with the community, the only patch that you are going to see in Dot... Read Full Review",
    "gameID": 0,
    "author": "Usernamenotav"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-08-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "Free to play, but with highly balanced set of heroes and items, the game is simply the best MOBA ever created.\nThe best MOBA by far, even if compared to HoN and LoL; the heroes and items are more balanced and thus the gameplay is more versatile and balanced. Dota2 is based upon Defense of the Ancients from Warcraft III, but adds... Read Full Review",
    "gameID": 0,
    "author": "livedonex"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 1,
    "date": "2013-08-18T00:00:00.000Z",
    "score": 3.0,
    "comments": "Not rewarding enough to play.\nAside from critical acclaim, I will tell you, this game is not as great as it\u0027s cracked up to be. In case you\u0027re unfamiliar with this title, or how it plays, I\u0027ll give you a brief description; You, and a team of a few ... Read Full Review",
    "gameID": 0,
    "author": "dpeatice"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2013-08-14T00:00:00.000Z",
    "score": 8.0,
    "comments": "A game that is good no doubt, but still leaves something to be desired.\nI\u0027ve been playing the Dota 2 beta since mid last year, and introduced a few of my friends to it, which they have come to love this game. Valve has nailed basically all game play elements nearly perfectly, graphics ar... Read Full Review",
    "gameID": 0,
    "author": "greek5"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-08-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best thing, since toilet paper.\nOne thing you need to understand about this amazing sport (it is a sport, you can not deny it) is that if you do not have a highly competitive personality you will most likely fail. But sense of satisfaction of winning a... Read Full Review",
    "gameID": 0,
    "author": "kapiten22"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-08-09T00:00:00.000Z",
    "score": 8.5,
    "comments": "DOTA 2 is one of the greatest multiplayer experiences in video games today.\nPROS : - One of the greatest multiplayer experiences in gaming. - Winning requires solid teamwork and communication - Edge-of-your-seat battles and deep gameplay - Over 100 heroes to chose from - Countless possible ... Read Full Review",
    "gameID": 0,
    "author": "BrutalPandaX2"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-07-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "The game of my life.\nDota, from its start, just a mod for warcraft 3, grew massively popular, with no fancy ads, no big tournaments, just because of people telling their friends, spreading the word, and those friends telling their friends, a... Read Full Review",
    "gameID": 0,
    "author": "traxer487"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-07-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "Amazing game.Valve has truly captured the essence of the original dota while adding more to it. I highly recommend Dota.\nGreat game with a very high learning curve ,but that\u0027s what makes the game so addictive. It is also a truly free game,meaning that all purchases are cosmetic. All characters(Heroes) are playable from the very start. S... Read Full Review",
    "gameID": 0,
    "author": "Ebzor"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-11-02T00:00:00.000Z",
    "score": 1.0,
    "comments": "Bad Valve DEV\nGarbage matchmakingGarbage report systemGarbage game engine results in 9 games without someone being able to load and you reenter the queue0 communication and 0 visibility no visible MMR no ladders)No region locks.You t... Read Full Review",
    "gameID": 0,
    "author": "aleioz"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-11-02T00:00:00.000Z",
    "score": 1.0,
    "comments": "NO DIRETIDE NO COMMUNICATION WITH THEIR COMMUNITI - 0\nNO DIRETIDE NO COMMUNICATION WITH THEIR COMMUNITI - 0 NO DIRETIDE NO COMMUNICATION WITH THEIR COMMUNITI - 0 NO DIRETIDE NO COMMUNICATION WITH THEIR COMMUNITI - 0 NO DIRETIDE NO COMMUNICATION WITH THEIR COMMUNITI - 0 NO ... Read Full Review",
    "gameID": 0,
    "author": "vasiliypupkin1"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-11-02T00:00:00.000Z",
    "score": 1.0,
    "comments": "This is why dota sucks\nWell dota used to be an amazing game...But then valve started developing dota 2.NO NEW HEROES,NO BUG FIXED,AND MOST IMPORTANTLY NO HALLOWEEN EVENTS.EVERY OTHER GAME HAD AN EVENT..EVERY SINGLE STEAM GAME.ALL BUT DOTA 2.༼... Read Full Review",
    "gameID": 0,
    "author": "destroyergr"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2013-11-02T00:00:00.000Z",
    "score": 1.0,
    "comments": "BAD VOLVO\nGive DIRETIDE༼ つ ◕_◕ ༽つBAD VOLVO!!!Give DIRETIDE༼ つ ◕_◕ ༽つGive DIRETIDE༼ つ ◕_◕ ༽つGive DIRETIDE༼ つ ◕_◕ ༽つGive DIRETIDE༼ つ ◕_◕ ༽つGive DIRETIDE༼ つ ◕_◕ ༽つGive DIRETIDE༼ つ ◕_◕ ༽つGive DIRETIDE༼ つ ◕_◕ ༽つGive DIRETIDE༼ つ ◕_◕ ༽つG... Read Full Review",
    "gameID": 0,
    "author": "satanpride"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-11-02T00:00:00.000Z",
    "score": 1.0,
    "comments": "Keep ignoring\nWorst support ever. This is exactly proof of how valve ignores the community. It didn\u0027t start now, it just became obvious. People have been demanding a ladder, better matchmaking and other changes for a long time. But no... Read Full Review",
    "gameID": 0,
    "author": "carpy_27"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-11-02T00:00:00.000Z",
    "score": 1.0,
    "comments": "NO DIRETIDE\n༼ つ ◕_◕ ༽つ Give Diretide༼ つ ◕_◕ ༽つ Give Diretide༼ つ ◕_◕ ༽つ Give Diretide༼ つ ◕_◕ ༽つ Give Diretide༼ つ ◕_◕ ༽つ Give Diretide༼ つ ◕_◕ ༽つ Give Diretide༼ つ ◕_◕ ༽つ Give Diretide༼ つ ◕_◕ ༽つ Give Diretide༼ つ ◕_◕ ༽つ Give Diretide༼ つ ... Read Full Review",
    "gameID": 0,
    "author": "pranavbijwe"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2013-11-01T00:00:00.000Z",
    "score": 1.0,
    "comments": "Poor performance on Valve\u0027s part.\nNo new heroes in 3 months, minor(not complete) bug fixes, no patch for halloween, give a patch after 3 days, what does it contain? Only cosmetics. Valve has ruined Dota 2. Do not try the game, I repeat, do not try the ga... Read Full Review",
    "gameID": 0,
    "author": "flamindude99"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-10-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "King of MOBA\nDOTA 2 is a free to play game, that offers great competitive gameplay and great visuals. Gameplay vise DOTA 2 is a direct decedent of DOTA the first game of this genre, it is extremely fast paced and has huge variety fr... Read Full Review",
    "gameID": 0,
    "author": "Krauklis"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2013-10-10T00:00:00.000Z",
    "score": 9.0,
    "comments": "Dota 2 is hard but I love it.....\nComing from League dota 2 can be a a shock to the system, Couriers, buybacks, death penalty oh my. It can be a lot to take in for a league player that is more familiar to the simpler ways of Riot game but once you put s... Read Full Review",
    "gameID": 0,
    "author": "Jestersmiles"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2013-10-03T00:00:00.000Z",
    "score": 4.0,
    "comments": "Dota is for G-nerds\nGame is nice looking but graphic is blured to hide polygons and other graphical elements. I got bad vision and after playing game some 3h eyes start to hurt and feel deasy. Game not fun to play for new players. If you... Read Full Review",
    "gameID": 0,
    "author": "Noborou"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-08-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "An exelent game.. and free too\nDota 2 is really an awesome game, only disadvantage I think that it takes some extra time to finish but if compared to the other RTS games it is the best game from my point of view nice gameplay graphics very nice team ... Read Full Review",
    "gameID": 0,
    "author": "scroveon"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-06-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "A True Masterpiece\nWhile there\u0027s a fairly sizable learning curve, DOTA 2 offers something for any serious or casual online gamer. There\u0027s a massive hero pool of over 100 unique characters. The best way I\u0027ve heard it described was in the mo... Read Full Review",
    "gameID": 0,
    "author": "agarrard94"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-03-28T00:00:00.000Z",
    "score": 7.0,
    "comments": "Nice, but hard\nPlaying the game for 2500 hoursAbout 2000 games more or less,Still find it enjoyable to play, so thats a big Plus-point.However i find myself lucky having friends also playing online so i dont have to endure the Bad comm... Read Full Review",
    "gameID": 0,
    "author": "fireblack1979"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-03-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "Years of play and more to come\nThis is the only game that I have played for years and I plan to play for years to come. The learning curve is pretty sweet but as you become familiar with the game in general and how a lot of the heroes and items work,... Read Full Review",
    "gameID": 0,
    "author": "meloyelo11"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-01-09T00:00:00.000Z",
    "score": 9.0,
    "comments": "Good luck if you feel like trying\nDota 2 is a pretty hard strategy intensive game for a first timer and joining public games would just ruin the game for you as the community is pretty bad.The good-Most computers can play it, even if it\u0027s very old-Great ... Read Full Review",
    "gameID": 0,
    "author": "1hswrdGamer"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-12-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "Perfection on RTS Games\nThis game has taken so much time from me, and I got no regrets for that, in fact i\u0027m sure Ill be playing this for long looooong time. Dota 2 have so many features that enhance the original Dota (and many of those Dota-l... Read Full Review",
    "gameID": 0,
    "author": "joanxtb"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-12-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "Dota 2\nStrategy and fightI played this game since 2007....first dota,and now in 2013 almost 2014 i\u0027m still not bored...i recomand this game for everyone who have experience with moba games if u dont have not start with dota 2 .... Read Full Review",
    "gameID": 0,
    "author": "ComneaBing"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-11-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Used to play video games (note plural tense), now I play DOTA 2\nI used to be a game collector, and would enjoy playing through all the new hit single player games as they game out (I have almost 1000 games on steam, as proof of this). However this all changed about a year ago. Last S... Read Full Review",
    "gameID": 0,
    "author": "True_Sounds"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-11-02T00:00:00.000Z",
    "score": 1.0,
    "comments": "Give DIRETIDE\nOk it\u0027s a free game, and it\u0027s probably the best MOBA out there. But as much as valve have given us this amazing game, the lack of interest in updating the game is disgusting. Valve just ignores the fans and do what they ... Read Full Review",
    "gameID": 0,
    "author": "darksk12"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-11-02T00:00:00.000Z",
    "score": 1.0,
    "comments": "Dota 2, Valve destroyed an amazing game.\nwhat a poor game. Valve doesnt care about the game at all. They only care about money and hats. I have played 20 hours in the game and have achieved a 55% win rate since I used to play dota on wc3 regularly. They have ma... Read Full Review",
    "gameID": 0,
    "author": "tellmehowtoplay"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 5,
    "date": "2013-07-30T00:00:00.000Z",
    "score": 9.0,
    "comments": "DOTA 2 is a brilliant and highly addictive MOBA with a heavy emphasis on team-based strategy.\n*** DOTA 2 *** THE GOOD -Highly strategic -Plethora of fun heroes -Excellent team builder -Large replay value THE BAD -Matchmaking issues The pounding of war drums, the clashing of swords, the constant ... Read Full Review",
    "gameID": 0,
    "author": "Garrison_Ford"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-11-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "its amazing\ni love it very much and the game is so amzaing.................................................................................and its been my partner in my whole life.................................................. js... Read Full Review",
    "gameID": 0,
    "author": "imongmama3733"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-11-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Dota 2 review\nDota 2 is a very nice MOBA to play. Even though it is very confusing and requires a lot of thinking and strategy to win the game, it is very fun at its core. As a player that also plays league, I find DOTA to be more cha... Read Full Review",
    "gameID": 0,
    "author": "skyreborn"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2016-05-12T00:00:00.000Z",
    "score": 9.0,
    "comments": "Free to play, takes dedication to learn, near impossible to master, but very rewarding.\nAn Introduction for new players interested in trying out Dota 2:Dota 2 is a game that is absolutely free to play. It is the sequel to the Warcraft 3 mod that started off the Dota series. As with any other game in my opin... Read Full Review",
    "gameID": 0,
    "author": "nota"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2015-06-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "Hardcore Dota2\nThis is one of those games that are meant to play with joy and love, no matter how do you play if you are hardcore gamer you will succeed in it, the trick everything hides in this game is amazing, combos ,spells and skil... Read Full Review",
    "gameID": 0,
    "author": "faking_brd"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2015-06-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "Bring back the old times!\nas we know that Dota are created by icefrog from Warcraft III but lack of graphic, 3D effect. Now, Dota 2 was released with superb graphic, balanced hero, and easier binding keys and also can customize your hero with ite... Read Full Review",
    "gameID": 0,
    "author": "ezzat30"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2015-03-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "Dota 2\nSteep learning curve. The general consensus is that this game takes about 100 hours to get used to. From there on it could take a player hundreds more to develop \"map awareness.\" Map awareness refers to the ability to ta... Read Full Review",
    "gameID": 0,
    "author": "kzebski"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2015-02-26T00:00:00.000Z",
    "score": 1.0,
    "comments": "Not fun anymore\nIf you loved dota maybe you will hate this \"new version\" as i did. Dota 2 is not dota but only a brand now. More than ten years after its first launch i would probably expect a game with new content. Unfortunately it doe... Read Full Review",
    "gameID": 0,
    "author": "jvss27"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-09-12T00:00:00.000Z",
    "score": 8.0,
    "comments": "One of the best F2P games out there\nThe good:- 100% F2P game;- Insane replay value;- Very well coded/developed (very stable, low pc requirements, no bugs, no crashes, no overpowered heroes, etc);- A lot of action, it never gets boring; The bad:- Steep(!... Read Full Review",
    "gameID": 0,
    "author": "ju5tp1ay"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2014-08-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "Awesome but Tragic!\nI could not recommend this game any higher, this is the only game that i have ever consistently played. I still play other games but always come back to this one. The tragic part is that it will consume you! They say onc... Read Full Review",
    "gameID": 0,
    "author": "mackingtosh"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-08-28T00:00:00.000Z",
    "score": 9.0,
    "comments": "DOTA 2 makes playing DOTA fun again.\nNot bad, graphics are so much better since the original game on the Warcraft III engine. Heroes are much more fun to use since they\u0027re all redesigned and can be customized.Find out more about my review on the game @http:... Read Full Review",
    "gameID": 0,
    "author": "jomplayed"
  }
]