[
  {
    "source": "http://www.vandal.net/analisis/pc/dota-2/13321",
    "date": "2013-07-15T00:00:00.000Z",
    "score": 9.0,
    "comments": "A great game that will keep players in front of the screen for hours, specially the most dedicated and competitive one. It has not evolved too much from its predecessor, but it was hard to do so without ruining its essence.",
    "gameID": 0,
    "author": "Vandal"
  },
  {
    "source": "http://www.meristation.com/pc/dota-2/analisis-juego/1534357",
    "date": "2013-07-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "DOTA has marked the life of millions of persons. Valve and IceFrog has made sure DOTA 2 will be making the same for next decade. An extraordinary formula and a extraordinary work around it.",
    "gameID": 0,
    "author": "Meristation"
  },
  {
    "source": "http://www.gameinformer.com/games/dota_2/b/pc/archive/2013/07/16/dota-2-review.aspx",
    "date": "2013-07-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "Valve studiously avoided reinventing the wheel with Dota 2, and given how beloved the gameplay is that is undoubtedly the best thing for the game, the community, and the genre. The infrastructure for matchmaking, spectating, and everything else that surrounds actual matches is executed on a level only the best studios can rival.",
    "gameID": 0,
    "author": "Game Informer"
  },
  {
    "source": "http://www.eurogamer.it/articles/2013-07-16-dota-2-review-recensione",
    "date": "2013-07-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "Dota 2 it\u0027s obviously one of the best MOBA around. It offers more than 100 beautifully designed champions for free and it needs a lot of practice to be mastered. Better or worse than LoL? It’s just different, you have to try them both.",
    "gameID": 0,
    "author": "Eurogamer Italy"
  },
  {
    "source": "http://www.ausgamers.com/games/dota-2/review/",
    "date": "2013-07-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "It\u0027s an amazing game - technically outstanding, showing all of Valve\u0027s usual polish and attention to detail, especially in the all-important multiplayer aspects. The continual balance tweaks and new heroes combined with the vast amount of content in the game offer countless hours of enjoyment. It\u0027s hard to master but good wins with your teammates are incredibly satisfying. It took me a long time to warm up to, but I\u0027m helplessly addicted and every day look forward to getting home to fire this up with my friends. If you can spare the time - play it.",
    "gameID": 0,
    "author": "AusGamers"
  },
  {
    "source": "http://www.eurogamer.net/articles/2013-07-16-dota-2-review",
    "date": "2013-07-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "All of which makes Dota 2 an absurd video game to try to recommend. Being the largest and most immediately open MOBA, with Valve showcasing its talent for rewarding and fostering a community, it demands and offers more than literally any game I can think of. It\u0027s almost more comparable to basketball than most commercial games. Something utterly opaque bearing no endgame, but that could happily fill every waking second of your life.",
    "gameID": 0,
    "author": "Eurogamer"
  },
  {
    "source": "http://www.gamestar.de/spiele/dota-2/test/dota_2,46371,3025780.html",
    "date": "2013-07-18T00:00:00.000Z",
    "score": 8.6,
    "comments": "Quotation forthcoming.",
    "gameID": 0,
    "author": "GameStar"
  },
  {
    "source": "http://www.gamereactor.se/recensioner/114504/Dota+2/",
    "date": "2013-07-18T00:00:00.000Z",
    "score": 7.0,
    "comments": "A strategic adrenaline rush, but the graphics are dated and the learning curve is steep.",
    "gameID": 0,
    "author": "Gamereactor Sweden"
  },
  {
    "source": "http://www.cheatcc.com/pc/rev/dota2review.html",
    "date": "2013-07-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "Dota 2 isn’t for the faint of heart. It isn’t for everyone. But if you play MOBAs, then it is for you. This is the game in the genre you need to play. If you don’t believe me, then consider this: There’s a reason why the community has crowd-funded a total of $900,000-plus to the prize pool for The International 3.",
    "gameID": 0,
    "author": "Cheat Code Central"
  },
  {
    "source": "http://www.gamespot.com/dota-2/reviews/dota-2-review-6411615/",
    "date": "2013-07-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "Those who choose to commit to Dota 2 will find many happy hours within this immaculate update.",
    "gameID": 0,
    "author": "GameSpot"
  },
  {
    "source": "http://metro.co.uk/2013/07/19/dota-2-review-esport-of-kings-3889373/",
    "date": "2013-07-19T00:00:00.000Z",
    "score": 8.0,
    "comments": "Gaming’s ultimate eSport gets a well-considered makeover by the masters at Valve, although new ideas, and fixes for old problems, are currently thin on the ground.",
    "gameID": 0,
    "author": "Metro GameCentral"
  },
  {
    "source": "http://www.darkstation.com/reviews/dota-2/",
    "date": "2013-07-23T00:00:00.000Z",
    "score": 8.0,
    "comments": "To many players, these sorts of persistent issues can damage their enjoyment in significant ways, but the dense tactical gameplay manages to shine through more often than not, and if you really get in deep, this may be the last game you need for months. And if you’re completely unsure about the genre or heavy online teamwork, it couldn’t be cheaper to give it a shot.",
    "gameID": 0,
    "author": "DarkStation"
  },
  {
    "source": "http://www.destructoid.com/review-dota-2-258506.phtml",
    "date": "2013-07-24T00:00:00.000Z",
    "score": 9.5,
    "comments": "With zero cost to play and one of the highest skill ceilings of any game I\u0027ve ever encountered, Dota 2 is a modern multiplayer masterpiece.",
    "gameID": 0,
    "author": "Destructoid"
  },
  {
    "source": "http://www.ign.com/articles/2013/07/24/dota-2-review",
    "date": "2013-07-24T00:00:00.000Z",
    "score": 9.4,
    "comments": "But once you start to learn its secrets, there’s a wild and exciting variety of play here that’s unmatched, even by its peers. It’s a challenge of knowledge as well as reflexes, and success is a rush.",
    "gameID": 0,
    "author": "IGN"
  },
  {
    "source": "http://www.gamer.nl/review/431342/dota-2-de-blauwdruk-voor-elke-moba",
    "date": "2013-07-25T00:00:00.000Z",
    "score": 9.0,
    "comments": "Dota 2 remains fully loyal to its predecessor, which fundamentally started the moba genre, and that’s the best choice. Thanks to the long development process of the first Dota, the second part is now the most well balanced and complete game of all the multiplayer online battle arenas out there. This is mostly noticeable due to the enormous tactical freedom that makes every game different and the subtle elements that make the game so rich and expansive. No competitor even comes close to this amount of depth.",
    "gameID": 0,
    "author": "Gamer.nl"
  },
  {
    "source": "",
    "date": "2013-07-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "You’ll need knowledge, skill, and a smidge of spider-sense. Friends to learn with are a must, and don’t be deceived by the lack of a pricetag: Dota 2 will cost you hundreds of hours.",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "http://www.gry-online.pl/S020.asp?ID\u003d9112",
    "date": "2013-07-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "Dota 2 is a great game that has a price to quality ratio set somewhere around infinity. Beginners are screwed at first, but eventually they will discover a new, extremely satisfying level of gameplay. Dota 2 is an amazing game because of its strategic depth, constantly varying games, and established highly competitive scene. This game generates challenges both for the casual and the more serious player.",
    "gameID": 0,
    "author": "GRYOnline.pl"
  },
  {
    "source": "http://www.4players.de/4players.php/dispbericht/PC-CDROM/Test/24968/79839/0/DotA_2.html",
    "date": "2013-07-26T00:00:00.000Z",
    "score": 8.5,
    "comments": "Team players may dive deeply into the tactical and co-operative components of a game that awards planning and effective communication.",
    "gameID": 0,
    "author": "4Players.de"
  },
  {
    "source": "http://www.3djuegos.com/juegos/analisis/9771/0/dota-2/",
    "date": "2013-07-29T00:00:00.000Z",
    "score": 9.0,
    "comments": "DOTA 2 it\u0027s amazing. One of the best MOBA around. It needs a lot of practice to be mastered, but if you play MOBAs, then it is for you.",
    "gameID": 0,
    "author": "3DJuegos"
  },
  {
    "source": "http://www.eurogamer.de/articles/2013-07-23-dota-2-test",
    "date": "2013-07-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "If you\u0027re willing to put in the effort, you\u0027ll get a game with unparalleled depth and competitive fun. This one has one hell of a learning curve, but climbing it, you\u0027ll find, is a huge pleasure in and of itself.",
    "gameID": 0,
    "author": "Eurogamer Germany"
  },
  {
    "source": "http://www.everyeye.it/pc/articoli/dota-2_recensione_20153",
    "date": "2013-07-30T00:00:00.000Z",
    "score": 9.7,
    "comments": "Dota 2 is one of the most spectacular and intense games of all time.",
    "gameID": 0,
    "author": "Everyeye.it"
  },
  {
    "source": "http://www.gametrailers.com/reviews/j66pz2/dota-2-review",
    "date": "2013-08-01T00:00:00.000Z",
    "score": 9.0,
    "comments": "Dota 2 is so carefully constructed and improving at such a rapid rate that it won’t only be played for years, but possibly decades. Though it may take dozens of hours to learn, players that grasp Dota 2’s ideas will find a game that’s almost endlessly enjoyable.",
    "gameID": 0,
    "author": "GameTrailers"
  },
  {
    "source": "http://www.edge-online.com/review/dota-2-review/",
    "date": "2013-08-01T00:00:00.000Z",
    "score": 9.0,
    "comments": "You’ll never be able to play enough Dota 2 to totally master it, and although it’s an F2P game it can be too cruel and unusual for some. But persist through the tough start and accept the idiosyncrasies, and you’ll start to understand why so many have stuck with it for more than a decade. Why would they need something new when they’ve got this incredibly deep, rewarding multiplayer experience?",
    "gameID": 0,
    "author": "Edge Magazine"
  },
  {
    "source": "",
    "date": "2013-08-02T00:00:00.000Z",
    "score": 8.0,
    "comments": "Right now it’s the only game that I want to come back to even after a solid beating. It offers a dynamic and balanced gameplay based solely on player skills. If you haven’t tried Dota 2 yet, you need to. [CD-Action 09/2013, p.54]",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "http://it.ign.com/recensione/7544/recensione-pc-dota-2",
    "date": "2013-08-03T00:00:00.000Z",
    "score": 9.0,
    "comments": "Dota 2 is an excellent game, complex and filled with surprises and rewards for all those patient enough to endure its very steep learning curve.",
    "gameID": 0,
    "author": "IGN Italia"
  },
  {
    "source": "http://www.pcgamer.com/review/dota-2-review-2/",
    "date": "2013-08-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "A deep and rewarding competitive game that becomes something special when taken on in the company of others.",
    "gameID": 0,
    "author": "PC Gamer"
  },
  {
    "source": "http://www.eurogamer.es/articles/analisis-de-dota-2",
    "date": "2013-08-12T00:00:00.000Z",
    "score": 9.0,
    "comments": "DotA 2 will be an important highlight for eSports in the following years. Try it and you\u0027ll understand why.",
    "gameID": 0,
    "author": "Eurogamer Spain"
  },
  {
    "source": "",
    "date": "2013-08-21T00:00:00.000Z",
    "score": 9.0,
    "comments": "The most refined take on the genre yet. [Issue#138, p.98]",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "",
    "date": "2013-08-27T00:00:00.000Z",
    "score": 9.0,
    "comments": "There\u0027s a steep, daunting learning curve, but DOTA 2 offers one of the most rewarding game experiences you can find on PC today. [Sept 2013, p.80]",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "http://www.usgamer.net/articles/dota-2-review",
    "date": "2013-08-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "A great PvP game that offers some of the most intriguing and nuanced team combat around.",
    "gameID": 0,
    "author": "USgamer"
  },
  {
    "source": "",
    "date": "2013-09-01T00:00:00.000Z",
    "score": 9.0,
    "comments": "Unforgiving from the get-go, but a landmark in competitive multiplayer design. [Oct 2013, p.68]",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "http://www.gameover.gr/reviews/item/26869-dota-2",
    "date": "2014-02-19T00:00:00.000Z",
    "score": 9.5,
    "comments": "Simply irresistible and addictive as hell.",
    "gameID": 0,
    "author": "GameOver.gr"
  },
  {
    "source": "https://www.polygon.com/2017/8/15/16151674/dota-2-review",
    "date": "2017-08-15T00:00:00.000Z",
    "score": 8.5,
    "comments": "And this dichotomy is perhaps the best descriptor I can attach to Dota 2. It is frequently a game which occupies two opposite spaces simultaneously. It is the best game. It is also the worst game. No game has ever made me as miserable as Dota 2 has. But no game has made me feel so consistently rewarded for my time, and as consistently, wonderfully connected to the friends I play it with.",
    "gameID": 0,
    "author": "Polygon"
  }
]