[
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2017-09-07T00:00:00.000Z",
    "score": 6.0,
    "comments": "Repetitive GamePlay\nThe game is fun at first couple of hours then it becomes repetitive.I think Fortnite has a potential. Hope the devs listen to players and put more content in the game.There are minor bugs but they are not game breaking.T... Read Full Review",
    "gameID": 2,
    "author": "tegororn"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2018-01-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "fortnite\nthe only problem is connectivity issues its really hard to join my friends sometimes and my internet is good so is theirs I know its the game because it happens to a lot of people tttttttttttttttttttttttttttttttttttttttt... Read Full Review",
    "gameID": 2,
    "author": "ltyphoon"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2018-02-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "Where do I even begin? (PLEASE AVOID THIS CANCER)\nJust where do I even begin? the gunplay is horrible. it takes no skill AT ALL! the sniper bullets move way too slow as if these idiots at Epic never even fired a sniper rifle, and worst of all the hit detection is comple... Read Full Review",
    "gameID": 2,
    "author": "orenges"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2018-02-14T00:00:00.000Z",
    "score": 8.0,
    "comments": "Scavenge, Build, Kill, Reward, Repeat!\nOn the surface, Fortnite\u0027s Survival mode is an easy concept to take down: Scavenge, Build, Kill, Reward, Repeat. For those of you thinking back on your Gears escapades, five minutes with Fortnite and you\u0026rsquo;ll slam ... Read Full Review",
    "gameID": 2,
    "author": "diamondjab"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2018-02-26T00:00:00.000Z",
    "score": 7.0,
    "comments": "My Review of Fortnite\nThe video game, Fortnite, was initially a PC game. It was recently added as a game to consoles such as Playstation and Xbox. There are two different modes to the game. Offline and Online. Offline you fight against zombi... Read Full Review",
    "gameID": 2,
    "author": "mezziah99"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-03-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "Fortnite Battle Royale Review\nFortnite is an amazing, fun and addictive game. A lot of people say PUBG is a whole lot better, well, ask yourself, what do I care about more? A fun, free game which lots of people play? Or a \u0026pound;20-\u0026pound;30 game tha... Read Full Review",
    "gameID": 2,
    "author": "dark_voyager"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-03-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "Why won\u0027t my parents let me play fortnite\nHi, my name is will and I\u0027m 13 almost 14 and I just got a ps4. As soon as I got I downloaded fortnite ( with my parents permission). I played it with my friends and by myself for a day. Then my mom came down stairs and s... Read Full Review",
    "gameID": 2,
    "author": "joejoejimmy12"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-03-22T00:00:00.000Z",
    "score": 9.0,
    "comments": "Fortnite\nFortnite is a video game. I like because is free funny and you can play with your friends.you can play these in pc Xbox and ps4 and in a few weeks you can play on your mobile phone. Fortnite that\u0027s for: the game starts w... Read Full Review",
    "gameID": 2,
    "author": "welcomeenglish"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 2,
    "date": "2018-04-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "fortnite\nwhy parents act like a fool of fortnite am i\u0027m right.and i love fortnite i listen to the song and i keep playing it ok my mom is coolest mom ever but sometime she hates that i keep playing and every kid playing in the al... Read Full Review",
    "gameID": 2,
    "author": "queenbaseballplayer2018"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-06-09T00:00:00.000Z",
    "score": 8.0,
    "comments": "TerrabyteReviews: Fortnite\nOkay! I get it, apparently to literally everyone in the entire world Fortnite is the most essential game anyone could ever play. But to us, Fortnite is a great game but it just isn\u0027t good enough to be the best game of al... Read Full Review",
    "gameID": 2,
    "author": "terrabytereview"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-06-24T00:00:00.000Z",
    "score": 3.0,
    "comments": "Fortnite review (Nintendo Switch)\nI tried this game out as soon as I heard it was on the switch, and.... I’m sorry, but I just didn’t like it. Its not action 52 levels of horrible for sure, but I just don’t get how it got so popular. First off I’d like t... Read Full Review",
    "gameID": 2,
    "author": "mpreviews"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-07-01T00:00:00.000Z",
    "score": 6.0,
    "comments": "Fortnite From My Perspective\nI do not like fortnite at all. I may not know every detail about fortnite, but I do know that people get sucked into this game! It is all anyone talks about. I am so thankful when I find someone who either does not know ... Read Full Review",
    "gameID": 2,
    "author": "kitkat27"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2018-07-08T00:00:00.000Z",
    "score": 9.0,
    "comments": "To expensive\nSo the game itself isn\u0027t expendive at all but once you start playing the game is where it gets expensive. So obviously when you start the game you get all the basic skins and you of course want a better skin/backbling, e... Read Full Review",
    "gameID": 2,
    "author": "reedster1006"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2018-08-08T00:00:00.000Z",
    "score": 1.0,
    "comments": "well then....\nI once enjoyed this game (near the start) but then I got detached from this game, the RNG is terrible and the shotguns are a joke, I have encountered so many bugs and glitches with this game, the building is still not ve... Read Full Review",
    "gameID": 2,
    "author": "freddie521"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2018-08-30T00:00:00.000Z",
    "score": 1.0,
    "comments": "This game has too many faults\nThe game had me entertained for the first hours, but then I got tired of it. The game is very RNG dependent, there are a lot of bugs and glitches, it occupies too much space, the game easily goes laggy, and many, many mo... Read Full Review",
    "gameID": 2,
    "author": "tacocat_yay"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2018-12-06T00:00:00.000Z",
    "score": 9.0,
    "comments": "good\ngood game but many bugs and performas issues. great awesome game!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!... Read Full Review",
    "gameID": 2,
    "author": "guck52"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2019-03-26T00:00:00.000Z",
    "score": 1.0,
    "comments": "FREE GAME FOR KIDS! and peasants\nthe game is very well madeNICE MECHANICSThe controls, weapons and animations are very well made, and players will feel comfortable with the speedI personally think that battle royal games are just like a drug and since ... Read Full Review",
    "gameID": 2,
    "author": "chuckfriedrich"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2020-01-16T00:00:00.000Z",
    "score": 1.0,
    "comments": "Crappiest game on the planet!\nThe FPS sucks much turds! This game is so fake, set up even! I do believe they make things intentionally happen in it, to piss kids off. If just dealing with the software issues don\u0027t beforehand. I\u0027ve had to redownload t... Read Full Review",
    "gameID": 2,
    "author": "jtcole"
  }
]