[
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-11-14T00:00:00.000Z",
    "score": 0.0,
    "comments": "I like Fortnite: Save the World for this reason: 1. It\u0027s an adventure that you take that is honestly fun. I like Fortnite: Battle Royale for these reasons: 1. You kill people to win (Good or bad?). 2. There are no more reasons. I **** hate Fortnite: Battle Royale for these reasons: 1. It\u0027s a game that has to be downloaded and it takes so long and complicated for no reasons. 2. The gameI like Fortnite: Save the World for this reason: 1. It\u0027s an adventure that you take that is honestly fun. I like Fortnite: Battle Royale for these reasons: 1. You kill people to win (Good or bad?). 2. There are no more reasons. I **** hate Fortnite: Battle Royale for these reasons: 1. It\u0027s a game that has to be downloaded and it takes so long and complicated for no reasons. 2. The game has bad graphics. 3. The emotes are **** stupid. 4. You can only buy things with v bucks. You can only get v bucks with your credit card, debit card, etc. on Fortnite: Battle Royale instead of when you play Fortnite: Battle Royale! It\u0027s hard to get free v bucks on Battle Royale. 5. The game is extremely overrated! It\u0027s a stupid game that people talk about every **** day! 6. Glitches in the game. 7. The game takes up a **** of storage. 8. People over obsess about Fortnite: Battle Royale and lots of situations about this game get worse than they should get. 9. WHY IS THIS STUPID GAME TRYING TO BE KID FRIENDLY! Shooter games were built off of blood, gore, terror, action, and other adult themes that are fun! But no, 4th graders want to find a game to consider themselves adults. Fortnite: Battle Royale is annoying.… Expand",
    "gameID": 0,
    "author": "robertoiglesias"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-12-26T00:00:00.000Z",
    "score": 2.0,
    "comments": "Thank god they added Battle Royale The story mode (save the world) is the most boring and repetitive gaming experience Ive ever had. Honestly if it weren\u0027t for the vbucks you could earn and spend on battle royale i hope no one would buy this garbage fire of a game",
    "gameID": 0,
    "author": "Brutalcruel"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-12-26T00:00:00.000Z",
    "score": 0.0,
    "comments": "Unbalanced, luck based, non competitive, retarded communtity, it really is dissapointing that this game got worst over time but even when it first came out it was a **** hole.",
    "gameID": 0,
    "author": "GMbruh"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2018-12-30T00:00:00.000Z",
    "score": 7.0,
    "comments": "I at first hated fortnite. But then i actually played it. Its not that bad. Its one of those games thats enjoyable but flawed. A lot of people are prejudice against fortnite cause of all the money people waste and the cringy dances and toxic players. But if you look past all that, Fortnite is really fun, and people don\u0027t even play it to justify their bad review",
    "gameID": 0,
    "author": "RiskR"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-01-12T00:00:00.000Z",
    "score": 0.0,
    "comments": "Fortnite is the worst game I have ever played in terms of gameplay, community, and ethics. It isn\u0027t even a legitimate video game, just a toxic candy-crush-like game that is an excuse for a corrupt company to take other peoples money. I have only played for less than 38 minutes, thank God, and watched hours of videos and research on the game but I know enough about it. When I think ofFortnite is the worst game I have ever played in terms of gameplay, community, and ethics. It isn\u0027t even a legitimate video game, just a toxic candy-crush-like game that is an excuse for a corrupt company to take other peoples money. I have only played for less than 38 minutes, thank God, and watched hours of videos and research on the game but I know enough about it. When I think of humanity, I feel sad that this game is so popular; but I am happy and relieved about the amount of negative feedback it gets. #nofortnite… Expand",
    "gameID": 0,
    "author": "EnglishVan"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2019-01-12T00:00:00.000Z",
    "score": 4.0,
    "comments": "Developers have spoiled the game after the planes appeared. If you are reading this (no) then please remove these aircraft",
    "gameID": 0,
    "author": "GrD121"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 5,
    "date": "2019-01-15T00:00:00.000Z",
    "score": 0.0,
    "comments": "Why is this **** popular ? Zombie mode 0/10 battleroyal 2/10 I dont **** understand this ****",
    "gameID": 0,
    "author": "PET1N10"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-01-17T00:00:00.000Z",
    "score": 5.0,
    "comments": "Bugs,optimizacion mierda,sv BR malisimo,armas no testeadas,carente de habilidad. No le pongo menos por la tensión y la mecánica de construcción.",
    "gameID": 0,
    "author": "Eliloq"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2019-01-17T00:00:00.000Z",
    "score": 0.0,
    "comments": "This game sucks. It\u0027s cancerous as hell, contains cringy memes, it sucks, period.",
    "gameID": 0,
    "author": "AVFS37"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-01-30T00:00:00.000Z",
    "score": 1.0,
    "comments": "Epic games thinking : How do we keep our company alive? Hmmmm... maybe we can rob millions of kids of their parents money? Yeah and lets put Thanos here guys because Infinity war was soooo good film. Imagine having Thanos in Pubg? Yeah it would be worse than thrash. Yeah.. sounds cool. Most disgusting politics in the industry and the dabbing children... hold on i gotta puke. I giveEpic games thinking : How do we keep our company alive? Hmmmm... maybe we can rob millions of kids of their parents money? Yeah and lets put Thanos here guys because Infinity war was soooo good film. Imagine having Thanos in Pubg? Yeah it would be worse than thrash. Yeah.. sounds cool. Most disgusting politics in the industry and the dabbing children... hold on i gotta puke. I give it one point, because under the big **** there is some creativity with shooter base- building we must admit. Even though i would rather not :/.… Expand",
    "gameID": 0,
    "author": "Tilt1k"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2019-01-31T00:00:00.000Z",
    "score": 0.0,
    "comments": "ЕСЛИ ТЫ ИЗ МОСКВЫ ИЛИ ПИТЕРА ПОШЁЛ НАФИГ ОТСЮДА Уточню сразу - живу в Сибири.(пинг 100-120),хотя у меня довольно отличный интернет(100мб/с) Пройдусь для начала по БАТЛРОЯЛЮ До начала 4 сезона игра была нормальная,НО уже далеко не 3 сезон. Пытаются разнообразить игру ,но я как человек из Сибири этому не рад,давайте добавим зомби и всякую шнягу ,а игроки из СИБИРИ БУДУТ С ТАКИМ ПИНГОМ ВЕСЛИ ТЫ ИЗ МОСКВЫ ИЛИ ПИТЕРА ПОШЁЛ НАФИГ ОТСЮДА Уточню сразу - живу в Сибири.(пинг 100-120),хотя у меня довольно отличный интернет(100мб/с) Пройдусь для начала по БАТЛРОЯЛЮ До начала 4 сезона игра была нормальная,НО уже далеко не 3 сезон. Пытаются разнообразить игру ,но я как человек из Сибири этому не рад,давайте добавим зомби и всякую шнягу ,а игроки из СИБИРИ БУДУТ С ТАКИМ ПИНГОМ В ПАРАШЕ СИДЕТЬ. Теперь пройдёмся по ПВЕ. Сначала думал ,что будет круто ,но это ещё та фигня.Выполнять повторяющиеся задания постоянно,никакого контента.Сюжет вообще конченный ,персонажи будто болеют даунизмом. А ВЕДЬ ЗА ЭТУ ХРЕНЬ ТЫ ЕЩЁ КАК МИНИМУМ ДЕНЬГИ ОТДАЁШЬ. Про пвп много можно чего написать плохого,но эта игра не достойна внимания. Итог:зажрались ,лучше бы на деньги с пве новый сервер в СИБИРИ поставили.… Expand",
    "gameID": 0,
    "author": "GrimoQt"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-02-01T00:00:00.000Z",
    "score": 0.0,
    "comments": "Worst game ever made. I went out with this girl a few times and we are both into video games. She had heard of Fortnite and ask me if I could help her play it. Knowing Fortnite was a trash game i donwloaded it just so she could play what she wanted. After one game she shut the game down and had to leave all of the sudden. She didn\u0027t seem to like the game very much and have yet to hear fromWorst game ever made. I went out with this girl a few times and we are both into video games. She had heard of Fortnite and ask me if I could help her play it. Knowing Fortnite was a trash game i donwloaded it just so she could play what she wanted. After one game she shut the game down and had to leave all of the sudden. She didn\u0027t seem to like the game very much and have yet to hear from her since...its been two weeks. WTF… Expand",
    "gameID": 0,
    "author": "kissgoalie"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-02-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "I\u0027ve started playing because my friends did, now, after a year casually playing that **** i\u0027m 100% proud of giving them 0 money for useless skins. Apparently many other ppl did, and with their money they did nothing good for the game, just skins. Optimization never come, but downgrades of the map quality are constant. Crashes make it unplayable, community is toxic and full of kids. ****I\u0027ve started playing because my friends did, now, after a year casually playing that **** i\u0027m 100% proud of giving them 0 money for useless skins. Apparently many other ppl did, and with their money they did nothing good for the game, just skins. Optimization never come, but downgrades of the map quality are constant. Crashes make it unplayable, community is toxic and full of kids. **** this, don\u0027t try it… Expand",
    "gameID": 0,
    "author": "SaltyLupo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-02-15T00:00:00.000Z",
    "score": 7.0,
    "comments": "Fortnite is a competent, well-polished, MMO shooter that\u0027s a weird hybrid of Left 4 Dead, Minecraft and Tower Defense for PvE; it also has a cartoony Battle Royale PvP mode which grants you the ability to build forts (if you survive long enough to harvest the materials and build the structures). The game does suffer the pitfalls of most MMOs though due to overcomplicated level progressionFortnite is a competent, well-polished, MMO shooter that\u0027s a weird hybrid of Left 4 Dead, Minecraft and Tower Defense for PvE; it also has a cartoony Battle Royale PvP mode which grants you the ability to build forts (if you survive long enough to harvest the materials and build the structures). The game does suffer the pitfalls of most MMOs though due to overcomplicated level progression and grind. Also, building forts to defend against hordes of zombies sounds like fun on paper, but it gets old pretty quick when the same formula is used over and over again.… Expand",
    "gameID": 0,
    "author": "ChoicestGames"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-02-15T00:00:00.000Z",
    "score": 0.0,
    "comments": "Специально зарегистрировался здесь, чтобы поставить этому убожеству 0, ибо пока нормальные игры проходятся за неделю и уходят сразу в историю, всякая поебень по типу этой остаётся в топе всего, что только можно. Спасибо тебе, тот пидорас, который после пьянки от большого кол-ва зелёных решил свергнуть стим. Думаешь нормальные люди будут приходить и покупать игры в твоём убогом магазине?Специально зарегистрировался здесь, чтобы поставить этому убожеству 0, ибо пока нормальные игры проходятся за неделю и уходят сразу в историю, всякая поебень по типу этой остаётся в топе всего, что только можно. Спасибо тебе, тот пидорас, который после пьянки от большого кол-ва зелёных решил свергнуть стим. Думаешь нормальные люди будут приходить и покупать игры в твоём убогом магазине? Хуй тебе, мразь.… Expand",
    "gameID": 0,
    "author": "Coolgame_13Rus"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-02-16T00:00:00.000Z",
    "score": 0.0,
    "comments": "Game created to earn money from annoying kids.Bad graphic, toxic people, a lot of micro-transactions. It is just bad game wich sholudn\u0027t be so popular.",
    "gameID": 0,
    "author": "Claw_PL"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-02-19T00:00:00.000Z",
    "score": 0.0,
    "comments": "1. Trash-talkers/toxic chats 2. Copied multiple games 3. Boring gameplay 4. 9 year old tryhards 5. Emotes that brainwash kids 6. Building Overall explanation of why this game is garbage. Glad Apex exists.",
    "gameID": 0,
    "author": "ItzShockerz"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-02-22T00:00:00.000Z",
    "score": 0.0,
    "comments": "Unrealistic game, played it once, never again. No tutorial on how to play the game making it very confusing. It is hard to run on lower end pc\u0027s even though you need the best view distance because otherwise, you might think people are hacking because you can\u0027t see them, this is one of the unfair advantages other people may have. Fanboys and try hards and toxic players in the community makeUnrealistic game, played it once, never again. No tutorial on how to play the game making it very confusing. It is hard to run on lower end pc\u0027s even though you need the best view distance because otherwise, you might think people are hacking because you can\u0027t see them, this is one of the unfair advantages other people may have. Fanboys and try hards and toxic players in the community make it hard for new players to enjoy the game in which maybe they could add something to improve this, I am very disappointed, my expectation were way higher. I would say I\u0027m not too bad at the game but at least Im not trying to hurt the community. I also do not understand people spending money on this game, pixels? really?… Expand",
    "gameID": 0,
    "author": "pxff"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2019-02-23T00:00:00.000Z",
    "score": 8.0,
    "comments": "Fortnite, fue y es uno de los mejores juegos de el 2017-2018, un juego que agarro una popularidad enorme, para mi es un juego grandioso, sus graficas estan bien para la epoca, sus armas son muy buenas tambien, y agrego algo que ningun otro juego habia agregado antes, construccion, hasta el dia de hoy es unos de los juegos con las mejores habilidades que hay, y lo mejor del juego es que hayFortnite, fue y es uno de los mejores juegos de el 2017-2018, un juego que agarro una popularidad enorme, para mi es un juego grandioso, sus graficas estan bien para la epoca, sus armas son muy buenas tambien, y agrego algo que ningun otro juego habia agregado antes, construccion, hasta el dia de hoy es unos de los juegos con las mejores habilidades que hay, y lo mejor del juego es que hay actulizaciones todos los martes, todos los martes hay contenido que se agrega a fortnite, lo cual, lo hace muy espcial una cosa que hay que recalcar son los bugs, al añadir una nueva arma o item o lo que sea, tiene el riesgo de que sea demasiado op, pero apara eso existen las actualizaciones!, y creo que sera todo Conclusion final: Fortnite es un juego que tiene potencial y lo esta aprovechando al maximo, y esperemos que siga asi!… Expand",
    "gameID": 0,
    "author": "Mauron"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-02-23T00:00:00.000Z",
    "score": 0.0,
    "comments": "1. Феменистская диктатура 2. Гейская диктатура 3. Вырвиглазный кислотный стиль 4. Аудитория состоит в основном из бомбящих 9 летних школьников 5. Новые баги каждый день 6. Геимплей скучный как молитва 7. Строительство сделано васькой из 5\"Б\" 8. Если скопировать ВСЁ из других игр,то это не считается новой игрой 9. Танцы? вы серьёзно нормальный человек? 10. Эмоции покупаются за1. Феменистская диктатура 2. Гейская диктатура 3. Вырвиглазный кислотный стиль 4. Аудитория состоит в основном из бомбящих 9 летних школьников 5. Новые баги каждый день 6. Геимплей скучный как молитва 7. Строительство сделано васькой из 5\"Б\" 8. Если скопировать ВСЁ из других игр,то это не считается новой игрой 9. Танцы? вы серьёзно нормальный человек? 10. Эмоции покупаются за лютый донат Хотите нормальный Батл-Рояль? играйте в АРЕХ, даже с его вылетами. вы получите больше удовольствия,а тем более останетесь натуралом. UPD:тупое говно,тупого говна 0/10… Expand",
    "gameID": 0,
    "author": "FPS_lover"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-02-25T00:00:00.000Z",
    "score": 0.0,
    "comments": "---------------------------------------------------------------------------",
    "gameID": 0,
    "author": "davidpole23"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-02-25T00:00:00.000Z",
    "score": 1.0,
    "comments": "My TL;DR version of my review overall: Who the f@#k wants to spend time on \"Monetized Memes\" A.K.A Fortnite? First off, WTF happened to the singleplayer mode? If you\u0027re going to make a game that is pretty much solely battle royale, then ditch the single player mode and stop using it for game descriptions. Second, the battle royale gameplay is boring, either on Android or PC. If it\u0027s onMy TL;DR version of my review overall: Who the f@#k wants to spend time on \"Monetized Memes\" A.K.A Fortnite? First off, WTF happened to the singleplayer mode? If you\u0027re going to make a game that is pretty much solely battle royale, then ditch the single player mode and stop using it for game descriptions. Second, the battle royale gameplay is boring, either on Android or PC. If it\u0027s on PC, the game rewards those who can build the fastest and who can throw the most bullets and/or explosives at their opponent. And the mobile version is abhorrent. If PUBG Mobile can have a solid framerate with decent graphics, then why is Fortnite relegated to having either 30 FPS with graphics that look like censorship in a porn game, or 15 FPS with graphics only slightly better. Granted, I don\u0027t know anything about the IOS version, and the game constantly hyped that it was optimized for IPhone X, so maybe someone will get a kick out of it, but then comes the market and the Battle Pass. The free BP has rerwards only up to level 50 out of 100 levels. Basically, the Battle Pass is saying \"Thanks for playing, but if you want to have more fun You\u0027ll need to cough up at least 10 dollars.\" The market isn\u0027t any better, with everything there also costing at least 10 dollars, and the few things that don\u0027t cost that much, such as a 200 V-Buck emote, is locked behind either grinding the game\u0027s free battle pass for that one emote or spending at least 10 dollars. There is no amount of V-Bucks that costs less than 10 dollars. However, I will explain why I gave Fortnite a 1 instead of a 0, and that\u0027s because the console version is alright. There is slightly slower reaction speed from everyone and the game is at a manageable pace so that it is easier to not get steam rolled in the first several seconds just because someone gets some materials or weapons first. Other than that, the hype surrounding this game is utter garbage, and shows that not even thee memes that people cherish online are safe from pay-gating. And this game is from the same developer that made the excellent Infinity Blade 1 and 2? **** off.… Expand",
    "gameID": 0,
    "author": "MattewIsHere"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-03-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "revolutionary construction system, revolutionary live events and revolutionary complexity of required skill",
    "gameID": 0,
    "author": "tantarone"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-03-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "This review contains spoilers, click expand to view. wooooooowwww what a good game i think this is one if the greatest multiplayer game i played… Expand",
    "gameID": 0,
    "author": "kylegamer"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-03-09T00:00:00.000Z",
    "score": 2.0,
    "comments": "Bought this game back when it was first released, so i guess \"Beta\", played through the horrific single player tutorials and quickly lost interest when just trying to get into the campaign next map was enraging. Stopped play entirely and just assumed it was a terrible game. Some demon possessed me to try playing the game again pre-patch 8.0 (so the winter season). I was surprised howBought this game back when it was first released, so i guess \"Beta\", played through the horrific single player tutorials and quickly lost interest when just trying to get into the campaign next map was enraging. Stopped play entirely and just assumed it was a terrible game. Some demon possessed me to try playing the game again pre-patch 8.0 (so the winter season). I was surprised how much work they had put into the campaign and started to enjoy the constructor character a lot. build base. upgrade it. install B.A.S.E., install traps, fight hords. Was very enjoyable game play to be bale to focus on base defenses instead of the drool combat machinics of the game. Then patch 8.0 hit and Constructors were completely nerfed. I had spent a lot of time building my constructor over the season to have it all for not with abilities removed and destroyed. It seems that for a game called \"fort\" nite the direction of the game is less about the \"fort\" and more about the mindless, pointless, utterly boring \"combat\" mechanics.… Expand",
    "gameID": 0,
    "author": "Phill1022"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Who doesn\u0027t love to give a bad rating to a hype-crazed game? The user score for this game is unforgiving and completely irrelevant in terms of actual scoring. Fortnite not only changed the BR game type for the better, but expanded it into an entire independent genre of it\u0027s own. How many games can you say update daily, weekly, or even monthly like this game seems to. With an ever changingWho doesn\u0027t love to give a bad rating to a hype-crazed game? The user score for this game is unforgiving and completely irrelevant in terms of actual scoring. Fortnite not only changed the BR game type for the better, but expanded it into an entire independent genre of it\u0027s own. How many games can you say update daily, weekly, or even monthly like this game seems to. With an ever changing map, meta, load-outs, skins, dances, and everything else, no two games are the same that lead to endless hours of playtime without wondering what will come next. Of course, there are unpopular times and un-favored additions to the game, but Epic is excellent at hearing out the players and evolving the game to only enhance the experience each and every time. This will be a game well remembered.… Expand",
    "gameID": 0,
    "author": "PeakZach"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-03-23T00:00:00.000Z",
    "score": 0.0,
    "comments": "Ci ho messo parecchio tempo per decidere quale possa essere un voto giusto per questo titolo. Un Battle Royale può starmi benissimo come modalità di gioco e come tale essere valutata ma trovo a dir poco offensivo verso ogni altro videogame dare un voto come se mettere una location e dar modo a più giocatori di far secche le rispettive controparti virtuali bastasse affinché il tutto possaCi ho messo parecchio tempo per decidere quale possa essere un voto giusto per questo titolo. Un Battle Royale può starmi benissimo come modalità di gioco e come tale essere valutata ma trovo a dir poco offensivo verso ogni altro videogame dare un voto come se mettere una location e dar modo a più giocatori di far secche le rispettive controparti virtuali bastasse affinché il tutto possa essere considerato un gioco \"intero\". 0 lo vedo come \"non classificato\" e credo che sia l\u0027unica valutazione possibile per qualcosa che al di fuori del bacino di utenza non ha alcun contenuto per cui essere valutato.… Expand",
    "gameID": 0,
    "author": "Naifinside"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-04-01T00:00:00.000Z",
    "score": 0.0,
    "comments": "Piece **** where is fat feminists wtf epic give me back my detroid become feminist",
    "gameID": 0,
    "author": "Hidezen"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-04-12T00:00:00.000Z",
    "score": 1.0,
    "comments": "never play this awful game. not worst BR ever, but it trying... make Tim Sweeney suck, he doesn\u0027t deserve your time and money.",
    "gameID": 0,
    "author": "WaY_CuP"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-04-29T00:00:00.000Z",
    "score": 0.0,
    "comments": "Boring game, divisive. Not much content here, and what there is isn\u0027t much at all. Recommend you avoid this game.",
    "gameID": 0,
    "author": "Krossbone"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-05-07T00:00:00.000Z",
    "score": 2.0,
    "comments": "This could have been a great game, somewhat similar to Warframe. Unfortunately, they botched it. I like the concept, but they made the missions boring. Even if you complete all the objectives in the map, you still have to wait forever to finish. (timer has to run out first) Matchmaking is broken and slow. When you find a group and enter the mission, there will always be 2 players thatThis could have been a great game, somewhat similar to Warframe. Unfortunately, they botched it. I like the concept, but they made the missions boring. Even if you complete all the objectives in the map, you still have to wait forever to finish. (timer has to run out first) Matchmaking is broken and slow. When you find a group and enter the mission, there will always be 2 players that just stand there AFK while the other 2 players do the mission for them. This is happening because of how the missions are made and the fact that you get full mission rewards for not doing anything. You can\u0027t find your own team because there is no chat in the lobby. Compare this to Warframe where you have to whisper people to find a team, this makes it much less likely for anyone to AFK. Also, in Warframe there are actually incentives in some missions to finish quickly, and i think if you die you don\u0027t get some rewards. Meanwhile in Fortnite you can die 20 times and still get full rewards. Not that you would die even 1 time while AFK because there is no threat unless you seek out enemies... I\u0027m not able to understand why they don\u0027t fix this stuff, it\u0027s much more important than putting in new heroes and weapons... I guess selling loot boxes to fans is more important? That being said, the battle royal mode is pretty good. I would give it 7/10.… Expand",
    "gameID": 0,
    "author": "CunFuse"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-05-14T00:00:00.000Z",
    "score": 0.0,
    "comments": "This game is so full of hackers and the use of aim assist for controller users is a built in hack for them. I play with a friend on PS4 (Me on PC) and in playground he totally owns me because of the aim assist. he is good even with the aim assist off, but as soon as he turns it on it is a huge difference in aim and hit ratio. I see a massive difference especially with quick scope hits.This game is so full of hackers and the use of aim assist for controller users is a built in hack for them. I play with a friend on PS4 (Me on PC) and in playground he totally owns me because of the aim assist. he is good even with the aim assist off, but as soon as he turns it on it is a huge difference in aim and hit ratio. I see a massive difference especially with quick scope hits. this game was fun for a while but has become so hacked and with devs pushing out so many updates that it is a mess. sorry Epic I hate it now… Expand",
    "gameID": 0,
    "author": "ThorKiller02"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-05-14T00:00:00.000Z",
    "score": 2.0,
    "comments": "No, don\u0027t do this to yourself. It\u0027s just a rock-paper-scissors game. Just drop on a place, find the best weapon currently in the game (everything freaking changes all the time), find somebody who has nothing, pew pew hes dead. There\u0027s no skill in this game and the building is awful... If you get high ground you\u0027re at a advantage, but 3 pew pews and your building is gone in like 3No, don\u0027t do this to yourself. It\u0027s just a rock-paper-scissors game. Just drop on a place, find the best weapon currently in the game (everything freaking changes all the time), find somebody who has nothing, pew pew hes dead. There\u0027s no skill in this game and the building is awful... If you get high ground you\u0027re at a advantage, but 3 pew pews and your building is gone in like 3 seconds, you fall, you open up the parachute thing so you don\u0027t fall to your death and you\u0027re an easy target for everybody... And Jesus Christ the fan-base... The co-op is garbage, if you don\u0027t play with your friends, the chance is high you get just trash teammates or none at all! Sometimes you play in squads of 4 and only 2 other players spawn in. This game is garbage. Don\u0027t waste your time on this piece of crap.… Expand",
    "gameID": 0,
    "author": "Siebentje"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-05-19T00:00:00.000Z",
    "score": 1.0,
    "comments": "This review contains spoilers, click expand to view. Very very very very very very very very very very very very very very very bad… Expand",
    "gameID": 0,
    "author": "Whods"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-05-21T00:00:00.000Z",
    "score": 2.0,
    "comments": "Graphically one of the most ugliest games I have ever played, goofy kiddy physics made for 5 year olds, over priced skins that cost way more than they should be. One skin with the price of 20+ bucks... Lobbies full of annoying children, unbalanced gameplay, same map for how many months with minor alterations, cash grab game, punchable faces, silly kiddy dances, save the world players gotGraphically one of the most ugliest games I have ever played, goofy kiddy physics made for 5 year olds, over priced skins that cost way more than they should be. One skin with the price of 20+ bucks... Lobbies full of annoying children, unbalanced gameplay, same map for how many months with minor alterations, cash grab game, punchable faces, silly kiddy dances, save the world players got screwed over, etc. Epic Games... Yeah... what\u0027d you expect. Poor Battle Royale game and poor overall experience. I guess the only fun thing I ever found was 50 vs 50??? Other than that this game is one worst games I have ever played in my entire 20+ years of gaming.… Expand",
    "gameID": 0,
    "author": "death12123"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-05-23T00:00:00.000Z",
    "score": 1.0,
    "comments": "Aboselut **** for kids under 9. ****ty community. Don\u0027t even try to play this WORST GAME EVER.",
    "gameID": 0,
    "author": "FireDragonMS"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-05-23T00:00:00.000Z",
    "score": 1.0,
    "comments": "The number says it all, this bullcrap shouldn\u0027t exist abcdefghijklmnoprstuwz",
    "gameID": 0,
    "author": "eRoxPlayGames"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-05-26T00:00:00.000Z",
    "score": 1.0,
    "comments": "This is completely **** don’t play this game please for good games.",
    "gameID": 0,
    "author": "CWIRRED"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2019-05-30T00:00:00.000Z",
    "score": 1.0,
    "comments": "To cut a long story short the game could get more and could be better if the only aim of EpicGames wasn\u0027t money. Should we nerf some weapons, fix bugs and upgrade the other weapons, that were the least used? No, no, no. New skins, custom skins for weapons and vehicles, new donation packs - this is what we want.",
    "gameID": 0,
    "author": "Drudik"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-06-02T00:00:00.000Z",
    "score": 2.0,
    "comments": "PUBG brought us an intense massive deathmatch battle royale experience where patience and exploration rewards your efforts. Using the same game engine, Epic made Fortnite... an easier, dumbed down version of the same game and released it for free. I can appreciate the people who enjoy it. I do not not. If I never see another emote or new skin in a video game I wouldn\u0027t exactly be sad.PUBG brought us an intense massive deathmatch battle royale experience where patience and exploration rewards your efforts. Using the same game engine, Epic made Fortnite... an easier, dumbed down version of the same game and released it for free. I can appreciate the people who enjoy it. I do not not. If I never see another emote or new skin in a video game I wouldn\u0027t exactly be sad. I\u0027m giving this game a low score. I\u0027m sorry folks. I just do not enjoy it.… Expand",
    "gameID": 0,
    "author": "Donnie_Plays"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-06-04T00:00:00.000Z",
    "score": 0.0,
    "comments": "Absolute worst game 2017. A truly downgrade from PUBG thats not all. Community is awful (probably one of the worst) the updates are now garbage, the balance sucks and the worst thing about this game is that Epic is UNCREATIVE! They ripoffed PUBG, Apex Legends, Overwatch, Minecraft and Realm Royale. Such a shame that this game just lost the potential, that it had in S1 - S2...",
    "gameID": 0,
    "author": "TheReaperX"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2019-06-08T00:00:00.000Z",
    "score": 8.0,
    "comments": "I\u0027m giving this positive review because it pisses off PUBG fanboys and causes many \"true gaymerz\" to have a stroke. GIT GUD SCRUBS",
    "gameID": 0,
    "author": "DogeWowIsBack"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2019-06-15T00:00:00.000Z",
    "score": 0.0,
    "comments": "This game is just horrible! After almost 2 years of plaguing the gaming community and making billions of Dollars off of Micro transactions ist still an Early -Access-Game! Speaking of Micro transactions: They are some of the worst i have ever seen outside a not EA- or Activision-Game! I know a few People that spend over 200 € and left the game a few months ago, beeing ashmed of what theyThis game is just horrible! After almost 2 years of plaguing the gaming community and making billions of Dollars off of Micro transactions ist still an Early -Access-Game! Speaking of Micro transactions: They are some of the worst i have ever seen outside a not EA- or Activision-Game! I know a few People that spend over 200 € and left the game a few months ago, beeing ashmed of what they have done. I cant recommend this peace of data to you!… Expand",
    "gameID": 0,
    "author": "Ininite-Game"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2019-06-21T00:00:00.000Z",
    "score": 0.0,
    "comments": "8 year olds unite! This is just a really bad version of a great battle royale genre.",
    "gameID": 0,
    "author": "WariowareSM"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2019-06-26T00:00:00.000Z",
    "score": 1.0,
    "comments": "Simple words: Worst battle royale game ever made. Just thhe same thing over and over again, and now that epic has run out of ideas, they just throw in random stuff just to have something to add, which makes the game even worse.",
    "gameID": 0,
    "author": "Liam_Lindh"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2019-06-28T00:00:00.000Z",
    "score": 8.0,
    "comments": "Fortnite es muy divertido, sin embargo, creo que es muy poco amigable con los jugadores nuevos. Y esto hace que epic games tome malas decisiones haciendo el juego mas \u0027\u0027facil\u0027\u0027 para ayudar a estos jugadores. Si tuviese que dar una idea, seria que epic crease un tutorial sobre como construir, como protegerte y las cosas basicas, para ayudar asi a los mas nuevos. Personalmente creo que esteFortnite es muy divertido, sin embargo, creo que es muy poco amigable con los jugadores nuevos. Y esto hace que epic games tome malas decisiones haciendo el juego mas \u0027\u0027facil\u0027\u0027 para ayudar a estos jugadores. Si tuviese que dar una idea, seria que epic crease un tutorial sobre como construir, como protegerte y las cosas basicas, para ayudar asi a los mas nuevos. Personalmente creo que este juego es a dia de hoy uno de los shooters mas dificil, y no por un tema de AIM, sino por que la mecanica de construccion no a todos se les da bien, y es mucho mas compleja de lo que puede parecer a simple vista. Creo que es de los unicos BattleRoyale en el que compensas tu mala suerte con tu buena habilidad. Si bien el juego se convirtio en una moda, esto no tiene porque ser malo.… Expand",
    "gameID": 0,
    "author": "MonkeyDSnoopy"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2019-07-01T00:00:00.000Z",
    "score": 1.0,
    "comments": "This review contains spoilers, click expand to view. Crap pure garbage come on, no memes not a game for true gamers and by the don’t mention the overly priced skins to what keeps it away from a 0 is that it has two islands… Expand",
    "gameID": 0,
    "author": "Employer"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2019-07-09T00:00:00.000Z",
    "score": 4.0,
    "comments": "Fortnite is a global phenomenon that has controlled millions of lives around the world. Yet, it\u0027s not that great. Fortnite\u0027s entire success revolves around the in-game purchases you are constantly reminded to restock on. \"Hey! There\u0027s a new Fortnite skin out! I guess I\u0027ll have to spend 10 dollars on each one they add!\" Since this game\u0027s target audience is on the edge of the premature, EpicFortnite is a global phenomenon that has controlled millions of lives around the world. Yet, it\u0027s not that great. Fortnite\u0027s entire success revolves around the in-game purchases you are constantly reminded to restock on. \"Hey! There\u0027s a new Fortnite skin out! I guess I\u0027ll have to spend 10 dollars on each one they add!\" Since this game\u0027s target audience is on the edge of the premature, Epic Games has no problem displaying their corporate greed for all the world to see. They have made billions feeding off of 5-year-olds\u0027 parents\u0027 debit cards. Fortnite\u0027s childish mechanics and graphics make everything seem innocent and harmless, and since it\u0027s free, your first impressions on Fortnite are mild. You don\u0027t really see any problem with the game. Then you discover its toxic community and desire to devour your bank account in one gulp. The reason I\u0027m not giving this game a straight 0 is because the devs clearly put a lot of work into this game, and, this should go without saying, you need an amazing game and marketing team to make a free-to-play game the highest grossing game of all time, so huge props to the Epic Games team. But, there\u0027s one thing about Epic Games. Their workers have been in studies showing that most of them do 50, sometimes 60 to 70 hour work weeks. Fortnite\u0027s massive success has led to the hundreds of workers at Epic have depressing lives and are eternally stressed out. If there\u0027s a bug in the game, they fix it immediately: they don\u0027t milk their customers into buying the game once and then not doing anything about it, they (I can\u0027t believe I\u0027m about to say this) care about their players. So, if you plan on playing Fortnite, be warned of this company\u0027s greed for money and not to fall into the trap of no longer being a \u0027lonely default skin.\u0027 This game can be fun at times, but I just lost it when they added a \u0027story\u0027 to Fortnite, which may be the dumbest thing that has happened to any AAA game. IT\u0027S NOT AN RPG! 4/10 Erashor… Expand",
    "gameID": 0,
    "author": "Erashor"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2019-07-19T00:00:00.000Z",
    "score": 0.0,
    "comments": "This game is **** diseaster, emotes only to laugh at other players. This game made go mentally wrong. I jsut want to kill all of those **** 11 years old **** who makes this game horrible.",
    "gameID": 0,
    "author": "Korfusan"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2019-07-20T00:00:00.000Z",
    "score": 0.0,
    "comments": "fortnite bad, minecraft good. 1v1 me mate here is text to make it 75 characters.",
    "gameID": 0,
    "author": "hermannhyh"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-07-20T00:00:00.000Z",
    "score": 0.0,
    "comments": "i think this game is just full of toxic kids and its really annoying me i cant stand this game its so many glitches and they are removing everything that was good with the game + fortnite just rip offed minecraft hunger games and it makes me really sad",
    "gameID": 0,
    "author": "Venqo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-07-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best Battle royale game for me but very hard events are good ................",
    "gameID": 0,
    "author": "MrCaptainS"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2019-07-24T00:00:00.000Z",
    "score": 2.0,
    "comments": "I did not play pve yet. only pvp. I am disappointed because the game is not base on the fun but on making money. falling from a tree can take off 75% off your life (ridiculous) . if a guy starts to shoot you from behind you are 80% sure to be dead. I won 3 games. the first one I got 2 gliders. the second one in squad I got nothing , the third in solo again I got nothing . what is theI did not play pve yet. only pvp. I am disappointed because the game is not base on the fun but on making money. falling from a tree can take off 75% off your life (ridiculous) . if a guy starts to shoot you from behind you are 80% sure to be dead. I won 3 games. the first one I got 2 gliders. the second one in squad I got nothing , the third in solo again I got nothing . what is the point to win if you got nothing for a victory ? at least a t-shirt or some sandals whatever. It is like they made this game to make you loose quick and make you spend money on stuff that is useless. It is fun for 2 weeks after you know the game and has no interest. doing as many challenges to get a glider it is ridiculous. an alternative to fortnite and it looks the same and I got some fun with it : REALM ROYALE it is free and more fun.… Expand",
    "gameID": 0,
    "author": "ledimi"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-07-28T00:00:00.000Z",
    "score": 0.0,
    "comments": "There are so many bugs, glitches and hacks. The graphics are terrible and the story is laughable, how this has been the number one game for two years is beyond me",
    "gameID": 0,
    "author": "Candyman2187"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-08-11T00:00:00.000Z",
    "score": 8.0,
    "comments": "good game, good fx, good and much updates, but small map. need more maps and more weapons. no pay to win!",
    "gameID": 0,
    "author": "Slashchat"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-08-15T00:00:00.000Z",
    "score": 0.0,
    "comments": "The worst game I\u0027ve ever played, too many lag bugs, drop from fps unbalanced weapons",
    "gameID": 0,
    "author": "Draggho002"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-08-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "just the greatest battle royale of all time. i do believe hte game gets a lot of hate because of its developper and its store but i feel in terms of gameplay and fun, my first phrase represents it very well",
    "gameID": 0,
    "author": "BRUHGUY"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-08-27T00:00:00.000Z",
    "score": 2.0,
    "comments": "Won\u0027t get a yandere simulator skin so I hate this even more than I used to. Also, fortnite murdered my whole family :(",
    "gameID": 0,
    "author": "CharmX"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-05T00:00:00.000Z",
    "score": 7.0,
    "comments": "um jogo até q bom,hj em dia n ta tao bom por causa das atualizações,enfim,vale a pena jogar",
    "gameID": 0,
    "author": "snowwbr"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-13T00:00:00.000Z",
    "score": 4.0,
    "comments": "This game is fun, but it has a bad taste with bugs and much more. Now playing this game with friends and jumping with 100 players is a great experience. The building is also very unique and fun. The problem is that they update this game weekly, and that leads too lots of bugs, and ruins the battle royal experience. They recently added \"mechs\" and those have a very unfair advantage, andThis game is fun, but it has a bad taste with bugs and much more. Now playing this game with friends and jumping with 100 players is a great experience. The building is also very unique and fun. The problem is that they update this game weekly, and that leads too lots of bugs, and ruins the battle royal experience. They recently added \"mechs\" and those have a very unfair advantage, and can be very annoying and tedious when you get killed by them. I think you should just stick with PubG or Minecraft kids.… Expand",
    "gameID": 0,
    "author": "MayorMyers"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-15T00:00:00.000Z",
    "score": 3.0,
    "comments": "a 43 hours of rubbish. win a game, be happy, play again, be addicted, spend money, buy a skin, play again, lose, get bored, die! a 10 hours of a fun pve. play the game with friends, have fun, win loots for playing, and continue to play and a 10 hours of creative! the most fun part of the game. battle, build or do anything with your friends!",
    "gameID": 0,
    "author": "deno724"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-15T00:00:00.000Z",
    "score": 0.0,
    "comments": "Epic games looks like a child throwing moneys. Stop buying exclusives, improve your launcher and games.",
    "gameID": 0,
    "author": "Saw135"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-18T00:00:00.000Z",
    "score": 0.0,
    "comments": "i don\u0027t understand battegrounds popularity, but atleast when I was playing PUBG or Apex I have some fun. The reason of such low score from me are two. Without spending real money inside of game progressing is so slow and annoying that is totaly kill pleasure and the community is worse than Cs:go, LoL and dota together.",
    "gameID": 0,
    "author": "zbysiek123456"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "InfravaloradooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooInfravaloradooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo!!!… Expand",
    "gameID": 0,
    "author": "ElFornait"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-23T00:00:00.000Z",
    "score": 0.0,
    "comments": "kurde no gierka spoko ale optymalizacja tego scierwa to zero nie da sie po prostu sie nie da, i jebac mechy",
    "gameID": 0,
    "author": "dupajasiaSIEMA"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-25T00:00:00.000Z",
    "score": 0.0,
    "comments": "it\u0027s a really stupid game that\u0027s played by kids who will be embarrassed in 10 years because of all the flossing they did",
    "gameID": 0,
    "author": "greninjaX"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-28T00:00:00.000Z",
    "score": 7.0,
    "comments": "Let\u0027s all not forget that this is actually a good game ruined by the community and some mistakes by Epic Games which are mostly fixed now.",
    "gameID": 0,
    "author": "Lynx240"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2019-10-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "OKAY GUYS iiom nawt gomnnwa lie dis game can suck big poop i r8 0/1000 for the battrle royole and the zombie game is liek a 0/1000 okay thanks fore reading and btw shrek dies in endgame...sowwy for spoiler. Hit the YES for helpful button if your kool",
    "gameID": 0,
    "author": "Karma012543"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-10-22T00:00:00.000Z",
    "score": 0.0,
    "comments": "This review contains spoilers, click expand to view. guys, miencreaft iz bettr then this tresh. lets b reel, no 1 lieks fort teribl, becuz miencreaft iz bettr. this copyd miencreaft. me no liek that at all. hecc u epic gaems. My wife left me........… Expand",
    "gameID": 0,
    "author": "Chickenroast87"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-10-30T00:00:00.000Z",
    "score": 1.0,
    "comments": "В это крайне невозможно играть так как ты можешь умереть только потому что в локации куда ты высадился может не быть нормального лута",
    "gameID": 0,
    "author": "Mayor_g0lub"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-11-03T00:00:00.000Z",
    "score": 4.0,
    "comments": "Meh. Fortnite is the most popular battle royale game and everyone is playing it. There is some fun to be had with Fortnite, but it is very very repetitive. I do like dropping down and picking up items and killing people with the building, but it is just so repetitive. All these updates are ruining the game, the devs just need to take it down a notch. We need to go back to a simple timeMeh. Fortnite is the most popular battle royale game and everyone is playing it. There is some fun to be had with Fortnite, but it is very very repetitive. I do like dropping down and picking up items and killing people with the building, but it is just so repetitive. All these updates are ruining the game, the devs just need to take it down a notch. We need to go back to a simple time where there was the OG map and no insane updates.… Expand",
    "gameID": 0,
    "author": "Averycrosslin"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-11-10T00:00:00.000Z",
    "score": 0.0,
    "comments": "This game is the most boring game I have ever played. The gameplay is",
    "gameID": 0,
    "author": "Thdragoon"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2019-11-17T00:00:00.000Z",
    "score": 4.0,
    "comments": "Has lots of bugs, users with packet loss gets away of not being killed by a gun, filled with exploits and ISP problems and has the worst updates and balancing system in the game. It also has the stupidest and useless feedback and report system. They won\u0027t add a freaking SEA server so I can find people to play with in Squads (Randomized) and I have to deal with Indians abusing the MicHas lots of bugs, users with packet loss gets away of not being killed by a gun, filled with exploits and ISP problems and has the worst updates and balancing system in the game. It also has the stupidest and useless feedback and report system. They won\u0027t add a freaking SEA server so I can find people to play with in Squads (Randomized) and I have to deal with Indians abusing the Mic and the new item that grab players and hooks them which deals 76 to the enemy and none to teammates AND CAN BE USED TO ANNOY YOU WHICH WHAT THE INDIANS WERE DOING. Sick and tired of this game. I gave it 4 for its stupid meta items and for its Chapter 2 Intro. That was amazing until I got tired of the garbage updates.… Expand",
    "gameID": 0,
    "author": "DioXGaming"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-11-18T00:00:00.000Z",
    "score": 0.0,
    "comments": "This game is unoriginal garbage. it got popular because the developer paid a youtuber to play it and go like this is the best game ever. but it is not. i have my reasons for my negativity, and let me explain. the building aspect and nonverbal storytelling were both ripped from Minecraft. the battle royale aspect was ripped from Minecraft fan minigames and games like PUBG. they use mobileThis game is unoriginal garbage. it got popular because the developer paid a youtuber to play it and go like this is the best game ever. but it is not. i have my reasons for my negativity, and let me explain. the building aspect and nonverbal storytelling were both ripped from Minecraft. the battle royale aspect was ripped from Minecraft fan minigames and games like PUBG. they use mobile gaming methods to make this game addictive in a bad way. also, look at all the microtransactions. that shows a developer who develops for money, not for the fans. Overall, stay far away from Fortnite. stay FAR AWAY.… Expand",
    "gameID": 0,
    "author": "ExcuuuseMeZelda"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-11-19T00:00:00.000Z",
    "score": 1.0,
    "comments": "No me gusta porque hay que construir y eso es malo, Eric chupala qliao xddddd",
    "gameID": 0,
    "author": "br0k3nm4n"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-11-22T00:00:00.000Z",
    "score": 0.0,
    "comments": "Game no longer playable, full of hackers (especially in Brazil server) and boring. Just ****",
    "gameID": 0,
    "author": "Fantasy12"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-11-22T00:00:00.000Z",
    "score": 2.0,
    "comments": "This \"game\" is horrible. cant login to my account every time when i entering password it starts to shows errors, and i every time entered correct password.Another problem is awful physics:the rifle and gun doesnt strikes any damage , when the worst shotgun kills a person in three or four hits. I dont reccomend to anybody to play this mediocre piece of sh*t.",
    "gameID": 0,
    "author": "thegamemaster8"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-11-24T00:00:00.000Z",
    "score": 1.0,
    "comments": "Bad game, made by bad people, stealing money and ideas from others to profit off of selling these things to children from a \"F2P\" model scheme. Gross business practice. **** game, bad gameplay, bad graphics. Giving this a 1/10 because the only good thing I can say is they did a good job on their cross-comparability even if it was ultimately made to just milk even more money out ofBad game, made by bad people, stealing money and ideas from others to profit off of selling these things to children from a \"F2P\" model scheme. Gross business practice. **** game, bad gameplay, bad graphics. Giving this a 1/10 because the only good thing I can say is they did a good job on their cross-comparability even if it was ultimately made to just milk even more money out of their audience.… Expand",
    "gameID": 0,
    "author": "SolidSovereign"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-12-05T00:00:00.000Z",
    "score": 6.0,
    "comments": "Adoro o jogo, mas está repleto de bugs, não consigo nem jogar uma partida de. Apresentar um erro",
    "gameID": 0,
    "author": "SrPoliert"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-12-17T00:00:00.000Z",
    "score": 2.0,
    "comments": "Garbage. Absolute garbage. Since Chapter 2 it was good and everyone enjoyed it again and what did Epic do? Screwed it up again - Half way through the first season of it. They should\u0027ve just made Fortnite as a Save The World campaign and not a Battle Royale. Because all you get from Battle Royale, it\u0027s more of a bloody LAG AND PING Royale. It doesn\u0027t matter how beefy or strong yourGarbage. Absolute garbage. Since Chapter 2 it was good and everyone enjoyed it again and what did Epic do? Screwed it up again - Half way through the first season of it. They should\u0027ve just made Fortnite as a Save The World campaign and not a Battle Royale. Because all you get from Battle Royale, it\u0027s more of a bloody LAG AND PING Royale. It doesn\u0027t matter how beefy or strong your computer, console and Internet is, their servers just cause lag constantly. The main issue of it is that they keep trying to make their game stand out by adding promotions into their game like Avengers and Star Wars, it\u0027s pathetic. They add Lightsabers and First Order weapons and make them overpowered and for what? Just to give toxic kids an advantage? I don\u0027t even know why Lucasfilm is allowing for these greedy pillocks to do this. To me, Epic Games just don\u0027t know how to work their own game, my message is to them is that if they can\u0027t keep it stable and working, shut it down. It\u0027d be a wise choice. So altogether, if you consider downloading and playing this crap of a game, go for it. I mean it\u0027s not illegal to play it but I\u0027d consider saving your money and dignity from these type of stupid games. But I\u0027m gonna tell you, all you\u0027re gonna get from this game is: Lag, Broken Aim, Broken Weapons, Ridiculous Gameplay - Oh, and a toxic community. I\u0027m disappointed actually, it\u0027s just that Epic gets a billion dollar budget but yet don\u0027t use it to satisfy anyone\u0027s needs and support. They just flip you off and take your money. I\u0027m not gonna lie, that game had potential and I mean it, but it\u0027s unfortunate that it had no choice but to be dragged down by the company itself and the toxic kids who play it. It\u0027s just not worth your time and effort, Apex is more likely to satisfy their customers.… Expand",
    "gameID": 0,
    "author": "Kylose"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-01-05T00:00:00.000Z",
    "score": 0.0,
    "comments": "**** for kids. .............. ..... ................. .................................",
    "gameID": 0,
    "author": "IMausik"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2020-01-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "Pcerdos culiaos dejen de jugar lol y manfinflarse weon me dan asco el fornai es mejor que sus weas pencas como el counter",
    "gameID": 0,
    "author": "Crashloxx"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-01-09T00:00:00.000Z",
    "score": 0.0,
    "comments": "I hate when I shoot a enemy it just transforms into a two storey building..",
    "gameID": 0,
    "author": "TOHH"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-01-10T00:00:00.000Z",
    "score": 0.0,
    "comments": "СУКА БЛЯДЬ СОЗДАТЕЛИ ГОВРИТЕ В АДУ БЛЯТЬ СУКА НИ ОДНОГО БЛЯДСКОГО НУБА ЗА 50 ЧАСОВ ИГРЫ НЕ ВСТРЕТИЛ Я ЕБАЛ ВАШУ ИГРУ БЛЯДЬ УМРИТЕ ГНИДЫ",
    "gameID": 0,
    "author": "JolyWonka1"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2020-01-13T00:00:00.000Z",
    "score": 0.0,
    "comments": "RU: Игра сейчас стала скучной, в катках одни школьники от 5 до 10 лет и более возрастов. В 2017-18 годах игра была великолепной, но сейчас это просто донатерская контора. Epic Games не хотят ничего делать как-то продвигать проект чтобы те у кого нет денег смогли бы поиграть хоть с какими-то скинами нежели обычные. Короче, если бы я зарегистрировался в 2017-18 годах на Metacritic то я быRU: Игра сейчас стала скучной, в катках одни школьники от 5 до 10 лет и более возрастов. В 2017-18 годах игра была великолепной, но сейчас это просто донатерская контора. Epic Games не хотят ничего делать как-то продвигать проект чтобы те у кого нет денег смогли бы поиграть хоть с какими-то скинами нежели обычные. Короче, если бы я зарегистрировался в 2017-18 годах на Metacritic то я бы поставил этой игре 10/10, но сейчас это игра приносящая разработчикам большие деньги, но они ленятся что-либо сделать новое и своё чтобы другие Battle royale игры завидовали их оригинальности. Итог: игра была крута в 17-18 годах, но сейчас это донатерская контора для кошелька родителей - 0/10. EN: The game has now become boring, in the rinks some students from 5 to 10 years and more ages. In 2017-18, the game was great, but now it\u0027s just a donut shop. Epic Games do not want to do anything to promote the project so that those who do not have money could play at least with some skins than usual. In short, if I had registered in 2017-18 on Metacritic, I would have put this game 10/10, but now it\u0027s a game that brings developers a lot of money, but they are too lazy to do anything new and their own to other Battle royale games envied their originality. Bottom line: the game was cool in 17-18 years, but now it\u0027s donarska office to the purse of the parents is 0/10. (Sorry for my English, I translate with the help of a translator :) )… Expand",
    "gameID": 0,
    "author": "egorryabtsev780"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-01-16T00:00:00.000Z",
    "score": 7.0,
    "comments": "I play this game quite often. I completely understand why people are hating on this game with all the glitches, bugs, aimbots, bloom and various other reasons. I\u0027m no pro at this game, but I\u0027m not giving up on it. However, this game does bring out another side of people and it can be pretty funny. I can\u0027t say this is the best game ever, but I am definitely not going to say this is theI play this game quite often. I completely understand why people are hating on this game with all the glitches, bugs, aimbots, bloom and various other reasons. I\u0027m no pro at this game, but I\u0027m not giving up on it. However, this game does bring out another side of people and it can be pretty funny. I can\u0027t say this is the best game ever, but I am definitely not going to say this is the worst game ever either. Finally, let\u0027s just remember all the cool events that Fortnite has hosted from the crazy plotline of our poor island being torn apart, to Kevin, to Marshmallow all the way to Star Wars. I\u0027m sure there will be more to come too. *Disclaimer: just another random gamer and user writing reviews for games, aka not a developer.… Expand",
    "gameID": 0,
    "author": "glacierskies"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-01-28T00:00:00.000Z",
    "score": 0.0,
    "comments": "Game for homo-sexual kids with down syndrome, abusive parents, no friends and no f*cking life. No balanse, game full of broked mechanics and glitches, cringe as s*it. If you want to play BR then play PUBG/PUBG Lite or Apex Legends. Don\u0027t waste your time on this trash.",
    "gameID": 0,
    "author": "Koderix"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-01T00:00:00.000Z",
    "score": 0.0,
    "comments": "This review contains spoilers, click expand to view. The worst game of all time has finally been made. What a great achievement.… Expand",
    "gameID": 0,
    "author": "PrimeAlphaOne"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-03T00:00:00.000Z",
    "score": 5.0,
    "comments": "Played since prior to Season 2. Great game. Ive really enjoyed playing the game for the most part. I can see how the game would be frustrating for new players as players skill has skyrocketed over recent seasons.",
    "gameID": 0,
    "author": "MKLreviews"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-12T00:00:00.000Z",
    "score": 1.0,
    "comments": "Its utter garbage, thanks to this Epic is now ruining the gaming industry and the fact that this game was so **** before the battle royale hype says something about the devs, they make bad games.",
    "gameID": 0,
    "author": "PanMrkvicka"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-16T00:00:00.000Z",
    "score": 0.0,
    "comments": "this game is utter **** The devs and the 10 year old community destroyed what once was a good, unique game.",
    "gameID": 0,
    "author": "makropod"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "best anti pregnancy ever made also don\u0027t believe me try it for yourself try to get someone pregnant when you play fortnite",
    "gameID": 0,
    "author": "joemamawoodbake"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-23T00:00:00.000Z",
    "score": 0.0,
    "comments": "Fortnite would be very much better if it would not be only building. At the moment if you can just build you are gueranteed to win and a shooter should not be like this",
    "gameID": 0,
    "author": "lonelywolf17"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-25T00:00:00.000Z",
    "score": 2.0,
    "comments": "This game is so overrated that its insane. 95% of people on there are kids, the game-play gets repetitive, you have to pay for 99% of stuff and its just mediocre. I would have given it a 4-5 if it wasn\u0027t so praised. The only time you can have even a little bit of fun with this game is if you play it with friends.",
    "gameID": 0,
    "author": "SLTYSPTOON"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-26T00:00:00.000Z",
    "score": 0.0,
    "comments": "Why are so many people playing this buggy piece of crap? It was a horrible experience trying it out.",
    "gameID": 0,
    "author": "Wiebe"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-26T00:00:00.000Z",
    "score": 0.0,
    "comments": "Pula pula parede pula pula pula pula parede parede parede pula pula pula mata pula pula parede parede morre, fim",
    "gameID": 0,
    "author": "Gamedude051"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-03T00:00:00.000Z",
    "score": 0.0,
    "comments": "Was fun in the beginning but it turned into a building spam **** game and sweaty tryhards each game even on unranked and on first divisions. After playing 1 or 2 rounds I\u0027m done with it, repetetive unfun game, where shooting means nothing ans is unconsistent. The amount of bloom is massive so that the builders have more chance to win their boring building game. People are likely to sellWas fun in the beginning but it turned into a building spam **** game and sweaty tryhards each game even on unranked and on first divisions. After playing 1 or 2 rounds I\u0027m done with it, repetetive unfun game, where shooting means nothing ans is unconsistent. The amount of bloom is massive so that the builders have more chance to win their boring building game. People are likely to sell their family for a victory royale. Would rate 6 or 7 if it was for the first seasons but now I\u0027m giving a solid 0.… Expand",
    "gameID": 0,
    "author": "Tk4Bullet"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-03T00:00:00.000Z",
    "score": 0.0,
    "comments": "The worst game ever made! Ugly, annoying, not fun and stupid. This game sucks. I played it and it was the worst moment of my life.",
    "gameID": 0,
    "author": "Kacak321"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-04T00:00:00.000Z",
    "score": 0.0,
    "comments": "This game is trash, and I think that only noobs play it. Even Ball 3D is better than this scheize",
    "gameID": 0,
    "author": "lego_mannen"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-17T00:00:00.000Z",
    "score": 0.0,
    "comments": "This game is just for people under 10 years. A real gamer won´t have fun with that, better buy Playerunknown´s Battlegrounds!",
    "gameID": 0,
    "author": "DURCHLAUCHT"
  }
]