[
  {
    "helpfulCount": 15,
    "helpfulScore": 8,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "You like SimCity4? Time to get a New game, because this one is the \"next\" game the gamers wanted! Buy it! And enjoy! I was wanting for this game since they announced it!",
    "gameID": 0,
    "author": "correiajoao"
  },
  {
    "helpfulCount": 18,
    "helpfulScore": 12,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "TL; DR version: Cities Skylines is the best city builder game ever made since Sim City 4. It is everything a great city builder game is supposed to be: broad, realistic, detailed, complicated, fun. It is a definite must have for anyone who likes building things. Long version: With the catastrophic release of Sim City 5 in 2013, I have felt being left alone, betrayed, frustrated.TL; DR version: Cities Skylines is the best city builder game ever made since Sim City 4. It is everything a great city builder game is supposed to be: broad, realistic, detailed, complicated, fun. It is a definite must have for anyone who likes building things. Long version: With the catastrophic release of Sim City 5 in 2013, I have felt being left alone, betrayed, frustrated. Maxis and EA destroyed the Sim City licence, and got all the panning it deserved. Other developpers tried to fill the void, but without achieving greatness. Now meet Cities: Skylines. From a graphic point of view, this title has a real appeal. It looks like a toyesque feeling about buildings, vehicles and people. Some may dislike it, I personnaly love it. Speaking about lenght, Cities Skylines is a City builder. You can actually build BIG cities. Not towns. You start with a small area, but you can extend to other land tiles as your city grows. Up to 9 2*2km tiles, creating cities up to 1\u0027000\u0027000 inhabitants. Yeah, that big. What about the simulation side. Well, in the contrary wih Sim City, the RCI system does work, as in you actually need all of them to make your city work. You have to balance, and can\u0027t just build parks to make your citizens happy. Water, energy, crimes, health, education, amusement, everything is covered, and feels realistic. Complicated, this game can be. Especially when it comes to traffic management. And it is difficult to have your goods and people flow in a packed city center. Much like in any real big city around the world. But you are not without tools to achieve it. Roundabouts, highways, metros, train, buses, you can basically use everything you can to make it happen. I could go on for hours talking about all the good things, I\u0027ll just list some cherries on the cake: areas management, policies, and mods. Yes, real, free, endless mods. Not lousy DLCs. Is the game perfect? No, it\u0027s not. It lacks some endgame challenge (money is really easy to come by) and randomness events (climate calamities for example) to make it the best game ever. But for now, it\u0027s a deserved 10. Go get it.… ",
    "gameID": 0,
    "author": "citizen-ychoux"
  },
  {
    "helpfulCount": 15,
    "helpfulScore": 10,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is simply wonderful in every aspect! There are some features such as day/night cycles that people complain about, but they\u0027ll probably be added by mods. The core game is well furnished and I encountered very few, if none, bugs. Overall, the dev team has finally made a way for me to stop playing SimCity 4!",
    "gameID": 0,
    "author": "justinxfan"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 6,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "It lets people make custom building and MODS! Way more freedom than the other city games before. Basically this reminds me of the way PC games used to be... where they cared about the consumers and made sure to provide fun.",
    "gameID": 0,
    "author": "jakiegame"
  },
  {
    "helpfulCount": 37,
    "helpfulScore": 31,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Cities: Skylines, everything that SimCity should have been. Maximum Buildable Map Size: 36km² - 100km² (Mod): ✓ Full Modding Support: ✓ Map Editor: ✓ Asset Editor: ✓ Steam Workshop Integration: ✓ District \u0026 Policies: ✓ Offline Mode: ✓ Real Population: ✓ 1,000,000 Agents: ✓ Working Traffic System: ✓ Power Lines \u0026 Water Pipes (SimCity 4 Style): ✓ Hydroelectric Power (Damns):Cities: Skylines, everything that SimCity should have been. Maximum Buildable Map Size: 36km² - 100km² (Mod): ✓ Full Modding Support: ✓ Map Editor: ✓ Asset Editor: ✓ Steam Workshop Integration: ✓ District \u0026 Policies: ✓ Offline Mode: ✓ Real Population: ✓ 1,000,000 Agents: ✓ Working Traffic System: ✓ Power Lines \u0026 Water Pipes (SimCity 4 Style): ✓ Hydroelectric Power (Damns): ✓ Tsunami: ✓ Natural Resources: ✓ 64-bit Game: ✓ OS - Linux, Windows, OS X: ✓ Under $30: ✓… ",
    "gameID": 0,
    "author": "andygoyap"
  },
  {
    "helpfulCount": 34,
    "helpfulScore": 28,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "I can finally say that we no longer need to play SimCity 4 The 5 things where this game is outstanding: 1.- The size 2.- Full mod support, there are already hundreds of mods in the workshop. 3.- An in-game asset editor to build custom parks, buildings, etc. 4.- A World editor where importing the geography of real cities is very easy, or just build a volcanic island. 5.- TheI can finally say that we no longer need to play SimCity 4 The 5 things where this game is outstanding: 1.- The size 2.- Full mod support, there are already hundreds of mods in the workshop. 3.- An in-game asset editor to build custom parks, buildings, etc. 4.- A World editor where importing the geography of real cities is very easy, or just build a volcanic island. 5.- The transportation, both advanced roads, and mass transit like subways, buses, trains, ships, airports etc.… ",
    "gameID": 0,
    "author": "ErwinRuggy"
  },
  {
    "helpfulCount": 17,
    "helpfulScore": 10,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Betten than Simcity 2013, mods day one, is beautiful and nice experience. But i want day/night cycle. Good job Colossal Order and Paradox. I will spend hours and hours.",
    "gameID": 0,
    "author": "Hailong"
  },
  {
    "helpfulCount": 26,
    "helpfulScore": 20,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Really a great game, everything we have hoped for since SimCity 4. A shame that it took that many years to have a game resembling the good old city builder times.",
    "gameID": 0,
    "author": "Lyrande"
  },
  {
    "helpfulCount": 91,
    "helpfulScore": 74,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Truly beautiful game and an experience that is fully appreciated from my point of view. The next Sim City 4 deluxemade by Paradox. Thank you, I am sincerely grateful!",
    "gameID": 0,
    "author": "Guardian1996"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 6,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "After 10 years of waiting for a good city builder, it has finally come. And it\u0027s only $30. All I can say is buy it. I\u0027ve been playing for 12 hours straight now, and I just can\u0027t stop. It\u0027s my new drug. Care to do some Cities: Skylines with me?",
    "gameID": 0,
    "author": "ChampionH"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 9.0,
    "comments": "Solid city builder which SimCity 4 should have been. Pros: - able to play on launch date - big cities - full mod support (hey, even more size cities !) - editor - working simulation model - tons of options how to play - price - offline game Cons: - traffic simulation model should get patched ... it\u0027s not at 100% when you have three lanes road .... still miles ahead ofSolid city builder which SimCity 4 should have been. Pros: - able to play on launch date - big cities - full mod support (hey, even more size cities !) - editor - working simulation model - tons of options how to play - price - offline game Cons: - traffic simulation model should get patched ... it\u0027s not at 100% when you have three lanes road .... still miles ahead of SimCity 4 - road building tool should get improved, but options are still pretty great at the moment - i would like to see coop multiplayer (2 players playing 1 city) Conclusion: - great game for a great price. If you like to build then get it ...… ",
    "gameID": 0,
    "author": "Valkyan"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 6,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Wow. This game is beyond great. The attention to detail is astounding. Example? If you place a sewer line on a street, a manhole cover appears. Streets that don\u0027t have a sewer line don\u0027t get manhole covers. Game progression feels natural and unforced, you won\u0027t be spinning your wheels waiting for something to happen. Given that there are provided mods to enable a full sandbox, it\u0027s aWow. This game is beyond great. The attention to detail is astounding. Example? If you place a sewer line on a street, a manhole cover appears. Streets that don\u0027t have a sewer line don\u0027t get manhole covers. Game progression feels natural and unforced, you won\u0027t be spinning your wheels waiting for something to happen. Given that there are provided mods to enable a full sandbox, it\u0027s a done deal. I\u0027m a veteran of the sim game, and this game doesn\u0027t feel crippled in anyway to me. I can look at pretty graphs and statistics. I can do whatever the hell I want. Yet, it also looks to be pretty accessible to the beginner and doesn\u0027t overwhelm them. I have NO idea how they managed to strike the perfect balance between myself and the newbie, but they did. There are very few bugs -- that\u0027s saying something since as of the time of this writing, it\u0027s day 1 of release. This is a good thing, because I played for five hours without realizing that I hadn\u0027t saved yet. No crashes -- and I\u0027m on linux so their QA did their job really really well. The developer is going to add in some DLC, the game already feels \"complete\" and there is more than enough content to keep you occupied. I actually look forward to the next DLC to see what they add. EA can forcibly insert **** up their rectum. This game is the true successor of the franchise.… ",
    "gameID": 0,
    "author": "neekz0r"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "By far the best city builder which has ever been made. Some really nice new features such as districts, water physics and pedestrian paths make this a modern game but with a classic feel. Traffic and transport is beautifully implemented too. It\u0027s so fun following your people and watching as they live their lives in your city.",
    "gameID": 0,
    "author": "sumodaz"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 8,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "You can tell when a game is created by passionate artists and developers. This could be the SimCity 4 successor that we have been waiting all these years for. Everything that SC2k13 did wrong, Colossal Order tried to make right. City sizes are 9x bigger, and easily modded to 25x bigger than SC2k13. They didn\u0027t only make things better, they also introduced many new features such asYou can tell when a game is created by passionate artists and developers. This could be the SimCity 4 successor that we have been waiting all these years for. Everything that SC2k13 did wrong, Colossal Order tried to make right. City sizes are 9x bigger, and easily modded to 25x bigger than SC2k13. They didn\u0027t only make things better, they also introduced many new features such as districts, specialized industrial zones and dynamic water movement. Modding support is also a huge feature that is offered. The Steam Workshop has over 1000 mods, models and maps already online less than 24 hours after the release. There are a handful of requests for features that didn\u0027t make it to release, but the devs promised that they would continue working on this game to include as many new features as possible. (Such as road \u0026 highway tunnels, disasters and day/night cycles). This is only the first day of the launch, and the game is already extremely stable, and looks beautiful. I look forward to seeing what the devs and the mod community comes up with in the future! This game was created by a small indie development team and look at what they produced. I highly recommend this game to anyone who felt disappointed with SimCity and wants to play a genuine city simulator that has the fun of previous versions, but the new features that modern gamers want to play.… ",
    "gameID": 0,
    "author": "MysticMTL"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "The creators of SimCity can learn a lot from Cities: Skylines. A well deserved, highly recommended, highly rated city building simulation game. A transport system that actually works, people take the fastest road towards their destination (unlike SimCity 2013!), bigger maps that make you feel like you\u0027re creating an actual city, purchase additional city plots next to your own city and ohThe creators of SimCity can learn a lot from Cities: Skylines. A well deserved, highly recommended, highly rated city building simulation game. A transport system that actually works, people take the fastest road towards their destination (unlike SimCity 2013!), bigger maps that make you feel like you\u0027re creating an actual city, purchase additional city plots next to your own city and oh so much more. You can even save your game within the steam cloud. How awesome is that? Plus! You don\u0027t need to be online all the time to play the game. If you\u0027ve read my review this far and still have doubts, check out Skye Storm\u0027s YouTube channel for excellent gameplay videos.… ",
    "gameID": 0,
    "author": "Hestia23"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 2,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "It does exactly what it says on the tin. Fluid, very addictive. A lot to do and challenges but achievable. That exactly what I was waiting for and expecting as a successor of simcity 4.",
    "gameID": 0,
    "author": "AbsoluFab"
  },
  {
    "helpfulCount": 14,
    "helpfulScore": 9,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "By Far the best modern day city builder on the Market. This is what SC 2013 should have been, or wished it was. Great game and it is recommended to any people that like city builders",
    "gameID": 0,
    "author": "napalm"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 4,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Its 3:30AM and I don\u0027t know where the hours since 7PM have gone, I\u0027d still be playing until the morning if I hadn\u0027t forced myself to save and quit. This game is fantastic, every bit as good as SimCity 4 but more polished. It took me about 30-60 minutes to get used to the interface and since then it has been a joy to play. I\u0027m still just getting started, my little town has grown to aIts 3:30AM and I don\u0027t know where the hours since 7PM have gone, I\u0027d still be playing until the morning if I hadn\u0027t forced myself to save and quit. This game is fantastic, every bit as good as SimCity 4 but more polished. It took me about 30-60 minutes to get used to the interface and since then it has been a joy to play. I\u0027m still just getting started, my little town has grown to a huge city and I\u0027ve only just filled 1 2km square, I\u0027ve just scratched the surface so far and haven\u0027t even looked at the huge number of mods available on Steam Workshop. The developers have done a great job with this game and I only paid £14.99 for it which IMO is an absolute bargain. If you like city building sims you will love this game, I highly recommend it.… ",
    "gameID": 0,
    "author": "djnicey"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 2,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 8.0,
    "comments": "It\u0027s Simcity, but better, In any aspect. Only problem is that the requirement to play this game and the price of the game. But overall it\u0027s still a great game.",
    "gameID": 0,
    "author": "Matanuva135"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 9.0,
    "comments": "Awesome game! finally we get a working good \"sim city\" style game. the landmass you can build on is huge and they promote eco energy in a good way. the game is truly what most people write here. it\u0027s amazing. there is steam workshop integration that will make this game even more amazing. i am sure there is loads of people out there now making awesome maps to play on, building new housesAwesome game! finally we get a working good \"sim city\" style game. the landmass you can build on is huge and they promote eco energy in a good way. the game is truly what most people write here. it\u0027s amazing. there is steam workshop integration that will make this game even more amazing. i am sure there is loads of people out there now making awesome maps to play on, building new houses and parks, and modding the game (there is already a mod out that enables the use of 25 2km^2 squares instead of the default max of 9! only problem i find is that it\u0027s not always obvious what\u0027s wrong with a city or why something don\u0027t work. also, freeways annoy me as they need to be built in a special way for the road to go the right way! still a great game i will spend many, many hours in! all for 27.99€... its a bargain! Double the game, for half the price!… ",
    "gameID": 0,
    "author": "Nivius"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 7,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Bro: WHAT A GAME Really! It has everything that any city building game should have Fantastic game! Everything works as it should, for real, you should buy this NOW The best game on 2015 so far.",
    "gameID": 0,
    "author": "CriseComics"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 4,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Cities skylines is definetely recommended, even with a few hours of gameplay. It is obvious from the start that its a deep and big game. If you like city builder games you will love this one. During my first 3 hours of the game i didnt even manage to fill one tile of land. Anyone who has played SimSh!tty 2013 will know what i mean. Buy the game now and support the devs for the good work!",
    "gameID": 0,
    "author": "thewizardmac"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 4,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is what SimCity should have been before EA turned it into a steaming pile of sh*t. Cities is just a better game. Buy it already, you will not regret it.",
    "gameID": 0,
    "author": "ND3G"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 6,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Compared to Simcity this is legendary. I\u0027m giving this a 10 user score simply because of the fact that this is how corporations SHOULD make games. 1) Perfectly prized 2) Awesome customer feedback + Even a personal twitch stream to promote the game 3) Day 1 DLC isn\u0027t anything important at all or holding the game back. 4) ??? 5) PROFIT",
    "gameID": 0,
    "author": "Tinnesa"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 3,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Every aspect of this game blows SimCity out of the water. A new standard for city builders. With great modding support, great optimization, and a plethora of features, Skylines is the best city builder released since SimCity 4.",
    "gameID": 0,
    "author": "khamul787"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 8,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Absolute win. After gamers taking the one-two sucker punch of Simcity and then Cities XXL to the jaw FINALLY a real city builder emerges again. Smooth, responsive, full featured, modable, large maps and it WORKS. It works on day one. That, in my book is what we\u0027ve been waiting for and deserve.",
    "gameID": 0,
    "author": "Spaceweird"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 5,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Hate SimCity 2013? You\u0027ll love Cities: Skylines. Love SimCity 2013? You\u0027ll love Cities: Skylines a lot better. Lots to do and so much potential for future development like mods and DLC. There\u0027s a learning curve so don\u0027t expect things to work just because it worked in SimCtiy. You need a decent spec laptop or desktop to fully enjoy the game.",
    "gameID": 0,
    "author": "scrap104"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 5,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Had to leave a review for this one. Paradox did an amazing job. I\u0027ve been playing off and on all day and it really has that classic SimCity feel. This is the TRUE spiritual successor to SimCity 3000 and SimCity 4, hands down.",
    "gameID": 0,
    "author": "fingfrenchy"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 5,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "I hate to do the obvious comparison here but Cities: Skylines is everything SimCity 2013 wasn\u0027t, it\u0027s just so much more! Thank you good sirs and madams at Colossal Order and Paradox Interactive, this is how you do a game release!",
    "gameID": 0,
    "author": "shelter"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 4,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Well what can I say, Colossal Order have done what EA could never do, they have returned the \"true\" city builder to the fans. The Features, Graphics, Playability and, Smoothness along with the modders tools make this the best out of them all. :)",
    "gameID": 0,
    "author": "NZ_Simplicity"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 3,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "The king is dead, long live the king! You will not be disappointed with your purchase of this game. If you\u0027re on the fence about buying this or not, pull the trigger. It delivers the city building experience I\u0027ve imagined since since SimCity 4. Very nicely done. Honest thanks to the Dev team for making such a wonderful experience. I\u0027m excited to see where the community takes this gameThe king is dead, long live the king! You will not be disappointed with your purchase of this game. If you\u0027re on the fence about buying this or not, pull the trigger. It delivers the city building experience I\u0027ve imagined since since SimCity 4. Very nicely done. Honest thanks to the Dev team for making such a wonderful experience. I\u0027m excited to see where the community takes this game with SteamWorkshop support. 29 USD is an amazing value for the product you\u0027re getting.… ",
    "gameID": 0,
    "author": "NewSlang"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 3,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Finally, the true successor to Sim City 4 is here. Ready to play, ready to mod, ready to love. We need wait no longer. This is it. This is the one. Enjoy.",
    "gameID": 0,
    "author": "varietygamer"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 8,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Cities Skylines takes the best things from SimCity, improves them and adds some really good new features. Releating to the improvement (as an example): Although you start with a 2km x 2km field you can buy during the game 9 more pieces. So at the end you have a really huge city. Just beautiful ;)",
    "gameID": 0,
    "author": "ScorpiaBoost"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 3,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Everything SimCity should\u0027ve and could\u0027ve been. Absolutely nothing bad to say about it. Very in depth, massive cities, traffic is a and looks great...",
    "gameID": 0,
    "author": "SirVault"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 8,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Sim city is dead, long live Cities skylines ! What SimCity should have been but never was. Excellent game! The developers has listened to the community.",
    "gameID": 0,
    "author": "trimitri"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 5,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "this city builder is colossal you can plant trees, a lot of trees you can releax and enjoy the view from small city to very large one from small area to very big one mods (assets, maps etc...), check graphic, check performence, check price, check 10/10",
    "gameID": 0,
    "author": "BalzakMorgan"
  },
  {
    "helpfulCount": 23,
    "helpfulScore": 18,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 9.0,
    "comments": "After 2013’s debacle that was Sim City it was time some new devs stepped to the table. Cities XXL was a huge miss as Focus Interactive did nothing to improve their terrible running and clunky game so the question is, did Colossal Order (a Paradox dev responsible for Cities in Motion) deliver? Yes, oh my god Yes! Cities Skylines is another game in the long list of city building andAfter 2013’s debacle that was Sim City it was time some new devs stepped to the table. Cities XXL was a huge miss as Focus Interactive did nothing to improve their terrible running and clunky game so the question is, did Colossal Order (a Paradox dev responsible for Cities in Motion) deliver? Yes, oh my god Yes! Cities Skylines is another game in the long list of city building and managing simulators that have been trying to succeed in the shoes of what was Sim City 4; released more than 12 years ago. From the dev that created Cities in Motion, Colossal Order does something that no other city sim has done and make a truly great game that brings back the feel of Sim City 4 and my favorite of the series, Sim City 3000. They brought it back to its basics which included zones, different building types like electrical, water, fire, police, medical, fun and even the unique landmark buildings. When you start creating your city you start in a small 2km x 2km square that can expand as your city gets bigger and you annex other areas to a possible 25 tile, 100km2 area (with the support of a mod that is already in the steam workshop). The game also locks different building, zones, etc. behind population goals so that it isn’t too overwhelming however there are mods that allow you to unlock everything to start if you wish along with unlimited money. The game will also allow for steam workshop when it releases for people to create their own user content to add to the game which could include more buildings, new modes, user made cities and much more. Along with the buildings and zones there are also the financial and policies that make a city sim a true city sim. They are simple enough and not as annoying as was the advisors in sim city 3000 but they change things greatly including outlawing private traffic in certain zones forcing people to take mass transit instead. What those policies and other specific buildings do is increase the happiness of the people in the commercial, residential and industrial zones. As your happiness increases they are more likely to accept higher taxes and recommend more people to move in causing an increase in desire for residential and other financial zones. I can also say that Colossal Order certainly know how to make their transport lines work and work well because every form of transportation was easy to create and maintain. That being said the roads themselves were difficult to make sure they were right especially having off ramps connect to highways. When I bought my first annex there was a highway running through it. I thought it would have been easy enough to figure out how to implement a overpass/rounded off ramp to have access to the other side of the highway however I had to do a lot of work to get a new one working. First I had to delete the existing off ramps and highway to make way for a 4 way off ramp. On top of that in order to make sure a one way road/highway continues to go one way, instead of detecting which way automatically the roads go you to build the road in the same direction traffic would flow. Took me about 15 minutes to realize this. Hopefully it’ll be something they patch after release because I can imagine it’ll be something some people will complain about. One other complaint, and maybe it is something I’m not used to due to the simplicity of zones in Sim City 3000, I don’t like the way zones sit for “squares” off the road for each road you make. I’m more of a fan of dragging and dropping to make a zone like it was in SC 3000. That is just a personal preference. However all you can do with the roads is quite impressive and though I did play this game quite a bit I wasn’t able to play it enough to truly design a city that looked great. Now this game looks quite impressive and the buildings are quite varied enough to make the cities and areas look unique. Mod support and steam workshop is only going to improve the variety of buildings after release. The engine runs smooth, however capped at 60 fps (not that you really need more since this isn’t a action moving game), and looks great. The UI is clean and they actually made a change to it as I was playing my review copy in the last week. The sound isn’t anything spectacular, however it is there and does work well with what the game is. If you zoom in to roads you can hear cars going by, if you do the same for various areas you hear what you would expect to hear if you were walking on the street. The ambient music also makes it nice to listen to while you are designing away. So nothing over the top but fits quite well. Overall, Cities Skylines, I feel, is truly the best city sim game since Sim City 4 and in fact is better than 4. It has everything that you could want in a city building game; large building areas, variety in design and buildings, unique challenges in building and managing and a great looking engine.… ",
    "gameID": 0,
    "author": "frlncr799"
  },
  {
    "helpfulCount": 27,
    "helpfulScore": 19,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 9.0,
    "comments": "I want to congratulate the Dev team on bringing back the city building experience. After the blunder that was Sim City, Cities in motion is exactly what we all wanted from Sim City in the first place. Losing 1 point due to no Multi-Player.",
    "gameID": 0,
    "author": "FurballHer0"
  },
  {
    "helpfulCount": 16,
    "helpfulScore": 11,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is just everything you would want for a city-building game. Full modding support and already a thriving modding community even though the game just got released. I just have no words, this truly feels like a spiritual successor of Sim City 4. Good job Colossal Order and Paradox!",
    "gameID": 0,
    "author": "dadum"
  },
  {
    "helpfulCount": 18,
    "helpfulScore": 12,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is what Sim City was supposed to be. The game is beautiful, runs smooth, and is easy to mod. Sim City 4 can finally be retired after 12 years of loyal service, it\u0027s successor is here.",
    "gameID": 0,
    "author": "Mistafreeze3"
  },
  {
    "helpfulCount": 23,
    "helpfulScore": 17,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "At last a city builder worth my time. Cityskylines has a huge amount to offer in creativity, simulation and scale. With details ranging from individual citizens walking their dog as part of there persistent simulation all the way up to gigantic traffic systems and death epidemics. There may be some rough edges (if you go looking) or certain elements some may dislike, But the best thingAt last a city builder worth my time. Cityskylines has a huge amount to offer in creativity, simulation and scale. With details ranging from individual citizens walking their dog as part of there persistent simulation all the way up to gigantic traffic systems and death epidemics. There may be some rough edges (if you go looking) or certain elements some may dislike, But the best thing this game offers has the potential to resolve all issues.. It has been built to support Mods! Mods give a game the potential to not only fix or tailor elements of the game to the players liking but can also provide more content! I am yet to see the scope available in terms of how deep mods can go but the fact that certain options like \u0027unlimited money\u0027 and \u0027all unlock\u0027s are included as packed in mods, it certainly seems like modding has been on the developers mind for quite some time.… ",
    "gameID": 0,
    "author": "Nadz_"
  },
  {
    "helpfulCount": 36,
    "helpfulScore": 29,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "What SimCity should have been but never was. This game is much better than SimCity, with more features. I spent hours playing on this and never got bored, and the best part is it\u0027s only $30 at launch. This could have been easily $70 game like simcity because this game is more polished, less buggy, full mod support, and most importantly so much fun!",
    "gameID": 0,
    "author": "alanjuio"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 6,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Excellent game! The developers has listened to the community on every front and has delivered a game that is incredibly hard to imagine only 9 people worked on, astonishing success!",
    "gameID": 0,
    "author": "OfekA"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 7,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Ever since simcity-4, city simulation has become more a hobby for me than just occasional game play. Over the years I have created many custom buildings (mainly Paris and medieval themes) and mods (amongst other the Jupiter (weather) and the Aurora mods) for simcity-4. Simcity 2013 was a major disappointment on all accounts. I have been fortunate to have been invited to test CitiesEver since simcity-4, city simulation has become more a hobby for me than just occasional game play. Over the years I have created many custom buildings (mainly Paris and medieval themes) and mods (amongst other the Jupiter (weather) and the Aurora mods) for simcity-4. Simcity 2013 was a major disappointment on all accounts. I have been fortunate to have been invited to test Cities Skylines\u0027 modding tools during the beta phase for the past couple of months. And during that time I have also been able to play the game. Cities Skylines exceeds my expectations. The potential that can be unlocked by the community and by DLCs provided by CO is unbelievable. I am absolutely overwhelmed by how great this game is. Additionally, I have gained the utmost respect for CO. It is unbelievable what a small team of creative people can do. Aside from developing a fantastic game, CO actually listens to the community to the best of their abilities. Bound by an NDA, it has been challenging for me not being able to respond to all the comments, questions, critisicm, (sometimes unjust) speculation on the forums. And I kept thinking if only you could get to play the game for half an hour and - like me - become captivated by studying the little CIMS in their daily routine, or laying out the most amazing road interchanges. Finally a game I can enjoy again without having to shoot someone. Off course some I do share some of the criticism that also has been shared on the forums. I could even create a list of a dozen or more features that I would like to see changed or improved. But all that is driven by my enthusiasm for this game, and there is a time a place for everything. So for now I am just giving this game a 10/10.… ",
    "gameID": 0,
    "author": "xannepan"
  },
  {
    "helpfulCount": 19,
    "helpfulScore": 9,
    "date": "2015-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Finally...the game that Sim City should be. Well done Paradox! No need for a new Sim City anymore since vulture EA just closed Maxis anyway. Now I just need more time",
    "gameID": 0,
    "author": "kraenk"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 9.0,
    "comments": "This is the first time that ive enjoyed a game so much that i\u0027ve felt compelled to sign up and post a review. Firstly the games runs great and very smooth, the attention to detail is astounding and the game play mechanics are great, there is the odd bug which i\u0027m sure CO will iron out. in time. The real draw card i feel is the modding capabilities of the game, this game will endure forThis is the first time that ive enjoyed a game so much that i\u0027ve felt compelled to sign up and post a review. Firstly the games runs great and very smooth, the attention to detail is astounding and the game play mechanics are great, there is the odd bug which i\u0027m sure CO will iron out. in time. The real draw card i feel is the modding capabilities of the game, this game will endure for years to come. Great job CO \u0026 Paradox!!… ",
    "gameID": 0,
    "author": "dadoitz"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "An amazing entry into an emaciated genre. I can\u0027t remember the last time I spent an 8 hour sitting in a city building game, nevertheless making a review for one. Excellent launch product along with much more to come thanks to modding and long term dev support. Even more amazing than the game is that it was created by a team of 13 people! Congrats go out to everyone at Colossal Order.An amazing entry into an emaciated genre. I can\u0027t remember the last time I spent an 8 hour sitting in a city building game, nevertheless making a review for one. Excellent launch product along with much more to come thanks to modding and long term dev support. Even more amazing than the game is that it was created by a team of 13 people! Congrats go out to everyone at Colossal Order. Ridiculous and inspiring that they pulled off what a giant and over budget (also dead as of a couple of days ago...rip Maxis) team at EA could not.… ",
    "gameID": 0,
    "author": "noobratingames"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "its very hard to review this game without mentioning \u0027SimCity\u0027. So, how do you make a perfect city building game ? just copy SimCity but listen to community. (the actual community , not the \"community\" EA keeps talking about) . Cities : Skylines delivers just that , even with some improvement !. - Integration with Steam Workshop - Massive playable land size , - Amazing terrain editorits very hard to review this game without mentioning \u0027SimCity\u0027. So, how do you make a perfect city building game ? just copy SimCity but listen to community. (the actual community , not the \"community\" EA keeps talking about) . Cities : Skylines delivers just that , even with some improvement !. - Integration with Steam Workshop - Massive playable land size , - Amazing terrain editor - Stunning water simulation (seriously , try the water sim by building a massive dam on a river with strong current) The game is not without any flaw(s) though. But most of the flaws are pretty minor. Here\u0027s some : - Pixely-ish texture for the assets (probably to keep the game run smoothly on lower end pc ) - Not enough variation (same building everywhere) , but there will be DLC and Steam workshop (There\u0027s already some assets in the workshop) - Lack of Information (The building are just abandoned , but WHY ??!?!? ) - Twitter-Like feature with right-on-your-face positioning and repetitive text. well with all those minor issues , the game is still an amazing piece of city building game .... What are you waiting for ?!? go out there and throw your money at the developer ....… ",
    "gameID": 0,
    "author": "nonotz"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 9.0,
    "comments": "This is the quintessential city builder and the most incredible addition to the simulator genre since my childhood days of \"reticulating splines...\" It\u0027s no secret that the more recent installations from Maxis were underwhelming at best. Paradox has more than delivered with this gem. I found it to be extremely intuitive, immediately captivating, and regrettably addictive. You need to paceThis is the quintessential city builder and the most incredible addition to the simulator genre since my childhood days of \"reticulating splines...\" It\u0027s no secret that the more recent installations from Maxis were underwhelming at best. Paradox has more than delivered with this gem. I found it to be extremely intuitive, immediately captivating, and regrettably addictive. You need to pace yourself with this puppy because it is easy to lose hours of your life building up the next metropolis. My only slight peeve, and the reason this fell short of a perfect 10, is that the population requirements for some features seem a bit egregious. Certain, shall we say, basic necessities are withheld in the beginning of the game and an unseasoned player can get the feeling that it takes FOREVER to obtain solutions for issues that can become problematic very quickly.… ",
    "gameID": 0,
    "author": "FogCityRoller"
  },
  {
    "helpfulCount": 19,
    "helpfulScore": 9,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 7.0,
    "comments": "Game is good. Good but not great or perfect, obviously. First of all - this is really one of the few games for the last days, which started and worked \"from the box\". No massive critical errors, crashes and bugs. Game was finished, polished and released in good condition. This game don\u0027t ask us to be a beta testers for our own money. THIS - is nice rare exception in game developmentGame is good. Good but not great or perfect, obviously. First of all - this is really one of the few games for the last days, which started and worked \"from the box\". No massive critical errors, crashes and bugs. Game was finished, polished and released in good condition. This game don\u0027t ask us to be a beta testers for our own money. THIS - is nice rare exception in game development nowdays. I will not tell you much about \"how good it is\" - you can see all info about the game in pre-release trailers and notes. I just would say that this game considered many mistakes of last SimCity. Added many new interesting features and micromanagement abilities. But... Some things I don\u0027t like: - game is VERY easy. You can set the city fast and leave it for an hour. When you come back - it will still leave and bring money. Fire, diseases, criminal and other stuff - will not bring it down. Game don\u0027t bring any challenge. - it is unbalanced : little city will ask for big number of firestations (big and small), but it will be enough to set just 1-2 little hospitals and just even 1 police station. - pollutiondon\u0027t bring any problems. When there is a factory or trash dump on the land - it has local pollution, not spreading by the wind or any other way. If you remove this building - land becomes clean as heaven\u0027s garden in a moment. - there is no wind direction. You can set factory anywhere you want - polution over the wind doesn\u0027t matter. - there is no any option to set a grid on the land - for planning roads and city. - Setting road bends is very low controlled. Easy on small distances, but very problematic on big distances.( setting grid on the land could give some help with that - but there is no such option, as I already said) - (!!!) there are one-direction roads to set, but no exit and entrance ramps. This is most thing I don\u0027t like. If I try to connect one-way directed road like an exit or entrance ramp - it becomes to be an intersection with traffic lights. So it creates traffic jams, while rams was seted to avoid it. - 1 bus station can work only on 1 route. For any new route you will need new bus station \u003d LOL - there is no such depth in trading, resource gaining, producing comparing to SimCIty. Well, there are many other such small (or big) things I don\u0027t like about this game. Game fixed, added and expanded many features from SimCity, but also ignored many other good features from it. So: release with no critical bugs and crashes - 10/10 no freezes, stable - 10/10 graphics and picture - 7/10 music - 6/10 unbalanced and too easy, brings no challenge - 5/10 ------------- My overall score - 7/10 I hope developers will fix balance and add more depth in game. Will see. Have a good game!… ",
    "gameID": 0,
    "author": "LastMammoth"
  },
  {
    "helpfulCount": 22,
    "helpfulScore": 13,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 7.0,
    "comments": "An enjoyable game but a little too simple. Works well but even as a beginner it only takes a few hours to get your city to be moving a long at a sustainable rate where you have more money than you can spend and just end up constantly expanding with out hitting any real challenges besides putting in better roads. Needs more in the form of disasters or tougher management of things likeAn enjoyable game but a little too simple. Works well but even as a beginner it only takes a few hours to get your city to be moving a long at a sustainable rate where you have more money than you can spend and just end up constantly expanding with out hitting any real challenges besides putting in better roads. Needs more in the form of disasters or tougher management of things like crime/healthcare/homelessness etc.… ",
    "gameID": 0,
    "author": "pinball123"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 9.0,
    "comments": "Well I being waiting this game since 1 of February, I was reading and looking after everything they upload to the internet, videos everything! I was rely HYPE for this game. Since the 3rd of March I was seeing day after day streamers playing this game I couldn\u0027t wait to play it! And yeah the game is awesome, some mistakes from the traffic AI and missing something’s they promised to putWell I being waiting this game since 1 of February, I was reading and looking after everything they upload to the internet, videos everything! I was rely HYPE for this game. Since the 3rd of March I was seeing day after day streamers playing this game I couldn\u0027t wait to play it! And yeah the game is awesome, some mistakes from the traffic AI and missing something’s they promised to put in time. (Like tunnels) I feel the game have a lot of potential, is rely good at this point! But is missing something, like missions and the feeling that you can specialize your city, like a gamble city or a tourism city. Traffic is like the most important thing to figure out; well they are the Dev of cities in motion... but please fix the AI problem fast! Missing also way to destroy your city. And weather. But in general 9/10 The Steam work shop is the best idea of this game!… ",
    "gameID": 0,
    "author": "juaner"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is pretty much everything I wanted in a City building game. It has delivered in all the places where EA\u0027s latest simcity failed for the love of gaben, do not get this confused with the poor Cities XL games. If you were a fan of the classic Simcity 4, this will not disappoint you. highly recommend it",
    "gameID": 0,
    "author": "jedish3ep"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 5,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "I usually don\u0027t get mad easily - but upon reading the (fortunately few) negative reviews of this game I personally got worked up. There is obviously some room for interpretation in a game, but to give a 1/10 or even a 2/10 to a game that is obviously the best in its genre is (regardless of whether you like it) quite simply a sign that you\u0027re mentally challenged. Stay tuned for anI usually don\u0027t get mad easily - but upon reading the (fortunately few) negative reviews of this game I personally got worked up. There is obviously some room for interpretation in a game, but to give a 1/10 or even a 2/10 to a game that is obviously the best in its genre is (regardless of whether you like it) quite simply a sign that you\u0027re mentally challenged. Stay tuned for an explanation of my stance - If you like city builders, chances are you played SC4 - this game has been the go-to game for city building enthusiasts for a little more than a decade. Some people tried to bask in its glory (Cities (X)XL i\u0027m looking at you) and there\u0027s even been a sequel - and we all know how those worked out. Cities Skylines takes all of the great features of SC4, does NOT dumb them down (this is a plus if your IQ is higher than that of a potato) and expands upon them (See traffic, Colossal Order has had lots of practice with traffic-based games and this one delivers too). In my 20 hours of gameplay so far I only noticed ONE bug, there is no always-online DRM **** and the graphics, while outdated, aren\u0027t something that sticks out as a bad thing. With the huge map sizes (up to about 25 times the space you had in SC5), decent amount of features and wonderfully bugfree engine you\u0027ll have lots of fun with this. Anyway, to the low score reviewers: You might not like this game, this is fine - give it a 6 or 7, but if you go ahead and give a 1 or 2 to a game that is clearly the the market leader in its genre you obviously are mentally challenged. As for that matter, I\u0027d even call people stupid who rate the newest instance of Call of Duty 1 or 2 stupid - the publisher might be greedy and the game might be ultimately the same as the last 5, but 1/10 - really? Gain some perspective.… ",
    "gameID": 0,
    "author": "Inq"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 4,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Great game. Keeps all the cool, established features of SimCity series but delivers where Maxis failed, and adds new features like a very cool dynamic water system (I flooded half of my city thanks to a poorly placed hydro plant) and district system, and land purchase system that slaps SimCity\u0027s small maps. Basically you start on a map the size of SimCity map, and then dynamically buyGreat game. Keeps all the cool, established features of SimCity series but delivers where Maxis failed, and adds new features like a very cool dynamic water system (I flooded half of my city thanks to a poorly placed hydro plant) and district system, and land purchase system that slaps SimCity\u0027s small maps. Basically you start on a map the size of SimCity map, and then dynamically buy surrounding areas as your city grows. I bought 8 SimCity sized areas that are integrated into a single map, and I haven\u0027t passed 50 000 residents, so I have no idea how large you can go. The game also has a very cool elevation system for roads and tracks, which means you can twist and turn them on several layers across each other, it\u0027s very cool. Overall, I think this is the best city builder that I have ever played. It\u0027s very well optimized and stable, and for now I feel I actually need help in keeping me away from my computer as I have a tendency to play it for more hours that I probably should, and ignore my commitments...… ",
    "gameID": 0,
    "author": "vunacar"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 3,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 9.0,
    "comments": "I can\u0027t in all fairness give this game a perfect score but it comes close. SimCity2013 wasn\u0027t really even a playable game, I lost interest with SC2k13 in 15 minutes and found the graphics outdated and dull (can\u0027t understand how people thought they were great). Skylines is very very playable so far although there are a few annoyances like clicking the school icon both (a) shows the overlayI can\u0027t in all fairness give this game a perfect score but it comes close. SimCity2013 wasn\u0027t really even a playable game, I lost interest with SC2k13 in 15 minutes and found the graphics outdated and dull (can\u0027t understand how people thought they were great). Skylines is very very playable so far although there are a few annoyances like clicking the school icon both (a) shows the overlay on the map of school coverage, but (b) also picks up a school building as if to build it. So because of (b), I cannot actually click on a school to get info about it in this mode until I back out to regular map viewing mode. Kinda weird. But nothing to get upset about. Graphically, maybe it\u0027s me, but from a sheer \"graphic\" quality standpoint, Cities XL (or that series) is still the best, cleanest, Nicest AA and textures, game of the bunch. That game sucked, but that\u0027s not my point. Graphically, it was the best of these 3 with C:S coming in second. I find the lack of AA (even with it turned on) a bit rough around the edges. Moving around is just not a clean feeling, pixels in the distance flickering around, even at details maxed out. But from a \"scale\" and feeling like you are in fact looking at a big city with big distances, C:S gets the feeling across well. Despite both SC2k13 and this game using 2km grids, maybe it\u0027s the scale of the buildings of something but there is waaaay more space in THIS 2km grid than SimCity. In SC you felt your elbows bumping within 5 or 10 minutes. In This, playing several hours, I\u0027ve yet to feel the need to expand yet beyond the first 2km grid although I do own another 2 to use. If my review sounds like I\u0027m nitpicking, well I am because I\u0027m giving it a 9, closer to 9.5, and basically I think by now everyone knows the good points. The \"bad\" points are few and mostly related to the visual presentation. My system is a desktop i5 with 16Gb of RAM, an Nvidia GTX 750ti, running at 1920x1080 and everything is silky smooth as far as FPS. Even Far Cry 4 with everything on runs like butter on this setup (40-50fps). But unlike FarCry, I think this game will tax both GPU and CPU equally especially more the CPU as the population grows. I can see that a laptop with onboard GPU might not be up to it.… ",
    "gameID": 0,
    "author": "dk3d"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 4,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Do not get confused by the disliking of the other Cities games. This one feels like it is non related to those games. I don\u0027t know how they stepped their game up so fast, but this is the best city builder game out there. Cities XXL was nothing new from the meh Cities XL. Cities Skylines is a massive improvement. It\u0027s the city building game everyone has wanted for years. Sim City 2013Do not get confused by the disliking of the other Cities games. This one feels like it is non related to those games. I don\u0027t know how they stepped their game up so fast, but this is the best city builder game out there. Cities XXL was nothing new from the meh Cities XL. Cities Skylines is a massive improvement. It\u0027s the city building game everyone has wanted for years. Sim City 2013 was a HUGE disappointment and Cities XXL was a money grabber. Cities Skylines is well worth the 30 dollars, even if it was priced at sixty it still is a great deal! This is the best city building game since Simcity 4. There is so much content in this game to keep you busy for a long time. I know people who have put 30 hours into this game and are still playing. Did I mention that it has mod support? There are over a 100 mods on the Steam Workshop already. Cool. You don\u0027t even need mods. I do recommend them though, as they add a lot to this game. The only thing wrong with this game is the tutorials. It doesn\u0027t explain anything very well, but I can\u0027t think of a city builder that does. A few bugs here and there. Nothing major or gamebreaking. Please buy this game and tell Paradox that this is what we expect next time! Do not screw us again with the Cities XXL crap!… ",
    "gameID": 0,
    "author": "dohgeh"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 3,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Finally a game developer who listen to the community. Free and easy modding. Best game of 2015 for me. EA failed with sim city 2013 and destroyed the franchise. Now there is a new city building game thanks to paradox and colossal order.",
    "gameID": 0,
    "author": "RamirezNL"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 4,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "I played this the other day. I have some minor problems with the roads system sometimes not being perfectly straight and causing a decrease in some RCI zoning space, but it\u0027s very minor. For the price, this game is worth it. Bye bye SimCity and EA. I hope the community from SimCity 4 will hop over and here and populate the Steam Workshop.",
    "gameID": 0,
    "author": "EarlGreyDrinker"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "So far it\u0027s good! This game fuses perfectly all the good things of both games, and corrects almost all the wrong things. This game is fully recommended!. Nice work!",
    "gameID": 0,
    "author": "liaoshoubin"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Usually when I see 10s on Metacritic I assume their **** This isn\u0027t **** You can look at my reviews and see I\u0027m harsh on games for the most part. This game is **** PHENOMENAL and everything that SimCity should have been. I was reserving judgement for awhile, but the moment I unlocked more territory for city expansion I was SOLD. This is a MUST HAVE for anybody who likes building cities.",
    "gameID": 0,
    "author": "thegadfly44"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 4,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 8.0,
    "comments": "A very solid base that the community, as well as the developers, can build on. Negatives: No day/night cycle. No form of multiplayer. Traffic is iffy. Not a whole lot of variety in buildings. Sometimes lacks information about what is causing your city to fall apart. All those things are fixable though. With a couple of patches, DLC, as well as community mods, I am confident thatA very solid base that the community, as well as the developers, can build on. Negatives: No day/night cycle. No form of multiplayer. Traffic is iffy. Not a whole lot of variety in buildings. Sometimes lacks information about what is causing your city to fall apart. All those things are fixable though. With a couple of patches, DLC, as well as community mods, I am confident that a year from now this will be the best citybuilder ever released. Is it worth it RIGHT now though? If it was full price, I\u0027d suggest you wait just a bit. But at 30$, it\u0027s a steal. Go for it.… ",
    "gameID": 0,
    "author": "Avadon"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Absolutely amazing. A breath of fresh air after SimCity and Cities XL managed to both crap the bed on what should be a no-brainer. Also, FANTASISTC Linux support, working flawlessly on Day 1. If you have any love of City Builders, this is an absolute must-buy.",
    "gameID": 0,
    "author": "2CleverUsername"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 7,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Fantasitically solid. Look forward to what they could add on to make the very end game (20-50+ hours in one city) interesting. There\u0027s a ton of potential on top of the base of this game.",
    "gameID": 0,
    "author": "PopTarts"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 6,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is what Simcity5 and Cities XXL faild to be. Much World, Such City, Wow. You can even build your own buildings, citizens, cars, roadmodules, and more. Amazing. I am one of the few who actually liked Simcity 5. But this is so much better.",
    "gameID": 0,
    "author": "IamDavej"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 6,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 9.0,
    "comments": "Very good city manager, does not seem as easy as other city games that have come out, which is great as they can get boring quite quickly. With only 5 hours under my belt so far I still have a lot to see and learn but this is looking very promising. Road management is a little tricky at first but as you learn to use it, it is a fairly powerful tool, especially compared to theVery good city manager, does not seem as easy as other city games that have come out, which is great as they can get boring quite quickly. With only 5 hours under my belt so far I still have a lot to see and learn but this is looking very promising. Road management is a little tricky at first but as you learn to use it, it is a fairly powerful tool, especially compared to the competition. I also love the way they are approaching modding so hopefully they can concentrate on interesting features for DLC in the future and not wasting time on pretty hats.… ",
    "gameID": 0,
    "author": "Arniedadrink"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 5,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Cities: Skylines is easily the best city-builder since Sim-City 4. It beats sim-city 5 in almost every-way, despite being made by a development team the fraction of the size of Maxis, and it\u0027s playable on launch.",
    "gameID": 0,
    "author": "jesusblack"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 4,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "I have small wish list for cities skylines: day/night loop, trams, tunnels, above road trains (like in Chicago), double level roads, culture policies ( paying money for saving commercial/apartment/industrial building in it\u0027s actual state, more terrains. Maybe some more disaster especially earthquake. After it will be done for me Cities Skylines will be super-mega perfect city buildingI have small wish list for cities skylines: day/night loop, trams, tunnels, above road trains (like in Chicago), double level roads, culture policies ( paying money for saving commercial/apartment/industrial building in it\u0027s actual state, more terrains. Maybe some more disaster especially earthquake. After it will be done for me Cities Skylines will be super-mega perfect city building game, right now it is just perfect.… ",
    "gameID": 0,
    "author": "ARMORIOS"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Excellent City Builder!!!! As of now, the 4th most played and popular game on Steam right now (30,000+ people playing) and growing. What is most impressive is how the community is uploading tons and tons of Mods to the Workshop! In all... this game is ALIVE and will continue to breathe as more and more people add share their own flavor through the Workshop and Community Contributions!",
    "gameID": 0,
    "author": "RaggaRootz"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 9.0,
    "comments": "A great game that could truly suck up all your free time without you even knowing it. There is plenty to do, and really renovates the city building genre the way it should be done. There a lot of micro management involved, lots to think about including pre-planning, road layouts, districts, utilities and a lot more. If you are looking to build a city quickly you better know what you\u0027reA great game that could truly suck up all your free time without you even knowing it. There is plenty to do, and really renovates the city building genre the way it should be done. There a lot of micro management involved, lots to think about including pre-planning, road layouts, districts, utilities and a lot more. If you are looking to build a city quickly you better know what you\u0027re doing, because things can get out of hand quickly, so Cities: Skylines does take a little patience, but it\u0027s certainly worth the effort! Great game!… ",
    "gameID": 0,
    "author": "CorruptPersona"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 3,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 9.0,
    "comments": "What a dream come true. I played it from 6pm to 2:30 am last night, almost missing work this morning. It\u0027s that addictive and rewarding, but can be as equally brutal. It\u0027s just something about just resting back against the chair, watching your glorious creation grow. The districts, oh my God the districts. It\u0027s the best part of the game, just creating your own little parts of the cityWhat a dream come true. I played it from 6pm to 2:30 am last night, almost missing work this morning. It\u0027s that addictive and rewarding, but can be as equally brutal. It\u0027s just something about just resting back against the chair, watching your glorious creation grow. The districts, oh my God the districts. It\u0027s the best part of the game, just creating your own little parts of the city with it\u0027s unique policies. I created Poop Lane, a low density, low income skid row bordering against the landfill and the sewage plants. Get ready for the cluster **** of roads tho, just make sure that you make a solid base for that.… ",
    "gameID": 0,
    "author": "jvidner"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 6,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "A 12 developer team made a 30€ game that kicks all competitions in the nuts. It\u0027s not perfect, but just made a almost bug-free launch and has already many custom content developed through Steam Workshop. When the worst thing about a simulation you can say is that it\u0027s too serious and that the music is boring, well... you have a winner. Great game, great price, greatest approach toA 12 developer team made a 30€ game that kicks all competitions in the nuts. It\u0027s not perfect, but just made a almost bug-free launch and has already many custom content developed through Steam Workshop. When the worst thing about a simulation you can say is that it\u0027s too serious and that the music is boring, well... you have a winner. Great game, great price, greatest approach to customer requests and feedback.… ",
    "gameID": 0,
    "author": "cardigait"
  },
  {
    "helpfulCount": 19,
    "helpfulScore": 5,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 7.0,
    "comments": "Thanks to how the developers take fan feedback seriously, most of the core features you would expect from a city builder are present and delivered gracefully. But the game can be uneventful - there is not even a day and night cycle. It still has a lot of potential for improvement. Nonetheless, Cities: Skylines is a great and very welcome addition to the genre.",
    "gameID": 0,
    "author": "DavidCastro"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 4,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 8.0,
    "comments": "Simcity successor, though still has its limitations. They didn\u0027t cut corners on this game. It\u0027s the best city builder, but just a good game. City builders are fun for the first few hours, then you know. When you\u0027ve built one city you\u0027ve built them all.",
    "gameID": 0,
    "author": "wow4201"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 4,
    "date": "2015-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Well done Paradox Interactive, well done. This is not some game still in beta wrapped with fancy packaging - it is the real deal. The Steam Workshop is already filled with awesome mods on the first day. I am very excited to see what the community creates for this awesome game.",
    "gameID": 0,
    "author": "digitalnomad"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best city builders I\u0027ve ever played. The level of detail in the game is mind boggling. So far I\u0027ve spent 10-12 hours playing this game, my population is at 18 thousand, the map is ENORMOUS and there are so many things to do. From highways onramps, to train routes, to bus lines, to metro stations, to high densities to zoning districts, this game is fascinating. I spentOne of the best city builders I\u0027ve ever played. The level of detail in the game is mind boggling. So far I\u0027ve spent 10-12 hours playing this game, my population is at 18 thousand, the map is ENORMOUS and there are so many things to do. From highways onramps, to train routes, to bus lines, to metro stations, to high densities to zoning districts, this game is fascinating. I spent 10 minutes following a tourist on my bus routes to the parks she visited to renaming industry to funny names. This game is honestly one of the best, if not the best city builder I\u0027ve ever played and I AM a huge SimCity 2000 and SimCity 4 fanatic. You won\u0027t regret spending your money on this game, I can\u0027t recommend it enough!… ",
    "gameID": 0,
    "author": "Linkraa"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-12T00:00:00.000Z",
    "score": 9.0,
    "comments": "This is the sequel SimCity should have had. It\u0027s an amazing game, it\u0027s fun, runs grate with no freeze or random crashes even on large cities (Cities XL you could learn something from Paradox). Being a Paradox game I was worried about the UI, they tend to use very small fonts on every game what makes them really tough to play after a while on hi-res screens but this is not the caseThis is the sequel SimCity should have had. It\u0027s an amazing game, it\u0027s fun, runs grate with no freeze or random crashes even on large cities (Cities XL you could learn something from Paradox). Being a Paradox game I was worried about the UI, they tend to use very small fonts on every game what makes them really tough to play after a while on hi-res screens but this is not the case fortunately. From my point of view it has the first place in the podium regarding city building games. Some of the things I would love to see in the future are: day/night cycle, weather changes and more variety on buildings. If you like city building games you ought to have this one. 9/10… ",
    "gameID": 0,
    "author": "DINISA"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-03-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "For more than 10 years I\u0027ve been waiting for this title. And finally, the March 10, 2015, Paradox arrive with this Masterpiece! Absolutely a perfect title from the day one, it\u0027s basically the game that had to be Simcity 2013. This one has the best features of Simcity 4, Simcity 2013, Cities XL, without bad features! Fully supported by Colossal devs and Paradox, it\u0027s absolutely hard notFor more than 10 years I\u0027ve been waiting for this title. And finally, the March 10, 2015, Paradox arrive with this Masterpiece! Absolutely a perfect title from the day one, it\u0027s basically the game that had to be Simcity 2013. This one has the best features of Simcity 4, Simcity 2013, Cities XL, without bad features! Fully supported by Colossal devs and Paradox, it\u0027s absolutely hard not to describe this game as the best city simulator ever actually on the videoludic world. 10/10. You deserved it.… ",
    "gameID": 0,
    "author": "iMatrix7"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-03-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "This has filled the void in my city planner alternate universe life. I have been hoping and waiting for a city builder to live up to Simcity4. This has done just that. I already have almost 24 hours logged of gameplay and it\u0027s only been out for 3 days. Already over 2500 mods in the steam workshop and more added every hour. This game is fantastic and highly recommended.",
    "gameID": 0,
    "author": "threepm"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 3,
    "date": "2015-03-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is the game I have been searching for since Simcity 4. Good city builders are very hard to come by. Sure, there are some minor annoyances in how traffic is currently being simulated. It is however substantially better than the options in Simcity 5. The maps are a great size, 9 tiles is so awesome to play with. Plus mods to make it up to 25 if your system can handle it! WithThis is the game I have been searching for since Simcity 4. Good city builders are very hard to come by. Sure, there are some minor annoyances in how traffic is currently being simulated. It is however substantially better than the options in Simcity 5. The maps are a great size, 9 tiles is so awesome to play with. Plus mods to make it up to 25 if your system can handle it! With the mods support and commitment from the company to fully support moders I believe this game will be around for the long haul.… ",
    "gameID": 0,
    "author": "Joped"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 5,
    "date": "2015-03-12T00:00:00.000Z",
    "score": 9.0,
    "comments": "Everything about this game works exactly the way you want it to, though I can list a few features I feel are missing that would bring this from a 9 to a 10. 1. Circle roads tool 2. Ability to \u0027paint\u0027 trees like you paint much everything else 3. A brief tutorial would have been appreciated",
    "gameID": 0,
    "author": "zane411"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "Boom!! What a game, at last. Great little studio that has lovingly crafted a beautiful and breathing city builder. Progression is quick and fluid. Could do with some balancing in terms of the large bank roll you acquire quickly and the number of service buildings required based on the road map. But outside of that it is perfectly well executed. Graphics could do with a little polish, not aBoom!! What a game, at last. Great little studio that has lovingly crafted a beautiful and breathing city builder. Progression is quick and fluid. Could do with some balancing in terms of the large bank roll you acquire quickly and the number of service buildings required based on the road map. But outside of that it is perfectly well executed. Graphics could do with a little polish, not a big fan of the grainy textures. One tip: Plan your artery roads very very well!!!!!… ",
    "gameID": 0,
    "author": "Sawt00th"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is an amazing game! I love how it feels and how it looks. I have always liked SimCity 5, but the building space was so small... Cities: Skyline, have really made the building space big and nice. Thank you paradox Interactive, for bringing hours and hours of fun to my life. ;-)",
    "gameID": 0,
    "author": "Zabslol"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-03-12T00:00:00.000Z",
    "score": 8.0,
    "comments": "Great game, really optimized (smooth as silk), huge cities, real infrastrucure. It\u0027s a true successor to SC4. HOWEVER it\u0027s far too easy (even with hard mode mod)",
    "gameID": 0,
    "author": "ShottyMonster"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 3,
    "date": "2015-03-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best game of 2015 so far! Best $30 spent in 2015 so far! Well, need i say more? EA, lean from small devs about how o make great games, simple yet effective!!!",
    "gameID": 0,
    "author": "nitrojuice"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 2,
    "date": "2015-03-13T00:00:00.000Z",
    "score": 7.0,
    "comments": "Not sure why everyone is so over the top with their scoring of this game. It has what SimCity lacked - true. But it also lacks what SimCity had - polish, especially in the 2D graphics and texture department. Luckily these are things that are more easily fixed than a broken game engine like SimCity\u0027s glassbox, and so I have hope for Skylines. But it\u0027s not the ultimate city builder - atNot sure why everyone is so over the top with their scoring of this game. It has what SimCity lacked - true. But it also lacks what SimCity had - polish, especially in the 2D graphics and texture department. Luckily these are things that are more easily fixed than a broken game engine like SimCity\u0027s glassbox, and so I have hope for Skylines. But it\u0027s not the ultimate city builder - at least not yet.… ",
    "gameID": 0,
    "author": "runeb80"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 2,
    "date": "2015-03-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "Everything wrong with EA is fixed here, all the problems with Simcity are fixed here, beware is highly highly adictive. Rarely give away big score, or buy games generaly cause of the stupid shops, but this one is worth it, I hope it will be and expample for the industry and hope people will support games likethis in the future.",
    "gameID": 0,
    "author": "Raskol"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-03-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "Cities: Skylines is the best city building game ever! This game is much better than SimCity and Cities (X)XL. The best points of Cities: Skylines: Map size, mod support, price (~25 euros) and map editor. Must have!",
    "gameID": 0,
    "author": "PSPfreaky"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-03-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "What Simcity 2013 should\u0027ve been. The are some thing that you can miss, such as disasters or maybe day/night cycle. But it\u0027s not big deal. So buy it and enjoy being the major of your city! 10/10",
    "gameID": 0,
    "author": "Alr"
  },
  {
    "helpfulCount": 15,
    "helpfulScore": 7,
    "date": "2015-03-13T00:00:00.000Z",
    "score": 7.0,
    "comments": "The fact that this IS the best city builder we have seen in years, I don\u0027t think that justifies giving it a top rating. This is a great city builder, it has potential to become one of the best. It does distance itself from the previous king of it all (Simcity 4, In my opinion) by trying to be new and fresh like the later Simcity of 2013. The game plays like the 2013 version of Simcity,The fact that this IS the best city builder we have seen in years, I don\u0027t think that justifies giving it a top rating. This is a great city builder, it has potential to become one of the best. It does distance itself from the previous king of it all (Simcity 4, In my opinion) by trying to be new and fresh like the later Simcity of 2013. The game plays like the 2013 version of Simcity, but does better - yet the overall finish of the game feels a bit clunky and not as polished as it could have been. The sim part itself seems fair and well made, yet it\u0027s unclear which parts are simulated, which are not and so on - and it seems very easy to get started, which may be good but it kind of lacks the challenge. It looks good and plays well, definitely the best city builder game seen since Simcity 4.… ",
    "gameID": 0,
    "author": "WhiteNoisetrash"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-03-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "Great game, with enormous potential to be even greater in the coming months/year with user made mods. GOTD! (Game of the decade!) for me personally. Buy this game.",
    "gameID": 0,
    "author": "torojoh"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 2,
    "date": "2015-03-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is awesome, best simulation game ever. ITS A MUST BUY This game is awesome, best simulation game ever. ITS A MUST BUY This game is awesome, best simulation game ever. ITS A MUST BUY This game is awesome, best simulation game ever. ITS A MUST BUY",
    "gameID": 0,
    "author": "cybercar"
  },
  {
    "helpfulCount": 14,
    "helpfulScore": 6,
    "date": "2015-03-14T00:00:00.000Z",
    "score": 6.0,
    "comments": "I love ALL city building games. In this game you can build big cities, you will spend a lot of time building roads, and water pipes. But it has somehow fewer possibilities, also there is not much economics going on. Sim City was a better city building / simulation game. This game I will not run after 1 week. With Sim City I spend more time . After one day I was tired of buildingI love ALL city building games. In this game you can build big cities, you will spend a lot of time building roads, and water pipes. But it has somehow fewer possibilities, also there is not much economics going on. Sim City was a better city building / simulation game. This game I will not run after 1 week. With Sim City I spend more time . After one day I was tired of building intersections and water pipes. Repetitive game, not much challenges except roads and traffic .… ",
    "gameID": 0,
    "author": "peterf28"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2015-03-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "Absolutely Amazing game!!!!! I was not this happy since Rollercoaster Tycoon 1 and 2... Perhaps 3 was nice too but CO has really made an amazing game here. I am so excited to see what more they can add to this masterpiece!!",
    "gameID": 0,
    "author": "DMT"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "A tremendous product by a relatively small development team proves it\u0027s about the quality not quantity of developers. Cities: Skylines truly surpasses all others in regard to mass transit functionality and over all simulation strategy game play.",
    "gameID": 0,
    "author": "flacwby"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is really by far the most balanced city sim I\u0027ve ever played. The only immediate negative I have to say about it is that all roundabouts need to be built from other road types (i.e. one lane road curved into a circle). This unfortunately adds some extra land cost to getting the benefits of a roundabout, where most modern roundabouts can fit into an area about the same size as aThis game is really by far the most balanced city sim I\u0027ve ever played. The only immediate negative I have to say about it is that all roundabouts need to be built from other road types (i.e. one lane road curved into a circle). This unfortunately adds some extra land cost to getting the benefits of a roundabout, where most modern roundabouts can fit into an area about the same size as a normal traffic light intersection.… ",
    "gameID": 0,
    "author": "treeface"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2015-03-14T00:00:00.000Z",
    "score": 8.0,
    "comments": "Colossal Order has done a great job with \u0027Cities: Skylines\u0027, it\u0027s an amazing game. It\u0027s sure to keep any city-building fan entertained for hours upon hours. There are only a few minor features missing and some areas that could use polishing, which should be corrected in future patches for sure. For now it\u0027s a score of 8/10, but I\u0027m sure it\u0027ll be a 10/10 in the near future.",
    "gameID": 0,
    "author": "Jumpy"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 2,
    "date": "2015-03-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "I played only for several hours but so far I just love this game. I\u0027ve played since years not only SimCity4 but also the Anno/Settlers series, although the latter great games can perhaps not be compared here as city building games. However, with this, I can now enjoy another good product. No comments on SimCity. I did not buy SimCity due to bad reviews and feedback. Great job for thisI played only for several hours but so far I just love this game. I\u0027ve played since years not only SimCity4 but also the Anno/Settlers series, although the latter great games can perhaps not be compared here as city building games. However, with this, I can now enjoy another good product. No comments on SimCity. I did not buy SimCity due to bad reviews and feedback. Great job for this first Cities Skylines release, which seems very stable and well implemented/tested. The \"complexity\" is maybe not (yet) that huge, but I really can not complain for the 28 Euro price. I hope, this is just the beginning and more content will be released soon. So far, thank you Colossal Order. And goodbye Maxis.… ",
    "gameID": 0,
    "author": "Knurrli"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "It delivers what Simcity should have done. Simcity is poor but I still appreciate it for paving the way for Cities: Skyline. Hope they will add more customizations to players . Then this game will be truly a masterpiece.",
    "gameID": 0,
    "author": "asfj"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-03-15T00:00:00.000Z",
    "score": 9.0,
    "comments": "Finally somebody made it the way it sholuld be. Along with seamless workshop integration, no Additional crapware required and beautiful scenery, it\u0027s set to be played by many people for the next bunch of years. Get it and support the devs! I\u0027ll detract 1 point though for the not always intuitive traffic system (there are strange cases) and missing complexity in water / power managementFinally somebody made it the way it sholuld be. Along with seamless workshop integration, no Additional crapware required and beautiful scenery, it\u0027s set to be played by many people for the next bunch of years. Get it and support the devs! I\u0027ll detract 1 point though for the not always intuitive traffic system (there are strange cases) and missing complexity in water / power management (one pipe / power lane will always do the trick, that\u0027s a bit too cheap for me).… ",
    "gameID": 0,
    "author": "xVinci"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 3,
    "date": "2015-03-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game, this game redefines the city building genre, i mean SimCity should\u0027ve been this, if it wasn\u0027t for Electronic A**holes maybe it would\u0027ve been something, but we got this i swear this is the best city builder I\u0027ve ever played.10/10 no h8",
    "gameID": 0,
    "author": "DwarvenKing"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 3,
    "date": "2015-03-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "Finally. A city builder with no major flaws. Kudos to this development team, you feel the right spirit in every single aspect of this simulation. Happy to vote for this game, we as gamers DESERVE such passion. And trust me, as an 52 year old grumpy gamer, i love this game.",
    "gameID": 0,
    "author": "salzherz"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-03-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is absolutely amazing! This is what Simcity 2013 wanted to be, and should have been, and we all know how that turned out! If you thought Simcity 2013 looked amazing pre-release (Which i all did...before its release and knowledge of map size) you will absolutely love this as it takes the good features from past Simcity games and unites it with a ton of new features likeThis game is absolutely amazing! This is what Simcity 2013 wanted to be, and should have been, and we all know how that turned out! If you thought Simcity 2013 looked amazing pre-release (Which i all did...before its release and knowledge of map size) you will absolutely love this as it takes the good features from past Simcity games and unites it with a ton of new features like accurate water simulations etc... If you are and have been a Simcity fan, you will HAVE to get this! 9.8/10… ",
    "gameID": 0,
    "author": "xThatGuyx"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 2,
    "date": "2015-03-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is the city builder everyone has been waiting for. It manages to achieve with ease, what so many others have tried and failed to do. It does have a steeper learning curve for the uninitiated, but a few online tutorial videos on Youtube will fix that. It also has a few kinks to work out with traffic AI, transport path errors, and commercial demand which I am confident will be fixedThis is the city builder everyone has been waiting for. It manages to achieve with ease, what so many others have tried and failed to do. It does have a steeper learning curve for the uninitiated, but a few online tutorial videos on Youtube will fix that. It also has a few kinks to work out with traffic AI, transport path errors, and commercial demand which I am confident will be fixed sooner rather than later. It also does not currently have a day / night cycle, which will keep me going back to SimCity 5 now and then until it does. Tunnels are also not in the game currently, but they are coming along with the day / night cycle. These issues are so minor though, it doesn\u0027t deserve anything less than a 10 as the game is otherwise flawless and the modding community will keep it alive for years to come along with free updates and paid DLC from the developers. For the price, you can\u0027t go wrong if you are at all interested in city building or strategy games.… ",
    "gameID": 0,
    "author": "Rasmin"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2015-03-15T00:00:00.000Z",
    "score": 9.0,
    "comments": "This game offers what SimCity should have offered and a lot more. A solid City simulation game and by far the best one available on the market. You simply cannot go wrong with this one.",
    "gameID": 0,
    "author": "Titannumber20"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-03-15T00:00:00.000Z",
    "score": 9.0,
    "comments": "Wow!! This game redefines the genre in all ways. I am just scratching the surface with a city of 18,000 people, and I\u0027m totally digging this. Skylines is really the next generation of city sims. Every control, every effect, and every interaction of the vast number of city systems is well balanced, elegantly implemented, and beautifully presented. The engine runs like a dream on my modestWow!! This game redefines the genre in all ways. I am just scratching the surface with a city of 18,000 people, and I\u0027m totally digging this. Skylines is really the next generation of city sims. Every control, every effect, and every interaction of the vast number of city systems is well balanced, elegantly implemented, and beautifully presented. The engine runs like a dream on my modest 3.4 ghz 4 gb system with a 5670 card, although I\u0027m sure as my city grows into the hundreds of thousands I\u0027m going to miss a more current gaming rig. This is the type of game that makes people upgrade their systems to play, it\u0027s that compelling. The map editor alone is a fine piece of software, you can spend countless hours in God mode before you even get to the game proper, but once in the game all of the countless variables begin to reveal their true purposes. Be prepared for a brief initially tough learning curve, but rest assured that this is a game suited for anyone that wishes a more cerebral, carefully planned out simulation of a living, breathing city. This is suddenly the new reference standard for top quality simulation programming.… ",
    "gameID": 0,
    "author": "justanhonestguy"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-03-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "This game is the passing of the torch to a new generation. Simcity 4\u0027s legacy lives on in Cities: Skylines, and it is in good hands. The King is dead, long live the King. You can see it in the way the complaints about Simcity 2013 were answered directly. No online DRM. Yes to modding. Yes to big cities. It\u0027s not perfect, and has some rough edges that aren\u0027t surprising for a game with aThis game is the passing of the torch to a new generation. Simcity 4\u0027s legacy lives on in Cities: Skylines, and it is in good hands. The King is dead, long live the King. You can see it in the way the complaints about Simcity 2013 were answered directly. No online DRM. Yes to modding. Yes to big cities. It\u0027s not perfect, and has some rough edges that aren\u0027t surprising for a game with a reduced price coming from such a small team. But that stuff can be fixed with patches and modding. They got the core stuff right, and it\u0027s just a joy to build a city and then watch traffic grind to a halt because you put all the industrial zones in a spot where only one road goes to the highway and it\u0027s jammed right up.… ",
    "gameID": 0,
    "author": "Tridus"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 2,
    "date": "2015-03-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "10/10 would bang. Really great game, everything SimCity 2013 should have been. The perfect successor to SimCity 4 and it is surely going to make use of the advanced hardware you folks out there have.",
    "gameID": 0,
    "author": "Shrimp87"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2015-03-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "Quite honestly, the best city building game released to date. An absolute triumph. Sure, there are minor problems, but I\u0027m sure these will all be ironed out in a few months - the shortcomings are nothing to write home about. If you remember firing up Sim City back in the early 90s, and you remember how much fun it was - this is the next generation. After playing the relaunch of EA\u0027sQuite honestly, the best city building game released to date. An absolute triumph. Sure, there are minor problems, but I\u0027m sure these will all be ironed out in a few months - the shortcomings are nothing to write home about. If you remember firing up Sim City back in the early 90s, and you remember how much fun it was - this is the next generation. After playing the relaunch of EA\u0027s Sim City, I didn\u0027t think the game I wanted to play could ever be made. It has. Go get it now!… ",
    "gameID": 0,
    "author": "Isca"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "Simply, everything Sim City couldn\u0027t ever be. Perfect game, even small graphical glitches, or some limitations that mods are already bypassing. Extensive moddability, makes this a masterpiece and an insta-classic. If you love city sims, you HAVE to buy this game. Seriously, this is whatever you\u0027ve ever dreamt about a city builder sim.",
    "gameID": 0,
    "author": "Sk3z"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2015-03-16T00:00:00.000Z",
    "score": 7.0,
    "comments": "A good game, well done , no bugs, nice graphics and music. But after 25 - 30 hours you will feel that there is not enough possibilities and content. Some nice ideas (water management, electricity management, transport system, laws and exceptions) but the lack of deep management kills the surprise. Too casual, too light for me for a city builder in 2015 but still it\u0027s a good game in this poor era.",
    "gameID": 0,
    "author": "DukeBalek"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is the best city building game in the last 10 years. Super fun, super addictive. If you\u0027ve been looking for a next gen city building game done perfectly then look no further. Kudos to the team that made this gem of a game!",
    "gameID": 0,
    "author": "BermudaDaze"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2015-03-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "An amazing game that has finally replaced the ever-dull SimCity in my gaming library. The modding support thanks to Steam Workshop, the massive city sizes, true simulation, and the brilliant mechanics make this game the best simulator I\u0027ve ever played. On a different note, the transportation system \"add stop\" function is a little screwy, causing my already existing lines to somehowAn amazing game that has finally replaced the ever-dull SimCity in my gaming library. The modding support thanks to Steam Workshop, the massive city sizes, true simulation, and the brilliant mechanics make this game the best simulator I\u0027ve ever played. On a different note, the transportation system \"add stop\" function is a little screwy, causing my already existing lines to somehow become incomplete instead of just adding a stop to it. Nonetheless, all I can say is this is a work of art. BUY. IT.… ",
    "gameID": 0,
    "author": "hayhay7789"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-03-16T00:00:00.000Z",
    "score": 8.0,
    "comments": "Well, the Game is amazing! Good Structure, technical Performance, no bugs. BUT: Not enough Content. Only 25 Buildings around? Get boring very fast. :/ We need more content! :)",
    "gameID": 0,
    "author": "7lives"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 3,
    "date": "2015-03-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "Amazing game. The clear successor to Sim city. I haven\u0027t had so much fun since back in the sim city 4 days. I spend so many hours in this game already and I just cant stop. The best thing is they dont try to reinvent the wheel. The developers are clearly fan and former players of Sim City and it shows. Well done a must buy for any Sim city 4 fan.",
    "gameID": 0,
    "author": "Benjamin99"
  },
  {
    "helpfulCount": 37,
    "helpfulScore": 1,
    "date": "2015-03-17T00:00:00.000Z",
    "score": 5.0,
    "comments": "Game crashes to a white screen at random times. Sometimes after 5 mins and other times it takes 90 mins. -3 for that. There is no autosave. That combined with the above crashing is very frustrating. -1 for that. Once they fix these issues, which I have full confidence that will they will that makes the game a solid 7. Why? There isn\u0027t anything new here to engage the player.Game crashes to a white screen at random times. Sometimes after 5 mins and other times it takes 90 mins. -3 for that. There is no autosave. That combined with the above crashing is very frustrating. -1 for that. Once they fix these issues, which I have full confidence that will they will that makes the game a solid 7. Why? There isn\u0027t anything new here to engage the player. With proper planning you will never fail. It is a bit easy even on hard mode. This game needs scenarios or objectives to accomplish. Like having a tourism city, or Vegas like city. Currently everything is just generic. Sure it is better than SimCity 3000 but that wasn\u0027t that hard to do. I think Paradox is a great company though and they should be able to the fix issues with a big DLC or the next version.… ",
    "gameID": 0,
    "author": "Phear"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 2,
    "date": "2015-03-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "It\u0027s a must-buy 10 if you ever enjoyed any version of SimCity in your life. It is BETTER THAN ALL VERSIONS OF SIMCITY (even SC4). It already has a staggering number of mods on Steam Workshop just a week or so after release. This game will have 10k+ mods and user-created content in a month. I preordered and played the newest SimCity - and was so disappointed. I would never go back toIt\u0027s a must-buy 10 if you ever enjoyed any version of SimCity in your life. It is BETTER THAN ALL VERSIONS OF SIMCITY (even SC4). It already has a staggering number of mods on Steam Workshop just a week or so after release. This game will have 10k+ mods and user-created content in a month. I preordered and played the newest SimCity - and was so disappointed. I would never go back to SimCity after playing this amazing game. What a gem!!!… ",
    "gameID": 0,
    "author": "rodericrinehart"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2015-03-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "I have to admit, this is the next Sim city. Skylines makes Sim city look outdated. Skylines is everything that Sim city cannot be. It is a beautifully crafted game with low resource required to run the game which allows to be run ultra high on settings. I was surprised that the game only needed less than 2GB to install the game onto your computer. This is amazing!",
    "gameID": 0,
    "author": "Ninja-Puffs"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2015-03-17T00:00:00.000Z",
    "score": 9.0,
    "comments": "It\u0027s possibly the best city building game ever created. I definitely recommend it. It has everything you could possibly want... size, scale, depth, variety, control and flow. A+",
    "gameID": 0,
    "author": "fl3shy"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 2,
    "date": "2015-03-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best citybuilder that has been released in the last decade. It works out of the box and the modding support is phenomenal. I can\u0027t wait to see what it will be like in a year.",
    "gameID": 0,
    "author": "PineappleGod"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2015-03-17T00:00:00.000Z",
    "score": 9.0,
    "comments": "A truly amazing game. I have been waiting a very long time for a good city building game and now we finally have one! Everything here is great: the large cities, the individual peeps who live their own lives, the sound effects, the graphics and of course the steam workshop (which already has some great mods and additions available). If you have even the remotest interest in cityA truly amazing game. I have been waiting a very long time for a good city building game and now we finally have one! Everything here is great: the large cities, the individual peeps who live their own lives, the sound effects, the graphics and of course the steam workshop (which already has some great mods and additions available). If you have even the remotest interest in city building, strategy or tycoon games, pick this one up. You won\u0027t regret it!… ",
    "gameID": 0,
    "author": "lach1223"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-03-18T00:00:00.000Z",
    "score": 7.0,
    "comments": "In my opinion this game is good but not great. I thought that after such stunning reviews and scores I would be knocked on my knees, but no. Cities Skylines has many great features like hard at first but very complex roads, districts, huge space for city building, cemeteries, water physics, content editor and Steam Workshop. But still there is a lack of human character in these littleIn my opinion this game is good but not great. I thought that after such stunning reviews and scores I would be knocked on my knees, but no. Cities Skylines has many great features like hard at first but very complex roads, districts, huge space for city building, cemeteries, water physics, content editor and Steam Workshop. But still there is a lack of human character in these little people that populate the city. Nothing seems to bother them. Hours spent on train platform waiting in huge crowd for a train, too few schools, slow traffic - not a problem. It makes a game too easy. They do some things but it does not make the city alive like in Sim City. This ruins for me a purpose to build really big and great city just to watch my little residents struggle with life. There aren\u0027t also many service buildings and zones buildings models. Also descriptions in unique buildings menu are meaningless. Sim City has a great system with improving buildings the way it is needed at a time what give a lot more design choices. Whole content in Cities Skylines after seeing so many roads at the beginning is small and seems like developers thought that community will do the rest. Of course I will not compare Sim City Complete Edition and Cities Skylines Deluxe Edition, but they could do more. I hope for a big DLC loaded with new content from CO and maybe then I will be able to say, yes it is a great game. I think that really great game should have all whats good from Sim City and Cities Skylines. For now seven, but I wait for developers to prove me wrong.… ",
    "gameID": 0,
    "author": "RaZeLSKi"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2015-03-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "After 12 years we finally have a sucessor to Simcity4. The King may be dead (Maxis) but Skylines has stepped up into its place with a truly impressive offering. Coupled with the ease of modding and the Steam Workshop for asset and mod management the game offers a stunning array of content for $30. In a year I am sure that the entire game is going to be rebuilt by fans. The base game isAfter 12 years we finally have a sucessor to Simcity4. The King may be dead (Maxis) but Skylines has stepped up into its place with a truly impressive offering. Coupled with the ease of modding and the Steam Workshop for asset and mod management the game offers a stunning array of content for $30. In a year I am sure that the entire game is going to be rebuilt by fans. The base game is solid, but it could do with a few more optional scenarios that effect your city such as wide spread disasters (highway interchanges don\u0027t count!) or economic hardships that could be unique to the play experience. For a game that started with 8 people and ended with a humble team of 14, I have a feeling the resounding commercial success and clear vision for this project will give it plenty of solid expansions or DLC. I look forward to seeing them. Bottom line: if you like city building games - BUY THIS GAME, YOU WON\u0027T REGRET THIS!… ",
    "gameID": 0,
    "author": "Urrid"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-03-18T00:00:00.000Z",
    "score": 9.0,
    "comments": "Just about perfect, graphically amazing. Fantastic Ai. Good amount of replay value and not as expensive. I have already put about 4-8 hrs in this game and everything is so right, until the problems begin. After hitting about 40-50 thousand citizens i began to experience minor to major dashboard problems. Such as watching the power surge through the city the display is pretty much invisibleJust about perfect, graphically amazing. Fantastic Ai. Good amount of replay value and not as expensive. I have already put about 4-8 hrs in this game and everything is so right, until the problems begin. After hitting about 40-50 thousand citizens i began to experience minor to major dashboard problems. Such as watching the power surge through the city the display is pretty much invisible and happens to every single dashboard like, Sewage, happiness, fire,police,etc.The game is very uneventful,but still gives the player an in-depth city builder. Overall a great game but lacks techincally… ",
    "gameID": 0,
    "author": "TheChronicle"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-03-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "A beautiful and incredibly feature rich city builder that will continue to be expanded at pace for many years to come through the wonderful community mods and expansions!! This is how city sims should be!! * Huge maps * A deep transportation system * In game citizens that feel like they\u0027re really actually living in your city! * Both simple and complex tools depending on how deep youA beautiful and incredibly feature rich city builder that will continue to be expanded at pace for many years to come through the wonderful community mods and expansions!! This is how city sims should be!! * Huge maps * A deep transportation system * In game citizens that feel like they\u0027re really actually living in your city! * Both simple and complex tools depending on how deep you want to go * A fully integrated mods and custom assets experience, with a highly active community I could go on and on.... You can tell the developer\u0027s built Cities Skylines with real passion for the genre and to deliver a fantastic experience for the players. They genuinely want people to love this game, and because of this attitude...it seems the player\u0027s do! Well done Colossal Order and Paradox!… ",
    "gameID": 0,
    "author": "DjNemes1s"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2015-03-18T00:00:00.000Z",
    "score": 9.0,
    "comments": "Simcity? Cities XL? sure some people think it is a rip off from those games, but lets be honest, ain\u0027t all city builder games the same anyway? The game like the ones named above each have some unique features, cities skyline is no different from that. the game might have few bugs at the moment, but don\u0027t all games these days have bugs? At least the bugs are not game breaking unlikeSimcity? Cities XL? sure some people think it is a rip off from those games, but lets be honest, ain\u0027t all city builder games the same anyway? The game like the ones named above each have some unique features, cities skyline is no different from that. the game might have few bugs at the moment, but don\u0027t all games these days have bugs? At least the bugs are not game breaking unlike Simcity and can be worked around till a patch is released… ",
    "gameID": 0,
    "author": "Fields007"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 1,
    "date": "2015-03-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "I haven\u0027t gotten this sucked in to a game since WoW. It feels so good to sink your teeth into a really polished and deep game system like Cities:Skylines. I\u0027ve spent nearly every waking minute since this game came out tweaking and perfecting a half a dozen different cities while figuring out how everthing works. A true joy.",
    "gameID": 0,
    "author": "austenite"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-03-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "Finally someone got it right. Ignore the zero score trolls. Amazing out the box but wait for the mods... This is going to be around for years. Hope Paradox don\u0027t abuse us with expensive DLC. Greedy little tykes",
    "gameID": 0,
    "author": "Chongychoo"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-03-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "A lovely made game with big maps, nice graphics, the ability to make and download new maps. A really fun and addictive game which can be played casually or suitable for more in depth players who like to look at every aspect of their city. An overall massive city building game with nice mechanics.",
    "gameID": 0,
    "author": "prawntoast1"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2015-03-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "As a lifetime City builder fan, Cities: Skylines completely caught me by surprise. It\u0027s basically everything that SimCity has failed to be. Cities is stable, looks great, and has deep gameplay to keep you building cities for a long time. This is the best city builder game out, period, no contest.",
    "gameID": 0,
    "author": "deb0"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-03-19T00:00:00.000Z",
    "score": 8.0,
    "comments": "Very good game, but far from the 9+ notes here. Here\u0027s why: the game is deeply simple. Create new zones and new people will just come in. I remember Sim City 4 to be much more complex than that for example. Still a very solid game. Good job on that Colossal Order.",
    "gameID": 0,
    "author": "ezay"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-03-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "An absolute triumph of a game - the game the Sim City reboot wished it was. Stylishly done city building in nearly every aspect, with only the merest hint of a few rough edges that never threaten to dampen the core playstyle. Simply put, this deserves every bit of acclaim it gets. I\u0027m absolutely over the moon to finally find a worthy successor to Sim City 4. Now excuse me while IAn absolute triumph of a game - the game the Sim City reboot wished it was. Stylishly done city building in nearly every aspect, with only the merest hint of a few rough edges that never threaten to dampen the core playstyle. Simply put, this deserves every bit of acclaim it gets. I\u0027m absolutely over the moon to finally find a worthy successor to Sim City 4. Now excuse me while I plow hundreds of hours into this game!… ",
    "gameID": 0,
    "author": "Tubey"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2015-03-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "The city building genre has been overrun by crooks - like City XL and idiotic crooks like EA and Maxis. This is a breath of fresh air in the original spirit of simcity. It was made from people who have played city building games for people who were waiting for a good city builder. On the minus the graphics in the ultra zoom level are a bit simplistic ... but the gameplay is great.",
    "gameID": 0,
    "author": "alexnode"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-03-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "I am also one of the owners of Sim City 2013 and was very disappointed when it was released, so this was one project I was following closely. I watched hours of streams before the release and those convinced me that Cities Skylines would be a great city builder. Now I got 30+ hours in the game and I still love it. Sure there are still a couple of things that could be improved, but theI am also one of the owners of Sim City 2013 and was very disappointed when it was released, so this was one project I was following closely. I watched hours of streams before the release and those convinced me that Cities Skylines would be a great city builder. Now I got 30+ hours in the game and I still love it. Sure there are still a couple of things that could be improved, but the game is already so massive that I want to go back to playing it right now. The mod support is also great, new buildings, intersection and all kinds of handy mods are making this game even better! Keep it up CO!… ",
    "gameID": 0,
    "author": "depl0y"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2015-03-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "How do I know this is a great game? Thought, I\u0027ll just fire it up, make sure it works as I intended to play BF4. 4 hours later, I\u0027m balls deep in cultivating a high ed, high tech city of awesomeness. This game is digital crack in the same vein as Civ, Age or Empires, or the real Sim City (1-4) games. If you loved Sim City 4 and want a game to consume your life. Buy this. TheHow do I know this is a great game? Thought, I\u0027ll just fire it up, make sure it works as I intended to play BF4. 4 hours later, I\u0027m balls deep in cultivating a high ed, high tech city of awesomeness. This game is digital crack in the same vein as Civ, Age or Empires, or the real Sim City (1-4) games. If you loved Sim City 4 and want a game to consume your life. Buy this. The fact it has strong mod support means this game will have legs and you\u0027ll get years of enjoyment from this game for frankly a tiny amount of money. For a game developed by just 9 people, this is an exceptional achievement. The game looks slick, it feels optimised. There are no crashes, no glitches, no weird \"we\u0027ll patch that out later\" crap you find in nearly all new EA titles. Skylines shows that indy games can not only compete but excel against traditional big money publishers. You don\u0027t need social media \"experts\", you don\u0027t need to spend more on marketing than a small African country. You just need to create a game with passion, listen to your customers, and deliver a great game for a fair price.… ",
    "gameID": 0,
    "author": "planetmatt"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-03-20T00:00:00.000Z",
    "score": 7.0,
    "comments": "I have played this for about 2 days. If you just want to build pretty towns and cities then this game is for you, but that\u0027s it. I broke the 1 million dollar mark within a day and when that happens the challenge has gone and it gets repetitive quickly, the unlocks along the way are relatively boring. Most of all it needs REAL LIFE to flesh it out....There\u0027s no media, newspapers radio orI have played this for about 2 days. If you just want to build pretty towns and cities then this game is for you, but that\u0027s it. I broke the 1 million dollar mark within a day and when that happens the challenge has gone and it gets repetitive quickly, the unlocks along the way are relatively boring. Most of all it needs REAL LIFE to flesh it out....There\u0027s no media, newspapers radio or TV. People don\u0027t do much other than drive and walk around or complain on \"twitter\" instead of vandalism, crime, riot, disease. No animals, no pets. Nothing seems to age (apart from abandoned buildings). The people don\u0027t react to fire or floods. I\u0027m not talking about \"the sims\", just some more dynamic features to engage the brain. Anyway I gave it a seven because of the modding capability, I will probably come back to this game when it has more developments from the community… ",
    "gameID": 0,
    "author": "ror"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-03-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "I love management games / city builders and stuff but didn\u0027t really expected to get hooked with Cities: Skylines even if it looked pretty solid. I was wrong... O_o Best €22 I\u0027ve spent this year and probably last year too. It has a few minor bugs and flaws, but nothing game breaking. PROS: THE GAME actually seems \u0027finished\u0027, not a \"we\u0027ll patch that later\"-product or \"why aren\u0027tI love management games / city builders and stuff but didn\u0027t really expected to get hooked with Cities: Skylines even if it looked pretty solid. I was wrong... O_o Best €22 I\u0027ve spent this year and probably last year too. It has a few minor bugs and flaws, but nothing game breaking. PROS: THE GAME actually seems \u0027finished\u0027, not a \"we\u0027ll patch that later\"-product or \"why aren\u0027t these basic features in yet... are they going to come as a DLC?\" á la EA. BEST Mod Support I\u0027ve seen in ages, 16,000+ \u0027mods\u0027 on steam already and the game has been out for 1-2 weeks... seriously... :D HALF the price compared to any EA title released the last few years. ALREADY had a nice sized patch. (2K Games take notes! XCom still got game breaking bugs f.ex.) CO and Paradox both seems to have excellent management.… ",
    "gameID": 0,
    "author": "ander01se"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-03-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "This review contains spoilers, click expand to view. My last good experience with City-Simulations i have do with SimCity 4, after that no one Game was good like this. But Cities:Skylines is the new Star on the Stage!… ",
    "gameID": 0,
    "author": "Edelplastic_com"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-03-21T00:00:00.000Z",
    "score": 7.0,
    "comments": "Really enjoyed making my city in the game so far. Nice work! Love the traffic simulation aspects and the way the system clogs up over time. Not the bets looking game in the world but thats ok.",
    "gameID": 0,
    "author": "cervan"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2015-03-21T00:00:00.000Z",
    "score": 9.0,
    "comments": "What SimCity Should have been, But with No Online ( Who cares ). It\u0027s one of the few games that I enjoy playing when I\u0027m talking to someone on TS3 or Skype ,plus when I\u0027m alone I really find my self spending a lot of time building my city and having fun. I recommend this game to everyone.",
    "gameID": 0,
    "author": "PsychoNauts"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-03-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is the reincarnation of Simcity 4000, the game i loved 12 years ago, and it came back with a vengeance. brought to you by alas, not maxis, but colossal order, a studio that knows better, and has not been forced by distributors, to implement bad ideas in a great city-building game, such as blending stupid shortsightedness and bad decisions in their game. the likes of dlc, facebook-likeThis is the reincarnation of Simcity 4000, the game i loved 12 years ago, and it came back with a vengeance. brought to you by alas, not maxis, but colossal order, a studio that knows better, and has not been forced by distributors, to implement bad ideas in a great city-building game, such as blending stupid shortsightedness and bad decisions in their game. the likes of dlc, facebook-like candy-crush systems, and al that crap. What you have is a city-building game that will keep you addicted for weeks on end, due to the great pleasure this game offers by just giving you the opportunity to go nuts and build the city you have in your mind, and ofcourse the pleasure of razing half of it after a while to make more room for railroads and highways because of traffic congestions..… ",
    "gameID": 0,
    "author": "Druganov"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-03-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "Macht alles besser als simcity man könnte den verkehr noch bissel verfeinern (alle spuren nutzen wo platz ist wens in die gleiche richtung geht mehr realer)",
    "gameID": 0,
    "author": "Creys"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-03-23T00:00:00.000Z",
    "score": 8.0,
    "comments": "Awesome. This is how a city builder has to play out. It actually simulates stuff like traffic and people. It runs perfectly since it is a 64bit game and it uses the RAM that a 64bit PC can provide. No DRM because their DRM is support the game with new content and some DLC. Awesome². Good stuff: + Traffic and People + Steam Workshop (Mods, new buildings) + No horrible DRM +Awesome. This is how a city builder has to play out. It actually simulates stuff like traffic and people. It runs perfectly since it is a 64bit game and it uses the RAM that a 64bit PC can provide. No DRM because their DRM is support the game with new content and some DLC. Awesome². Good stuff: + Traffic and People + Steam Workshop (Mods, new buildings) + No horrible DRM + (Hopefully) long term Support + Huge Cities + Full 64bit + Cheap for much content Bad Stuff - No day/night cycle (though there seems to be a mod for that but it has no impact on gameplay) - No multiplayer (which I think is sad but I get why some people dont want one) Colossal Order said they want to add more stuff and maybe day/night gets patched in and they even said that maybe there will be some sort of multiplayer. I just wanted to explain why I don\u0027t give 10/10.… ",
    "gameID": 0,
    "author": "fredinator"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-03-23T00:00:00.000Z",
    "score": 9.0,
    "comments": "Its been more than a decade but I think Simcity 4 finally has a worthy successor, Cities Skylines. Improvements Over SC4 This Game Offers; - A decent artstyle, the first decent replacement of the 2d Simcity style. - Much greater infrastructure detail, customisation \u0026 ease of use over SC4 - The traffic model appears more realistic and your actions have logical impacts on it - GoodIts been more than a decade but I think Simcity 4 finally has a worthy successor, Cities Skylines. Improvements Over SC4 This Game Offers; - A decent artstyle, the first decent replacement of the 2d Simcity style. - Much greater infrastructure detail, customisation \u0026 ease of use over SC4 - The traffic model appears more realistic and your actions have logical impacts on it - Good modding support and tools - Whilst the scale, in terms of population, is much lower than SC4 it appears more realistic and accurate - I would estimate the maximum city size is 2x the size of the larger city tile in SC4 The only negative thing I can say about the game is that it is very difficult to fail, however its something I\u0027m willing to overlook. The unlocking of buildings/services/functions as your city progresses does not feel limiting but serves a vital role in ensuring less experienced/casual players find the game easier to play. 90/100 Only improvements I can think of would be; Adding a Region, allowing cities to interact Adding multiplayer region or easy way to exchange city tiles. I hope paradox will consider these improvements for the sequel, they are certainly on a distinguished road.… ",
    "gameID": 0,
    "author": "Vonlinchen"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2015-03-24T00:00:00.000Z",
    "score": 7.0,
    "comments": "I understand why people are giving this game such high scores but I still think there is a lot that could be improved. I\u0027m not a huge fan of city-builders (the only ones i\u0027ve played are this, Tropico 4, and Sim City 2000) so I can\u0027t critique the game as much as others but I will try to offer some decent criticisms. The game seems to be lacking some road functionality, Traffic often takesI understand why people are giving this game such high scores but I still think there is a lot that could be improved. I\u0027m not a huge fan of city-builders (the only ones i\u0027ve played are this, Tropico 4, and Sim City 2000) so I can\u0027t critique the game as much as others but I will try to offer some decent criticisms. The game seems to be lacking some road functionality, Traffic often takes the same lane on a 3 lane road and this ends up causing huge traffic jams. There\u0027s no way to connect a road to another and not have it create an intersection, this is especially annoying when using highway ramps or one way roads. There seems to be a lack of unique buildings. I found this glaring when trying to increase my tourism. Supposedly tourism is supposed to be a big way to get money but there\u0027s no real way to draw tourists other than making these big, unlockable, \"unique buildings\" which do nothing other than drawing tourists in very small numbers. There\u0027s also no way to terraform the environment. You can\u0027t make a hill or level a mountain. This becomes annoying when trying to place a large building because you have to find a place that is totally flat. Airports are my biggest grief with this. Due to the generally bland nature of the maps (almost completely flat with some trees and rivers here or there) all your cities end up looking similar. Citizens seem to die quickly and in waves. No matter how much you\u0027re growing you will come across \"death waves\" where hundreds, if not thousands, of your citizens will die within a few days. This is annoying and makes it hard to judge what your true growth is or if you\u0027ve come across a serious problem. I\u0027m sure there are more issues I came across but I can\u0027t think of them now. Overall the game is enjoyable and I intend on going back to it. The devs seem intent of fixing at least some of these issues and supposedly on releasing a ton of DLC. In the mean time, the game has great mod support which can fix some of these issues and make the game much more enjoyable.… ",
    "gameID": 0,
    "author": "JimCorbett"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2015-03-24T00:00:00.000Z",
    "score": 9.0,
    "comments": "Isolate yourself from society for hundreds of hours building the perfect little digital society. You\u0027ll learn more things about traffic control from this game than from any other source you\u0027ve ever known.",
    "gameID": 0,
    "author": "karmanaut"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-03-24T00:00:00.000Z",
    "score": 9.0,
    "comments": "While waiting for the Simcity 5 expected something like this. Good functionality, highly malleable, large areas of construction, a good integration with workshop, very entertaining. To those who loose 0 for the interface, Buy yourself a pair of glasses. It seems absurd that you put 0 to the game because the interface is small, try with an other monitor. Depreciate the game for a trifle.While waiting for the Simcity 5 expected something like this. Good functionality, highly malleable, large areas of construction, a good integration with workshop, very entertaining. To those who loose 0 for the interface, Buy yourself a pair of glasses. It seems absurd that you put 0 to the game because the interface is small, try with an other monitor. Depreciate the game for a trifle. The guys from Paradox have done a great job that has been ahead of the competition.… ",
    "gameID": 0,
    "author": "alvargon"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-03-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "Cities Skylines is a masterpiece. Huge build space , good graphics, focused on simulation, challenging and the best City Builder in years. An average computer can run it.",
    "gameID": 0,
    "author": "gisarts"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-03-25T00:00:00.000Z",
    "score": 8.0,
    "comments": "Currently enjoying my time with Cities: Skylines, excellent city builder and is everything that SimCity should have been. Missing natural disasters though.",
    "gameID": 0,
    "author": "IainWalshy"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 5,
    "date": "2015-03-25T00:00:00.000Z",
    "score": 8.0,
    "comments": "This review contains spoilers, click expand to view. Expanded city twice, loving the free-design. I like the upgrade tool for roads, makes it easy to just build and upgrade later if traffic gets bad. The progressive unlock mechanism for everything is also making it easy for me to learn the game. The unlock steps are not far in-between so I find the pace descent. Creating your own districts (with a paint-brush) and specializing the industry there and cherry-picking specific laws that only affect that district is great. In fact it\u0027s something I\u0027ve never seen in city builders but now that I use it in this game is seems so obvious... Cool idea. City mechanics like traffic, pollution, cash, jobs, services etc. are working well so far. I\u0027ll update later if I get the chance with more info once the game progresses. Update: After playing the game a bit there\u0027s two major comments I\u0027d like to make. 1. The steam workshop mods are great, and expand the game nicely 2. The game is a bit too easy, and I find myself not really challenged at this point.… ",
    "gameID": 0,
    "author": "EvilTerrorizer"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-03-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "I have not gotten this game yet, but from the REVIEWS ALONE, from everything I\u0027ve seen online, and from my experience as a city-builder, I can tell this is what SHOULD have come out onto the market YEARS AGO. I suppose CO was waiting for the final dust to settle, as EA shut down Maxis, the site of the horrible tragedy of 2013 (Never Forget, SC4EVER). Well, they\u0027ve come forth with a greatI have not gotten this game yet, but from the REVIEWS ALONE, from everything I\u0027ve seen online, and from my experience as a city-builder, I can tell this is what SHOULD have come out onto the market YEARS AGO. I suppose CO was waiting for the final dust to settle, as EA shut down Maxis, the site of the horrible tragedy of 2013 (Never Forget, SC4EVER). Well, they\u0027ve come forth with a great game as far as I can tell, you get an instantaneous 10 from me just for doing so. I was thinking to myself up to this point \"Is anyone going to step up to the plate goddamn IT\"? Colossal Order proved that it is not a colossal order to give it the good old college try and do right by the fanbase for GOD IS A NERD CITY SIMULATIONS (yes, that\u0027s a genre).… ",
    "gameID": 0,
    "author": "MetaTronic"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-03-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "I read the other reviews saying this is how SimCity should have been, so I was cautiously optimistic. I have always enjoyed the SimCity series, I even enjoyed the last effort as flawed as it was although I tired of the new SimCity pretty fast. Well the other reviews were correct, this is what SimCity should have been. It\u0027s fantastic. If you hate city simulations then this game will notI read the other reviews saying this is how SimCity should have been, so I was cautiously optimistic. I have always enjoyed the SimCity series, I even enjoyed the last effort as flawed as it was although I tired of the new SimCity pretty fast. Well the other reviews were correct, this is what SimCity should have been. It\u0027s fantastic. If you hate city simulations then this game will not change your mind, but it really is a great game. I have always been loyal to the SimCity franchise, but this game just gets it right where the last SImCity effort seemed to have been developed in a direction that was not what I wanted from it.… ",
    "gameID": 0,
    "author": "Hart"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-03-26T00:00:00.000Z",
    "score": 8.0,
    "comments": "نکات مثبت : جزئیات عالی بازی - گرافیک خوب نکات منفی : باگ - بعد از مدتی بازی تکراری میشود",
    "gameID": 0,
    "author": "Arno20"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-03-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "A little confusing to start off with, but the game does a nice job of staggering content so as not to overwhelm you. Feels a little light on some of the available buildings and content, but this game has been built to make the most of modding, and the steam workshop has tonnes and growing every day. Appears the developers have the gamer very much in mind, keeping up to date with posters onA little confusing to start off with, but the game does a nice job of staggering content so as not to overwhelm you. Feels a little light on some of the available buildings and content, but this game has been built to make the most of modding, and the steam workshop has tonnes and growing every day. Appears the developers have the gamer very much in mind, keeping up to date with posters on reddit and the workshop, I expect this game to have a huge vault of additional content over the coming years. I came to this game having missed a truly decent one since sim city 4 and it doesn\u0027t disappoint.… ",
    "gameID": 0,
    "author": "winnston"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-03-27T00:00:00.000Z",
    "score": 8.0,
    "comments": "Cities skylines way better than Sim City.. i Spent some hours and i dare to say it was fun enough........................................................",
    "gameID": 0,
    "author": "Namya"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2015-03-28T00:00:00.000Z",
    "score": 7.0,
    "comments": "Amazing game and no EA :) But there is one annoying thing with road system. .. for some idiotic reason, you can\u0027t disable right turn where you want... that\u0027s frustrating and really bad for traffic.",
    "gameID": 0,
    "author": "exotikras"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2015-03-28T00:00:00.000Z",
    "score": 9.0,
    "comments": "There is not much to be said than what people and critics already said. The game is good, solid, and have zero breaking bugs, just minor bugs. This is what was supposed to be Simcity 5. The game has all features and full 3D rendering to be the truly successor of Simcity 4. With great mod support, and seamless integration into steam workshop, it will easily be much more moddable thanThere is not much to be said than what people and critics already said. The game is good, solid, and have zero breaking bugs, just minor bugs. This is what was supposed to be Simcity 5. The game has all features and full 3D rendering to be the truly successor of Simcity 4. With great mod support, and seamless integration into steam workshop, it will easily be much more moddable than SimCity 4 and will grown much more, much faster. You have basically what we wanted for Simcity 5: same ideas and mechanics of Simcity 4, with 3D graphics, improved simulation and huge plots. Things that i dont like much is the current low variety on buildings, but this should be soon fixed by modding community. The fact you can change several game rules by mods, enhance graphics like added SSAO and god rays is just like the final touch. Where also cities XL failed, this game will probably be the gold standard of the genre for years.… ",
    "gameID": 0,
    "author": "Iconium"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-03-28T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game deserves a 10 out of 10! It\u0027s a pleasure to see that there still are developers and Publishers that wants to satisfy their customers in ervery way. You are able to biuld huge cities. Every Thing you build has an effect. People are really living in your town e.g. go to work, spend time in a park and go home to their own house! evereyone! And the Trafficsystem is great done andThis game deserves a 10 out of 10! It\u0027s a pleasure to see that there still are developers and Publishers that wants to satisfy their customers in ervery way. You are able to biuld huge cities. Every Thing you build has an effect. People are really living in your town e.g. go to work, spend time in a park and go home to their own house! evereyone! And the Trafficsystem is great done and very realistic. It\u0027s always fun to have a look on your streets and watch the whole traffic how it works. And there are hardly no bugs in this game, although it\u0027s devolped by just 13 persons in 2 years. There are also possibilites to make policies and a whole public transport system. The water in this game is also very well done and has good physics. I have now about 100000 population and there are no slowdowns. The graphics look similar to SimCity 2013 but i like this look. What\u0027s also great is the map and object Editor. You can design your own town for example with heightmaps of a real existing area or town. And the greatest Thing in my opinion is the huge and well done modsupport. there were so many good mods already after 2 days of game release! played now 73 hours and is still fun. thats a good value i think for a Price of 28€. Keep it up, Paradox Interactive and Collossal Order… ",
    "gameID": 0,
    "author": "nolte11"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-03-29T00:00:00.000Z",
    "score": 10.0,
    "comments": "Apart from some very minor issues this is an almost perfect take on the city building genre. The graphics are reasonable, the sounds and music are non intrusive and the gameplay is spot on. UI is a little clunky but not a huge issue. But really the gameplay is what set\u0027s this apart, epic city building done right, and the extensive mods only add to the long term appeal. This is a 10/10 forApart from some very minor issues this is an almost perfect take on the city building genre. The graphics are reasonable, the sounds and music are non intrusive and the gameplay is spot on. UI is a little clunky but not a huge issue. But really the gameplay is what set\u0027s this apart, epic city building done right, and the extensive mods only add to the long term appeal. This is a 10/10 for me, no question.… ",
    "gameID": 0,
    "author": "VNVNation"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 4,
    "date": "2015-03-30T00:00:00.000Z",
    "score": 9.0,
    "comments": "What is this game?!: A city building game. You have four demands that keep you ever expanding your city and those are: residential zone demand, industrial zone demand, business zone demand, and services demand (being schools, hospitals, police, electricity, water, etc.) Pros: -The game does a good job at encouraging expansion. You never stagnant because there is always something toWhat is this game?!: A city building game. You have four demands that keep you ever expanding your city and those are: residential zone demand, industrial zone demand, business zone demand, and services demand (being schools, hospitals, police, electricity, water, etc.) Pros: -The game does a good job at encouraging expansion. You never stagnant because there is always something to build. You can take out loans so if you don\u0027t have money saved but demands for zones or services you don\u0027t have to wait. -Roads Roads Roads Roads Roads. Everything revolves around round. Everything must border a road to be built. You also have traffic. Creating a blueprint for your city is 90% deciding what roads to build and how to connect everything so traffic doesn\u0027t get congested. If you are like me when you are driving in a city and curse at the city planner for nonsensical/impractical design you will be humbled by this game when you realize these little simulated folks are cursing your name just as vehemently. -You have population milestones that expand your technologies and give you a sizable monetary bonus. Cons: -When you zoom in the graphics look blurry. Like an out of focus photo but it\u0027s not really a big deal. -Some buildings require a certain population level in order to unlock/build. Like a forestry industrial zone. Why do I need a certain population to cut down trees? Thankfully you can turn this feature off and be able to build everything right from the beginning so even that is hardly a negative. Conclusion: The best at doing what is does plus you just know we are going to get expansion packs. it\u0027s a game worth playing.… ",
    "gameID": 0,
    "author": "Underpants158"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-04-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "The game is great, bur it\u0027s not the game itself that I love most. It\u0027s the creators way of handle things, the price is not ridiculously high, playing this game finally I don\u0027t have a feeling thai I\u0027m being ripped off with micro transactions, DLC etc. ubisoft, ea and others watch and learn!!!",
    "gameID": 0,
    "author": "tommakrwro"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-04-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is worth a review and a score. Recognition where it is due. If you have never played city-building games before, or have never played a computer game before, this is for you.",
    "gameID": 0,
    "author": "arajand"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-04-06T00:00:00.000Z",
    "score": 8.0,
    "comments": "This game is what Simcity should have been, it is a wonderful and charming game that stands on it\u0027s own merits. Although lacking some of the innovation of the 2013 simcity with it\u0027s multiplayer component, in addition, to lacking some level of destruction mechanic that is common in simcity, Cities; Skylines is a joy to play that nearly perfected most to all of the problems that hauntedThis game is what Simcity should have been, it is a wonderful and charming game that stands on it\u0027s own merits. Although lacking some of the innovation of the 2013 simcity with it\u0027s multiplayer component, in addition, to lacking some level of destruction mechanic that is common in simcity, Cities; Skylines is a joy to play that nearly perfected most to all of the problems that haunted Simcity 2013. This game has full mod, Map and Asset Editor though in game editors and Steam workshop. Unfortunately there are negative aspects to the game, a tutorial would have been a pleasant addition as the game can become very complex and a UI that is not always obvious to a new player, also, the in game twitter can not be annoying and can not be disabled without mods.… ",
    "gameID": 0,
    "author": "Dalekhunter"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-04-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "This is what SimCity 2013 should have been. The game is extremely addicting for the fact that you have the options to get bigger and expand, expand, and expand. All the better elements are there from the Simcity sims, managing traffic, zoning, etc.... My only complaint is the cartoony look of the game, which I assume is to help it run as smooth as possible, and the cities can lookThis is what SimCity 2013 should have been. The game is extremely addicting for the fact that you have the options to get bigger and expand, expand, and expand. All the better elements are there from the Simcity sims, managing traffic, zoning, etc.... My only complaint is the cartoony look of the game, which I assume is to help it run as smooth as possible, and the cities can look kind of generic and plain, whereas older sims had more way to spice it up. Hopefully with the mod community, it will make it much much better though. It\u0027s a solid addition to the genre overall.… ",
    "gameID": 0,
    "author": "Bribarian"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-04-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is the best city-builder what i tryied. The map is great and expandible to 36km2 with a simple mod, The mod support is full and I can create Maps/Assets, share them and download other from steam workshop. The only things what i don\u0027t like is the lack of italian language.",
    "gameID": 0,
    "author": "Angelo0001c"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-04-08T00:00:00.000Z",
    "score": 9.0,
    "comments": "Love it. Biggest advantage of CS over Sim City is that you can build huge cities. I never had a problem with always on but these tiny mini cities made me nuts. Some stuff is not that good than in Sim City but most of it is better. 8/10 but with the price point a 9/10",
    "gameID": 0,
    "author": "Protagonist72"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 1,
    "date": "2015-04-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "I have not played this game, but I decided to give this game 10 points. Why? It felt right. Suomi mainittu, torilla tavataan. Sauna, karjala takaisin, vodka, melankolia, Juha Mieto, -95 PERKELE! Colossal Order.",
    "gameID": 0,
    "author": "Einola"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2015-04-11T00:00:00.000Z",
    "score": 7.0,
    "comments": "As a big fan of Sim City 4 Deluxe, this game proved to be a much more in depth take on the city building genre. The complex blend of ways to utilize nearly every facet of the games core, from trash and waste removal to roadway efficiency really took the game to a whole new level of detail never achieved by any of the genre\u0027s predecessors. I\u0027ll try my best to sum up the highs and lows asAs a big fan of Sim City 4 Deluxe, this game proved to be a much more in depth take on the city building genre. The complex blend of ways to utilize nearly every facet of the games core, from trash and waste removal to roadway efficiency really took the game to a whole new level of detail never achieved by any of the genre\u0027s predecessors. I\u0027ll try my best to sum up the highs and lows as quickly as possible. Highs: The greatest part about the game came from the overall challenge presented to the player. To build a successful city, strategic planning of roadway infrastructure and municipal utilities must be planned out way in advance to optimize their efficiency and improve the city\u0027s bottom line. A lot of development went in to the dynamics of the entire system, and there are always ways to make the city better. Furthermore, problems that arose frequently needed a well thought out solution that pushed the player\u0027s wit instead of using temporary solutions to fix them to simply keep a positive budget. These features made the game fun and continued to make the game more interesting. Lows: With all the complexity that the game presents, the balance of all these components is terribly skewed. One example is the facilitation of deceased citizens needing a final resting place (i.e. cemetery), which albeit a true complication in real life, was way too exaggerated in the gameplay. Often times the city required more cemeteries and crematoriums than landfills and incinerators, and the problem never ceased to pester the overall success of the city. On the other hand, power grids and total power output never seemed to be a problem, and the solutions, like whether to use renewable energy or fossil fuels, fell more towards the former whose benefits were greatly exaggerated and whose limits severely undermined. The overall balance of the game forced the player to focus too greatly on too many points that were moot at best when compared to the real world, and focused too little on real world scenarios that would add a meaningful transparency between the real world and simulation. Conclusion: Despite its balancing and lack of practicality, this is still a really good game. Many of these issues can be fixed in updates and certainly will with time. But the overall character of the game was much less than what I was expecting, and perhaps even scores par or slightly worse than Sim City 4 even with SC4\u0027s lack of complexity. For players looking for a very challenging and diverse mayor simulation, this is the game for you. For players looking to be the god of their city, you may want to keep your wallet closed. Interesting, but selectively unique: (7.4/10)… ",
    "gameID": 0,
    "author": "daddyaddy95"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-04-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "I didn\u0027t buy this game at launch due to Uni work load so i never experienced the initial Stat up bugs that have brought its score down. I have now heavily modded Skylines and I still have never experienced a crash or white screen. The game is so well optimised that with a population of 270K I rarely experience FPS drops (game only designed for use of 9 tiles, my 270K save uses about 18I didn\u0027t buy this game at launch due to Uni work load so i never experienced the initial Stat up bugs that have brought its score down. I have now heavily modded Skylines and I still have never experienced a crash or white screen. The game is so well optimised that with a population of 270K I rarely experience FPS drops (game only designed for use of 9 tiles, my 270K save uses about 18 tiles) What makes this game good for me is the game play style can be designed by you (the player) Do you like Tycoon games? You can maximize your city services and be in the green for money once you get to a high level of population at 12% taxes Do you like management games? Cities: skylines can be micro management intensive (if you want it to be) to have your city achieve maximum performance. Do you like Sandbox? Unlimited resources can be enabled and with the help of the Terraform Tool and tsunami mods you can build cities destined to die Do you like small details? The normal game play mode generates significant income when everything is optimised rather than maxed that allows for expensive detailing using the Tree Brush, the Terraform Tool and the vanilla road guides that allow for precise road layouts or free form unlocked from the grid. The amount of detail present in the game is insane. Take the time to observe the animations that cant even be seen clearly when zoomed out. The best part about this game is that it isn\u0027t finished, Paradox and Colossal were never expecting the game to sell as well as it has and they are pushing updates (not just patches) to improve on a near perfect game. Already seen a popular mod (Extended Road Upgrade) on the workshop made \u0027redundant\u0027 because it was implemented into the game! This is what I like to see. And for the hardcore SimCity Fans, This game captures everything that SimCity should have been and far more than could ever have been imagined (Props to the Flight Simulator mod) 89 hours played and I haven\u0027t found a single minor problem with Cities: Skylines that isn\u0027t already fixed or highly likely to be fixed, it has been designed in a way to remove all problems by adding mod support. The modding community is continually improving a great game, Furthermore the mod creation tools used, are being improved and expanded with mods. Highly recommend an Auto save mod in case you cause a disaster in you city.… ",
    "gameID": 0,
    "author": "dissidify"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-04-12T00:00:00.000Z",
    "score": 9.0,
    "comments": "This is the city builder we have all been waiting for since the first PC was born. Seriously great building tools and the graphics are just perfect for this kind of game. I can\u0027t praise this game enough! And this is just the original game. The modding capabilities are so vast and fun. Even if you don\u0027t mod yourself there are so many great intersections and buildings you can download fromThis is the city builder we have all been waiting for since the first PC was born. Seriously great building tools and the graphics are just perfect for this kind of game. I can\u0027t praise this game enough! And this is just the original game. The modding capabilities are so vast and fun. Even if you don\u0027t mod yourself there are so many great intersections and buildings you can download from other players. For this price it should be an instabuy to everyone who ones a capable PC or Mac!… ",
    "gameID": 0,
    "author": "Sgfrid"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-04-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "All that Sim City was should have been. Everything works smooth, there is already loads of custom assets, maps etc on steam to be downloaded with just one click. No crashes and i haven\u0027t seen a single bug yet. Must buy!",
    "gameID": 0,
    "author": "replica17"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-04-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "The King is Dead ............. Long Live The King! EA step aside, an epic game made very clearly for gamers by gamers. Everything Sim City 5 could never have been.",
    "gameID": 0,
    "author": "jherek52"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-04-18T00:00:00.000Z",
    "score": 9.0,
    "comments": "R.I.P. SimCity 4:D New king is here, this game is just better in almost everything. Map size is amazing, different mods and a lot of stuff here. New simcity must be really good to beat that.",
    "gameID": 0,
    "author": "krekozavr"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-04-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is the best city builder ever made. Way better than SimCity 2013, and for half the price. No multiplayer problems. No DRM. Just awesome city-building fun.",
    "gameID": 0,
    "author": "NawScoper"
  },
  {
    "helpfulCount": 16,
    "helpfulScore": 4,
    "date": "2015-04-21T00:00:00.000Z",
    "score": 0.0,
    "comments": "This game is fun. But there are huge issues with the save feature. Steam sync does not work. Saving to your computer does not work either. No point in playing a city building game when your cities all disappear over night.",
    "gameID": 0,
    "author": "ZacharyE"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 7,
    "date": "2015-04-21T00:00:00.000Z",
    "score": 6.0,
    "comments": "I will start by saying this is much better than the latest Sim City, as the map size is thankfully large enough to build your city the way you want to, and there are no immediately recognizable bugs like the traffic bugs in Sim City. Cities: Skylines is great for a relaxing time while watching your city slowly expand while building a few roads here and there. Much of the fun kind ofI will start by saying this is much better than the latest Sim City, as the map size is thankfully large enough to build your city the way you want to, and there are no immediately recognizable bugs like the traffic bugs in Sim City. Cities: Skylines is great for a relaxing time while watching your city slowly expand while building a few roads here and there. Much of the fun kind of stops there, though, as there are not any real obstacles to overcome. Crime, fires, health issues, and even economic problems, which would normally be fairly decent threats and the main source of difficulty in city-builders, simply don\u0027t pose as an issue. Another huge issue is that the sound quality is terrible. When zoomed out enough to actually see the majority of your city, an extremely annoying wind sound plays endlessly. The music is also sub-par, which is not what you want in a game in which you spend most of your time watching things build up. Essentially this game is best played on mute while Pandora plays in the background. Overall, the game is nice for a glorified ant farm, but in the end its true value lies almost entirely in the fact that is a much-improved version of Sim City. Those who are really interested in city builders will be pleased, but most other gamers might want to set this one aside at least until it goes on sale.… ",
    "gameID": 0,
    "author": "Junambo"
  },
  {
    "helpfulCount": 35,
    "helpfulScore": 5,
    "date": "2015-04-27T00:00:00.000Z",
    "score": 0.0,
    "comments": "I don\u0027t understand the hype or the fuss. There\u0027s relatively little variety of buildings, and very little control over how they\u0027re placed. The most irksome aspect for me as it that I can\u0027t build the sort of city I want. Everything is based around roads. Roads roads, and more roads. What about pedestrian zones? What about bicycle lanes? What if I don\u0027t want any roads at all and want aI don\u0027t understand the hype or the fuss. There\u0027s relatively little variety of buildings, and very little control over how they\u0027re placed. The most irksome aspect for me as it that I can\u0027t build the sort of city I want. Everything is based around roads. Roads roads, and more roads. What about pedestrian zones? What about bicycle lanes? What if I don\u0027t want any roads at all and want a ecologically sound city that\u0027s more like an arcology? Nope. It\u0027s roads or GTFO. . . . . . . Which would be vaguely forgivable if the roads actually worked well, but they don\u0027t. Road traffic simulation is pretty bad.… ",
    "gameID": 0,
    "author": "Kropotkin2000"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2015-05-02T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is AMAZING buy it now I\u0027ve put many hours inside this game PROS:The map is able to be really big and cities are really inventive and good looking the graphics are really awesome and good mods for this game are really like modification and add a lot to the game it really feels like your building a real city with real problems CON: traffic is a really big deal inThis game is AMAZING buy it now I\u0027ve put many hours inside this game PROS:The map is able to be really big and cities are really inventive and good looking the graphics are really awesome and good mods for this game are really like modification and add a lot to the game it really feels like your building a real city with real problems CON: traffic is a really big deal in this game so most of your time is building roads when your building any spacial building(schools parks etc) all your see is Slope to steep height high etc Summary if you have been a fan of sim city but was disappointed by the new one this is the game for you… ",
    "gameID": 0,
    "author": "Batman529"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-05-03T00:00:00.000Z",
    "score": 9.0,
    "comments": "This is what SimCity 5 should have been. Cities: Skylines is better in pretty much every aspect, with the biggest points for me coming from: full modding support, editors, offline-play, working systems, and massively bigger city sizes. I love this game and have already sunk several dozen hours into it.",
    "gameID": 0,
    "author": "Toffenuff"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-05-04T00:00:00.000Z",
    "score": 9.0,
    "comments": "This is what SimCity aspired to be and this is what we expected it to be. Absolutely brilliant; probably the best city-building game since SimCity 4. You can build huge cities and can play offline. These two points alone already make it a better game than the latest SimCity.",
    "gameID": 0,
    "author": "abraham_b"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-05-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "The game itself is a 8.5 It\u0027s a wonderfully fun city builder that doesn\u0027t do anything wrong. I give it a 10 because: - it is only 30 bucks - it is actively supporting community created content. ( you can fly helicopters first person now through your city for christ\u0027s sake!) - it is a big huge F you to anything that is wrong with triple A publishers and their ever growingThe game itself is a 8.5 It\u0027s a wonderfully fun city builder that doesn\u0027t do anything wrong. I give it a 10 because: - it is only 30 bucks - it is actively supporting community created content. ( you can fly helicopters first person now through your city for christ\u0027s sake!) - it is a big huge F you to anything that is wrong with triple A publishers and their ever growing anti-customer behaviour Cities: Skylines is a love letter to the genre, to gaming, to gamers and it\u0027s customers. And it is a PC exclusive!… ",
    "gameID": 0,
    "author": "ireviewthings1"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-05-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "Truly the greatest City simulation game I ever played. Hats of to the developers. I really enjoy playing this game. The future looks bright with updates to come",
    "gameID": 0,
    "author": "Irresisti"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-05-10T00:00:00.000Z",
    "score": 9.0,
    "comments": "As a long time sim fan I was skeptic after I bought this game. Because surely, no one could possibly bypass the original Simcity? My skeptic mood faded within minutes after launching the game! Game play feels very intuitive and so do the mechanics. The details are stunning so zooming in and hopping along with your citizens to drive through town is a great experience. I haven\u0027t been ableAs a long time sim fan I was skeptic after I bought this game. Because surely, no one could possibly bypass the original Simcity? My skeptic mood faded within minutes after launching the game! Game play feels very intuitive and so do the mechanics. The details are stunning so zooming in and hopping along with your citizens to drive through town is a great experience. I haven\u0027t been able to feel this level of game addictiveness in years! There are still things that leave room for improvement, but to me those are small issues as the base game is really great! - I feel there could be a bit more variety in buildings - The pastel colors of the vehicles tend to give it a sugary childish look - Not all road and rail tracks bends have textures - Chirper is annoying and doesn\u0027t seem to add anything to the game - No tunnels -yet- (they are working on it though) - Addictive + Option to activate mods and assets in-game + Very intuitive + Highly detailed + Roads are easy to place and don\u0027t have many restrictions + Back to basic: this is what playing a sim game should be all about! + The district option is a very helpful feature + Huge maps + Addictive… ",
    "gameID": 0,
    "author": "Estroyer"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-05-13T00:00:00.000Z",
    "score": 8.0,
    "comments": "If you look at city builder games you have Simcity as the inventor of the genre but since the last game in that series they left a gap to be taken by another game series. Paradox Interactive might arguably still not have created a game which does everything right, but the things it does it does well. The core mechanics work fine and good. The only thing that makes it really difficult afterIf you look at city builder games you have Simcity as the inventor of the genre but since the last game in that series they left a gap to be taken by another game series. Paradox Interactive might arguably still not have created a game which does everything right, but the things it does it does well. The core mechanics work fine and good. The only thing that makes it really difficult after you basic city is getting the traffic under control. For all the city builder games I played this has enough depth to be interesting but is not over complicating things either. Besides the basics what makes this game truly stand out over the product EA created is the ability to create and use mods with the game. This makes the experience better and creates a lot of good will in the player community. Overall I really appreciate the product that has been created and truly enjoy playing city builder games again. Almost thought this was a lost art but then Paradox came and showed us how it is done.… ",
    "gameID": 0,
    "author": "biert"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2015-05-14T00:00:00.000Z",
    "score": 7.0,
    "comments": "This review contains spoilers, click expand to view. I do not have to say anything more. But i need to write one hundred and fifty characters. i think my score can describe it............................… ",
    "gameID": 0,
    "author": "tsakiym"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-05-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "Very nice game, lovely made, nice features and an amazing modding community. SOmetimes the polygon count is to low, but generally its a fine peace of work. Have fun playing it.",
    "gameID": 0,
    "author": "CakeFox"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-05-17T00:00:00.000Z",
    "score": 8.0,
    "comments": "For a city building game, this is the best out there. Cities XL and Simcity don\u0027t even come close to this \u0027not too simple and not too complicated\u0027 building experience. You can mod practically any aspect of this game. The maps are wonderfully detailed and the nature of how to build water systems and train lines is so easy to learn you\u0027ll have a replica of the London underground in a day. IfFor a city building game, this is the best out there. Cities XL and Simcity don\u0027t even come close to this \u0027not too simple and not too complicated\u0027 building experience. You can mod practically any aspect of this game. The maps are wonderfully detailed and the nature of how to build water systems and train lines is so easy to learn you\u0027ll have a replica of the London underground in a day. If you\u0027re a fan of sandbox games and city building games (coming from someone with not a huge like on city builders) you will love this!… ",
    "gameID": 0,
    "author": "TrilobiteG"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-05-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "Отличный симулятор которому не хватает совсем немного до идеала. Маст хэв для фанатов.",
    "gameID": 0,
    "author": "TonyKontana"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-05-22T00:00:00.000Z",
    "score": 9.0,
    "comments": "This is a great city game. Design, flow, all of it. Solid from the bottom up. I do have to take away a mark because it doesn\u0027t take advantage of half decent rigs and up. You\u0027re limited in how many zones you can take, and all that stuff, because they didn\u0027t want the game to be unplayable on POS computers. I should have an option in the game where my system specs let me do more. I haveThis is a great city game. Design, flow, all of it. Solid from the bottom up. I do have to take away a mark because it doesn\u0027t take advantage of half decent rigs and up. You\u0027re limited in how many zones you can take, and all that stuff, because they didn\u0027t want the game to be unplayable on POS computers. I should have an option in the game where my system specs let me do more. I have a 6 core I7, with 16 gigs of ram, with a total of 8 Gigs of video ram on two cards. I would be taking off 2 points here but modding lets people bypass this limitation to a degree. I strongly recommend this game to anyone who enjoys city games.… ",
    "gameID": 0,
    "author": "Tick"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-05-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "SimCity 4 in 3D. Nothing else to say. But since the review needs to be longer, I\u0027ll say this: It\u0027s SimCity 4\u0027s level of awesomeness and SimCity 2013\u0027s level of Traffic Jams. But it\u0027s not SimCity 2013\u0027s level of Roads to Traffic Jam on.",
    "gameID": 0,
    "author": "ggggggggg"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-05-23T00:00:00.000Z",
    "score": 9.0,
    "comments": "Truly a fun game to play if you want to create your own city,It is addictive and fun.The game can let you create your own city that needed your creativity to work.Spending hours of creating a city that you wanted to create.Cities:Skyline is a well-made city builder game.",
    "gameID": 0,
    "author": "JohnKristofer"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-05-27T00:00:00.000Z",
    "score": 8.0,
    "comments": "An overall good city builder game. However, it is too easy to play. You will spend most of your time managing the traffic problems. Other aspects of the game is not challenging and thus becomes boring quickly.",
    "gameID": 0,
    "author": "ronaldlee0917"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-05-30T00:00:00.000Z",
    "score": 9.0,
    "comments": "One of the best city builder games. Pros: - FREE UPDATES and FREE CONTENT being released by developers, for example, TUNNELS and NEW BUILDINGS. - ENORMOUS maps - ENORMOUS modding community - Transport feels ALIVE and your subtle alterations can have huge impacts on the effeciency of transport. - Game LOOKS great. - SIMULATED POPULATION breaths life into cities. - EXCELLENTOne of the best city builder games. Pros: - FREE UPDATES and FREE CONTENT being released by developers, for example, TUNNELS and NEW BUILDINGS. - ENORMOUS maps - ENORMOUS modding community - Transport feels ALIVE and your subtle alterations can have huge impacts on the effeciency of transport. - Game LOOKS great. - SIMULATED POPULATION breaths life into cities. - EXCELLENT FEEDBACK in-game explains how to upgrade your buildings. - MAP EDITOR to create unique maps. - ASSET EDITOR to create unique buildings and upload user models. - PRICE is VERY REASONABLE. - ability to build RAISED ROADS and HIGHWAYS leads to very realistic and imaginative creations. Cons: - CHIRPER THING AT THE TOP OF THE SCREEN IS BIG, BULKY, AND GETS IN THE WAY OF VIEWING CITIES. - Game is quite EASY. - Not a huge number of special buildings. Eg. Police stations, hospitals. Fortunately this is fixed by the ENDLESS MODDING COMMUNITY. - Not a huge variety of POLICIES that can be implemented. Policies are very basic and implemented without much depth.… ",
    "gameID": 0,
    "author": "MetaAwesome"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-05-31T00:00:00.000Z",
    "score": 10.0,
    "comments": "well to be honest there is only one way to describe this game. this game is beautiful it is magniflorious it is the best city builder game i have ever played and if you have not got this game yet and you are still playing simcity you should be ashamed you should be so ashamed you should not even be called a gamer. this is the one game that stood forth and put sims city to shame. and aboutwell to be honest there is only one way to describe this game. this game is beautiful it is magniflorious it is the best city builder game i have ever played and if you have not got this game yet and you are still playing simcity you should be ashamed you should be so ashamed you should not even be called a gamer. this is the one game that stood forth and put sims city to shame. and about time too. so enough blabbing about why you should buy it lets focus on the game and its community. where do i start the modding community is huge i mean massive and also one of the best. and the main game oh my the game is amazing the graphics are indescribable the variation of vehicles is amazing they use a different variation of colour for every vehicle and a massive variety of building designs. and that\u0027s all i will say if i was to describe the full game i would reach the max character limit of 5000 words the game is that expansive and it will always be the game simcity wanted to be and it will probably be that way until the world ends. and wow this is one of the longest critic reviews i have ever written and i ain\u0027t much of a critic.… ",
    "gameID": 0,
    "author": "lowaverage"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 7,
    "date": "2015-06-02T00:00:00.000Z",
    "score": 3.0,
    "comments": "I can see why this game is well received among leisure players. They hate SimCity so much that they vote for Cities in which provided what they asked for. But seriously, this game inner system is quite shallow. I said this after playing over 100 hrs on both games. There are so many things that you can\u0027t really make logical senses out of the system. All transportation system, policies,I can see why this game is well received among leisure players. They hate SimCity so much that they vote for Cities in which provided what they asked for. But seriously, this game inner system is quite shallow. I said this after playing over 100 hrs on both games. There are so many things that you can\u0027t really make logical senses out of the system. All transportation system, policies, zoning are meaningless and not contributed to efficiency, wealth or growth of the city.… ",
    "gameID": 0,
    "author": "iampakky"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-06-02T00:00:00.000Z",
    "score": 8.0,
    "comments": "Good simulator, intuitive and overall better than others. A lot of space for cities and lot of thing you can build. Also this game has workshop, so there will be new content. Just traffic is a bit problem in this game, play slow and make saves.",
    "gameID": 0,
    "author": "empleat"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-06-04T00:00:00.000Z",
    "score": 9.0,
    "comments": "A modern take on city building simulation. Supports mods extensively and does not have the classical grid system. The car AI is scripted though. I would have expected something more intelligent, but it\u0027s good enough for a game of this magnitude.",
    "gameID": 0,
    "author": "MihaiKrieger"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-06-07T00:00:00.000Z",
    "score": 8.0,
    "comments": "Cities: Skyline is the greatest city builder of recent years. It provides a great balance between complexity and usability and is also boasts an incredibly intuitive and sturdy road building mechanic. The game has a decent aesthetic and replayability is quite high. The amount of content and updates from the developers is lacking however this is completely overshadowed by the moddingCities: Skyline is the greatest city builder of recent years. It provides a great balance between complexity and usability and is also boasts an incredibly intuitive and sturdy road building mechanic. The game has a decent aesthetic and replayability is quite high. The amount of content and updates from the developers is lacking however this is completely overshadowed by the modding support, and its community that have continuously strived to make additional content for the game. Each mode of transport does have seem to have some aesthetic bugs/quirks but doesn\u0027t take away from the overall experience. It is a great game overall and highly recommended.… ",
    "gameID": 0,
    "author": "Midds"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-06-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Basically just like Simcity but without the stupid DRM or bugs that it had like: -For the first part It works. Anyone who bought Simcity knows the launch woes it had and was unplayable for a week and then the bugs it had for a very long time(don\u0027t know if they ever got fixed and I played it for half a year on and off) -Offline gameplay I mean seriously who in EA thought it was a goodBasically just like Simcity but without the stupid DRM or bugs that it had like: -For the first part It works. Anyone who bought Simcity knows the launch woes it had and was unplayable for a week and then the bugs it had for a very long time(don\u0027t know if they ever got fixed and I played it for half a year on and off) -Offline gameplay I mean seriously who in EA thought it was a good idea to make it always online. Now it would be nice if paradox had some multiplayer gameplay but at least you can always play without worrying about your internet connection. -Modding support. EA swore up and down that Simcity couldn\u0027t be played offline only to be caught redhanded when some modders found a way to do it but of course EA put a stop to that which only goes to show the love that EA has for modders. Paradox on the other understands that modders help the game and it\u0027s exactly what it does. Heck I doubt there is a person out there playing cities skylines without mods. -Bigger maps. I like how they set it up where you start small and then grow big and grow big by buying lands which adds to the size of land you already have. and if you want to grow bigger there\u0027s a mod for that too. For the most part it\u0027s your basic simcity game that works and plays well and hopefully Paradox adds on to the game some cool features but if not there are always the modders out there working to make the game better which by the way a huge thanks to them for their work. This game is a must buy for any city simulator fan and those wanting to try it out. 10/10 because it works and you get your moneys worth at 30$ or more if you want the deluxe edition.… ",
    "gameID": 0,
    "author": "smuniz83"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2015-06-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "Truly fantastic. I have 90+ hours of pure fun and thinking. This truly just crushes all Sim City games, and all city builders. And, the good thing is that they are working on making it 2000 times better. I definitely recommend this.",
    "gameID": 0,
    "author": "matwanninger"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2015-06-23T00:00:00.000Z",
    "score": 5.0,
    "comments": "Dissapointed. Just like all latest city-games it focuses so much on roads and traffic. I was hoping for a chance to create large pedestrian paths in the suburbs. Nope.",
    "gameID": 0,
    "author": "clansfear"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 4,
    "date": "2015-06-28T00:00:00.000Z",
    "score": 0.0,
    "comments": "Waste of money. Game is only about a quarter finished with many missing features. The Devs have given up and opened up the steam workshop to let the community finish the game. The Devs on Steam are overzealous and ban for even the slightest criticism, like I asked why there is no Paint feature for tree\u0027s because it hurts my wrists clicking each individual tree in for hours. On theWaste of money. Game is only about a quarter finished with many missing features. The Devs have given up and opened up the steam workshop to let the community finish the game. The Devs on Steam are overzealous and ban for even the slightest criticism, like I asked why there is no Paint feature for tree\u0027s because it hurts my wrists clicking each individual tree in for hours. On the official map there are tones of bus like water running inland from the sea and one map there is no water current or alternative to wash away was water so you end up with a bay full of **** that just spreads and doesn\u0027t go anywhere. There are only like 10 different vehicle models, which sounds fin expect when you get hundreds of thousands of childish looking doughnuts driving around your street. So yeah, with heaving modding thanks to talented people this game is acceptable, but Paradox and Creative Order once again prove they are the lazyiest Devs about by putting out featureless games and saying the hard part is working around that.… ",
    "gameID": 0,
    "author": "CartoonHead"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-07-01T00:00:00.000Z",
    "score": 8.0,
    "comments": "This game is effin\u0027 GREAT. It\u0027s like they took SimCity, removed all the bad stuff, and multiplied the result by 10. Or 25, if we are talking about available city size - because that\u0027s how much bigger cities you can create in Cities Skylines. BUT this game still doesn\u0027t deserve a 10/10 or even a 9/10 - all because of the broken road system - it\u0027s not infrequent for citizens to use only oneThis game is effin\u0027 GREAT. It\u0027s like they took SimCity, removed all the bad stuff, and multiplied the result by 10. Or 25, if we are talking about available city size - because that\u0027s how much bigger cities you can create in Cities Skylines. BUT this game still doesn\u0027t deserve a 10/10 or even a 9/10 - all because of the broken road system - it\u0027s not infrequent for citizens to use only one lane, even thought 3 or 4 are given. This is a major problem, which can eventually destroy your city, because traffics jam everywhere means ambulances getting to their patients too late etc, garbage trucks will never reach their destination etc.… ",
    "gameID": 0,
    "author": "Hakrit"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-07-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best city builder in a long time. It has all the important aspects that a true city building, simulation game would need. Much more advanced than the simcity series.",
    "gameID": 0,
    "author": "GRater12"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-07-09T00:00:00.000Z",
    "score": 8.0,
    "comments": "This game is fun, don\u0027t get me wrong, but it gets boring REALLY fast. I like all the mod support and what it allows the Steam community to do what they do best. I hope this won\u0027t turn out like SimCity.",
    "gameID": 0,
    "author": "RaidenXel"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-07-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "I started out with City Builder games with Sim City 4. That game was so good that I carried on playing it until my cds got too scratched up. I bought it again yet and continued playing it until the new Sim City where you have to cram you\u0027re city into a very tight space. No longer with Cities: Skylines. Way better than Sim City 4 and that terrible Sim City game. It is addicting and you canI started out with City Builder games with Sim City 4. That game was so good that I carried on playing it until my cds got too scratched up. I bought it again yet and continued playing it until the new Sim City where you have to cram you\u0027re city into a very tight space. No longer with Cities: Skylines. Way better than Sim City 4 and that terrible Sim City game. It is addicting and you can make huge cities that go on for miles, make winding roads. You can name just about anything. You can even name tiny little people walking around in your city. Anything but streets which I find weird but it doesn\u0027t bother me. This game is the perfect city builder and if anything that you would find missing from the game, the modding community has it. BUY THIS GAME.… ",
    "gameID": 0,
    "author": "omalley"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2015-08-15T00:00:00.000Z",
    "score": 8.0,
    "comments": "The proper alternative to the buggy and terribly un-creative SimCity, this game truly delivers to its purpose, make a good city-building game that delivers a fun expereince. Brilliant.",
    "gameID": 0,
    "author": "Annoymous1"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-08-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "This game is so good. But, I think that It has an error. For example, factories have a stock (full). And they can\u0027t sell. Also, stores can\u0027t get enough goods. What is reason about this error? Please fix this error.",
    "gameID": 0,
    "author": "jaehong"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-08-26T00:00:00.000Z",
    "score": 8.0,
    "comments": "Great game with outdated graphics. Good interface, enough buildings, great modding abilities, no permanent online requirement. ABility to built really large and complex cities. A lot of freedom while making up plans. What annoys me are the graphics. I want to build a beautiful city and really experience how beautiful it is. Unfortuantely the visuals are pretty bad. Eeven on highest qualityGreat game with outdated graphics. Good interface, enough buildings, great modding abilities, no permanent online requirement. ABility to built really large and complex cities. A lot of freedom while making up plans. What annoys me are the graphics. I want to build a beautiful city and really experience how beautiful it is. Unfortuantely the visuals are pretty bad. Eeven on highest quality settings. Well if you play the game longer you will get over the bad graphics and still have a great addictive gaming experience. Probably the best city builder of the last years. Only Tropico 5 comes close. But with better garphics the cities would have been so much more beautiful, impressing and realistic. So because of the dissapointing graphics I cant give the game more than a 80 score.… ",
    "gameID": 0,
    "author": "lightyears"
  },
  {
    "helpfulCount": 32,
    "helpfulScore": 4,
    "date": "2015-08-30T00:00:00.000Z",
    "score": 0.0,
    "comments": "No replayability, difficult to design cities, sandbox mode not highlighted, lots og bugs! I really regretted buying a copy of this game. It could have been great but was a nightmare. The interface is really different as well",
    "gameID": 0,
    "author": "rahulgomez2025"
  },
  {
    "helpfulCount": 94,
    "helpfulScore": 5,
    "date": "2015-09-02T00:00:00.000Z",
    "score": 4.0,
    "comments": "Be aware of hyped games right? When this game came out I was in the middle of a SimCity 4 Lets Play and I will compare these two games. I will not list all the quirks and bugs but try to give you an overview of the gameplay: In a nutshell CS is a traffic simulator with added city builder while SC4 is a city builder / manager game. Budget controls in CS are simpler. You can\u0027t get aBe aware of hyped games right? When this game came out I was in the middle of a SimCity 4 Lets Play and I will compare these two games. I will not list all the quirks and bugs but try to give you an overview of the gameplay: In a nutshell CS is a traffic simulator with added city builder while SC4 is a city builder / manager game. Budget controls in CS are simpler. You can\u0027t get a breakdown of your cost per department (like pipe maintenance, water pumps etc.). You can not change budgets for individual buildings (like a school in a low density district or vice versa). When you want to enact policies it does not estimate the costs for you. Tax control is less fine grained than SC4. Here is the typical gameplay for CS: Build roads, level up, build more roads and buildings, level up, build more of the same, level up....you see a pattern here. The game practically forces you to build a \"nice\" and \"green\" city that satisfies all the citizens needs. In SC4 you are allowed to approach your citiy with different methods. You can build a high tech city, a business city, a gritty industrial town, a small farming community and so on. Plus all these cities can somehwat interact via the region mode. Of course in SC4 you build zones, grow, build more, add buildings etc. But you are challenged with more problems. IN CS you have to manage traffic, thats it, the rest is just grinding up. In SC4 you can get some persistant problems like unemployment, slums, pollution (air, water, nuclear..though not noise which is a nice addition in CS). I really miss the region mode where you can have a bustling metropolis and some suburb type communities around. Verdict: CS offers nothing more than SC4 except nice graphics if you are into bright colors. CS feels more like a sandbox city builder while SC4 is a proper city management and building game. Maybe CS gets there with mods and DLCs...but right now it is not recommended. If you enjoy building a nice looking city without too much difficulty..go ahead and buy CS...if you like a variety of challenges go for SC4. CS is not a bad game. It is a good game in fact if you like to build cities and manage traffic (where SC4 is far inferior without mods). But it just did not click with me. There is not enough management and too much building and tinkering with roads for my taste.… ",
    "gameID": 0,
    "author": "blackbird1"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2015-09-06T00:00:00.000Z",
    "score": 8.0,
    "comments": "Note: I have played the first version that includes no real patches for the game, so I might be listing problems that aren\u0027t there anymore because they have been fixed. Great graphics for a city builder, looks like a game from a triple AAA team although you can see the holes from them not being one at the time of creation, the major flaw being the lack of buildings or maps in the game.Note: I have played the first version that includes no real patches for the game, so I might be listing problems that aren\u0027t there anymore because they have been fixed. Great graphics for a city builder, looks like a game from a triple AAA team although you can see the holes from them not being one at the time of creation, the major flaw being the lack of buildings or maps in the game. Enjoyed it for a solid 15-20 hours but ended up with a great amount of cash and the only real thing you were doing is just expanding, sounds like a weired criticism but I think were I\u0027m trying to get to here is that it could of done with a bit more challenge in it or some events that changed the theme a bit. Also there was no real tutorial whatsoever and had to figure stuff out by yourself, most of it was pretty intuitive but I feel they could of tried to explain or at least have a text in the options or help section for the public transport which can get pretty complex and results in trial and error most of the time. You feel a bit lonely in the game because you never really hear anything from anyone, no objectives to do no nothing, only a stupid little bird on top that you couldn\u0027t remove till a future patch. It\u0027s ok I guess, I feel that if it wasn\u0027t for the major downfall of the Simcity game back in 2013 this game wouldn\u0027t of received half of the critical acclaim it had and still is receiving. Hopefully with the money they get they can create an even better game in the future and give some competitivness in the market for the genre which I will receive open handed.… ",
    "gameID": 0,
    "author": "rubencristiano9"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2015-09-07T00:00:00.000Z",
    "score": 5.0,
    "comments": "A good City Builder game, however I discovered it to be quite boring after a very little amount of time. The upgrade system is good, as are the graphics and general layout, but it was far too slow-paced for myself.",
    "gameID": 0,
    "author": "BenHazelden"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-09-14T00:00:00.000Z",
    "score": 9.0,
    "comments": "Back in 1996, a cousin introduced me to the first SimCity, and it just blew my mind. I was accustomed to games being fairly linear affairs, giving the player a lot of tightly orchestrated fun but very little control. In time I moved my strategy PC gaming from city simulation to stuff like Civilization and Heroes of Might and Magic, in no small part because, after SimCity 2000, most gamesBack in 1996, a cousin introduced me to the first SimCity, and it just blew my mind. I was accustomed to games being fairly linear affairs, giving the player a lot of tightly orchestrated fun but very little control. In time I moved my strategy PC gaming from city simulation to stuff like Civilization and Heroes of Might and Magic, in no small part because, after SimCity 2000, most games in the genre failed to really entice me in a big way. Cities Skylines, however, managed to rekindle the proverbial spark, especially because developer Colossal Order seems hellbent on undoing all the damage done by EA\u0027s immensely disappointing SimCity reboot a few years back. So yeah, forget all about that always-online crap, or the offensively tiny city sizes, or the lack of features. Cities Skylines works because it doesn\u0027t try to reinvent the wheel, instead focusing on the simple stuff that made those 90\u0027s city sims so addictive in the first place. It perfects several tried-and-true mechanics, such as residential, commercial, and industrial zoning, as well as the spread of electricity and sewage/water supply. Almost everything here seems like it was design to cut the fluff and allow you to focus on the actual fun part of making your city prosper. One of the defining characteristics of Cities Skylines is its focus on customization. And that\u0027s obviously awesome; after all, if I\u0027m building my own cities, I want them to be unique, with their own structure, monuments and landmarks. For this purpose, the game features an extensive set of editing tools, encouraging players to try and bring their own ideas to life. If you\u0027re not editing-inclined, worry not: it\u0027s extremely easy to browse the Steam Workshop for new assets to add to your city-building options, from real-world buildings and landmarks (although, to be honest, I can\u0027t for the life of me understand why anyone would want those things in their custom city; but hey, that\u0027s me) to a large amount of original stuff, including alternate designs for the in-game assets. But that\u0027s not all: at this point, savvy creators have already came up with some very useful mods, allowing you, for example, to better manage your bus/subway lines, to zoom in and take a first-person walk through the streets, or even to fly a plane over the city. This process of creation will obviously continue for as long as the game remains popular, adding more replay value to a title that already has lots of it. Of course, city simulation involves many different variables, meaning some less-than-polished aspects are bound to show up from time to time. Sometimes a building will have a crime problem that doesn\u0027t seem to get solved even when you surround it with police stations; other times your landfills won\u0027t send out its truck fleet even with a huge, six-lane road clearly in front of it; or maybe you\u0027ll have a lack of workers on industries that just won\u0027t go away, no matter how many residential areas you build nearby. These problems can get frustrating sometimes, but they\u0027ll more often be submerged by the sheer amount of stuff that works great. You could say the city simulation genre was one of the big epiphanies in my gaming life, and Cities Skylines more than does it justice. It\u0027s an addictive, well-designed, ambitious title that actually knows why these strategy games tend to glue enthusiasts in front of the computer, making it by far the best city sim released in a long time. Rating: 9.0… ",
    "gameID": 0,
    "author": "ricklongo"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2015-09-15T00:00:00.000Z",
    "score": 7.0,
    "comments": "Overall I would recommend this game to others, however I feel like the game is limited in a lot of aspects. I hate to compare the game to SimCity at all because overall SimCity was just not very good but there are a few things that SimCity got right such as expanding onto a building, for example, adding more garages to an already existing fire department. I also love all of theOverall I would recommend this game to others, however I feel like the game is limited in a lot of aspects. I hate to compare the game to SimCity at all because overall SimCity was just not very good but there are a few things that SimCity got right such as expanding onto a building, for example, adding more garages to an already existing fire department. I also love all of the specialization in SimCity that I\u0027m having a hard time finding in Cities, such as gambling. I really liked how you could see everything actually happening in SimCity, for example, if someone went to school, you would actually see them physically go to the school (by the way there are no school buses here). However, I do understand that each and every person actually doing something in the game could cause it to run slower or use too many resources. I love how big the maps are in this game and overall I\u0027d give the graphics a 7/10. Even with the graphics turned all the way up on my PC, there seems to be some fade in the corners, I suppose this helps the game run smoothly but on a top notice PC I feel like I shouldn\u0027t be seeing that. I\u0027d love to see this game go to the extremes though. I mean I\u0027d even like to see things such as cell phone towers added in and having the responsibility of maintaining coverage, as well as other things such as ISP and Cable TV contracts and things of that nature. I\u0027d just like to see more of what really goes on in a city, in Cities: Skylines. My biggest complaint is that there just isn\u0027t enough to do in the game.… ",
    "gameID": 0,
    "author": "Jrud05"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 6,
    "date": "2015-09-28T00:00:00.000Z",
    "score": 5.0,
    "comments": "Cities Skylines is a traffic simulator dressed up like a city builder with basic budget. The new dlc \" CS AfterDark\" is a nonsense, the industry works day and night, the children go to school the day and night, ect ect ^^",
    "gameID": 0,
    "author": "redrik"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2015-10-04T00:00:00.000Z",
    "score": 6.0,
    "comments": "Alright, listen up: I\u0027ve created like 6 cities so far, all of them are now completely screwed, most of them have no power or water, some are flooded and others are complete fail. I DON\u0027T KNOW HOW TO PLAY THIS GAME, IT DOESN\u0027T HAS A TUTORIAL, I CAN\u0027T FIGURE OUT HOW TO PLAY IT. halp",
    "gameID": 0,
    "author": "Luizzrz"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-10-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "Very fun game, i like it. Sim City made a lot of mistakes, and Cities Skylines tried to avoid them. Good job Cities Skylines. The After Dark DLC is awesome.",
    "gameID": 0,
    "author": "vladhp"
  },
  {
    "helpfulCount": 24,
    "helpfulScore": 3,
    "date": "2015-10-23T00:00:00.000Z",
    "score": 0.0,
    "comments": "Game is unplayable !!! The font is so small that it is impossible to use a larger TV screen. That 18 months has passed and this insane irregularity has not been dealt with by the dev is outrageous.",
    "gameID": 0,
    "author": "ValetinGabaev"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-11-21T00:00:00.000Z",
    "score": 9.0,
    "comments": "IT`S THE BEST CITY BUILDER SIM OF ALL TIME i think. Mod-ability, Cities up to 1,000,000+ , Great Devs, Great Community, My Favorite Game. 200+ hours OF FUN!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "gameID": 0,
    "author": "krebal"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2015-12-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "Absolutely amazing! I can\u0027t wait for this game to release on Xbox One! Who knows, maybe this can be a new IP for PC and Xbox One!!!! PC gaming has such good potential on Xbox One.",
    "gameID": 0,
    "author": "Trainzfan333"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2015-12-24T00:00:00.000Z",
    "score": 7.0,
    "comments": "A very fun game which is the city builder you want it be. It will challenge you with traffic and waste management, to design smooth city layouts. My only complaints would be that after a time it gets a little slow, it certainly has a peek where after that point you are accomplished and have no motivation to keep managing this city... So then you start all over again! If a person isA very fun game which is the city builder you want it be. It will challenge you with traffic and waste management, to design smooth city layouts. My only complaints would be that after a time it gets a little slow, it certainly has a peek where after that point you are accomplished and have no motivation to keep managing this city... So then you start all over again! If a person is seeking a city simulator this one is the best.… ",
    "gameID": 0,
    "author": "TimW001"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2015-12-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "Waiting more then 10 years for a functionally moddable citybuilder makes you kinda think its impossible and give up. But then comes the day when you think youre about to fall of you chair, and then realize you never need to leave it again. Because Skylines has it all. Sure, it has a few setbacks like the railways and the messy roundabouts etc. but nothing that in a long shot makes the gameWaiting more then 10 years for a functionally moddable citybuilder makes you kinda think its impossible and give up. But then comes the day when you think youre about to fall of you chair, and then realize you never need to leave it again. Because Skylines has it all. Sure, it has a few setbacks like the railways and the messy roundabouts etc. but nothing that in a long shot makes the game go bad. Hello citybuilder, welcome back, you have been away for so long!… ",
    "gameID": 0,
    "author": "RedWulfr"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2016-01-08T00:00:00.000Z",
    "score": 6.0,
    "comments": "I assume that you have read other reviews, played the game, or watched videos of the game, so I won\u0027t get into what the game is or how to play it. As a fan of Sim City, SC 2000 and SC 3000 I am very impressed with CS\u0027 take on the genre. It\u0027s the game Sim City wanted to be but couldn\u0027t, due to the limits of the technology of the time. It gets an A+ for bringing the genre into the 21stI assume that you have read other reviews, played the game, or watched videos of the game, so I won\u0027t get into what the game is or how to play it. As a fan of Sim City, SC 2000 and SC 3000 I am very impressed with CS\u0027 take on the genre. It\u0027s the game Sim City wanted to be but couldn\u0027t, due to the limits of the technology of the time. It gets an A+ for bringing the genre into the 21st century and for designing the game with mods in mind. Colossal Order also seems to be spending a lot of effort responding to players\u0027 issues and working to improve the game. Now for the cons. After playing for months, starting over at least a dozen times, and reading countless articles and watching videos detailing traffic strategy, I still have lots of traffic jams. I have highways branching into big roads then medium roads then small roads; I\u0027ve analyzed where my Cims are coming from and where they\u0027re going to; I\u0027ve re-zoned and de-zoned and moved buildings; I\u0027ve added, deleted, re-routed, upgraded and downgraded roads; I\u0027ve added buses, subways, trains, taxis, walking paths, bike lanes and airports, just to see my traffic problems move from one area of the city to another. I know that it shouldn\u0027t be easy but I\u0027ve paid my dues and should be a traffic expert at this point. Oddly, I can have miles of traffic jams, hundreds of people standing for hours at bus stops, and a \"happiness\" rating of 92-95%. It takes time to empty landfills and graveyards (do they empty graveyards in real life? I\u0027m pretty sure grandma is still in the same place we buried her thirty years ago.) In my current city, at about 120,000 Cims, I had to run an elevated passenger train from the north to the rail line on the south. I paused the game, as I was going to be demolishing and moving lots of roads and buildings and it would upset my Cims. After finishing, I started to run the train tracks. I discovered I couldn\u0027t run the tracks over my graveyard (I didn\u0027t try raising the tracks more, but it\u0027s too late now in any case). I had to un-pause the game to let the graveyard empty (or I could have demolished another north-south corridor and had a bigger mess to clean up). My Cims became very unhappy, crime and fire soared due to areas being cut off from services, and my population and tax revenue dropped. My next con is also related to the same train track addition. On the roads that had to be demolished were two metro stations, so they had to be moved. I didn\u0027t discover for ten game-years that the subway tracks and routes didn\u0027t move with them; I spent ten years with a non-functioning subway system. I also had to re-do a dozen bus routes, as they were designed to bring people from neighborhoods to metro stations. A simple north-south train line took me two weeks (real life weeks) to complete. There were tons of little problems to deal with after I thought the job was done. It was all work and no play, and at the end I felt like I\u0027d been mugged by Mike Tyson. I know it\u0027s probably not feasible without re-writing the game from scratch, but the mayor shouldn\u0027t be doing the same tasks at 100,000 Cims as he was doing at 1000. There should be a way to delegate tasks to the AI as a city grows. If the game play could transition from building roads and laying water pipes in small towns to handling issues of economics and politics in big cities, THAT would be awesome. My final con is the dreaded \"DEATH WAVE\" (I\u0027m going to add the dreaded \"NOT ENOUGH WORKERS\" wave in with this). It\u0027s one issue I find totally inexcusable. It should never have made it past beta testing. After fighting the game for two weeks on my train track addition, my first death wave hit. My city went from 120,000 cims to 80,000. ONE THIRD of my population died. I have tons of hospitals, a clean water supply and nobody lives on polluted land. Then it passed... for a while. Since the initial wave I\u0027ve been getting mini-death waves every year for the last TWENTY-FIVE game-years. I\u0027ve been going from death wave to death wave to death wave. I\u0027ve had no demand for any new zoned areas and haven\u0027t grown my city at all. All I\u0027m doing is building crematoriums during waves to handle the bodies, turning them off after the wave to save money in my budget, just to have to turn them all on again to handle the next wave. That is ALL I\u0027ve been doing for the last (have I mentioned it before?) TWENTY-FIVE YEARS! I\u0027m so peaceful I make Gandhi look like Attila the Hun, but I\u0027m ready to punch my monitor, set my PC on fire, and drop-kick my dog just for good measure. Would I recommend this game to a friend? As much as I\u0027d like to say \"yes\", I can\u0027t. Hopefully, Colossal Order will fix the issues keeping this game from being totally awesome, but the game as it is today (01/08/2016) is more headache than fun. I\u0027ll probably continue playing, but now it\u0027s personal... I refuse to let the game beat me and I\u0027m going to fill a map from border to border if it kills me (but I promise not to kick my dog).… ",
    "gameID": 0,
    "author": "ScubaDude"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2016-01-10T00:00:00.000Z",
    "score": 7.0,
    "comments": "It is a fine city building game, and a superb successor of SimCity games of old, but maybe I have become too used to goal oriented or compaign based city building games. I really missed having to deal with real emergencies or a changing world. The worst that happens is if you mess up something yourself by poisoning your citizens by pumping poluted water, or flooding parts of city with aIt is a fine city building game, and a superb successor of SimCity games of old, but maybe I have become too used to goal oriented or compaign based city building games. I really missed having to deal with real emergencies or a changing world. The worst that happens is if you mess up something yourself by poisoning your citizens by pumping poluted water, or flooding parts of city with a misplaces damn. And the single progression there is of unlocking based on city size, is a progression you have to go through every time you start a new city, which just feels like such a let down after having had access to all those options in your last game. Still a good game though.… ",
    "gameID": 0,
    "author": "Carewolf"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2016-02-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "Downright the best game I have ever owned. Brilliant graphics, superb simulations (w/ help of mods) and unlimited possibilities. 10/10 Would recommend.",
    "gameID": 0,
    "author": "Teamdark6"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2016-02-23T00:00:00.000Z",
    "score": 8.0,
    "comments": "Very good game, the reason i\u0027m giving it points off is that it doesn\u0027t have an incredible amount of replayability. The modding support, map editor, and the vast amount of options should keep you decently busy for a while though.",
    "gameID": 0,
    "author": "philip3242"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2016-03-10T00:00:00.000Z",
    "score": 9.0,
    "comments": "Fantastic game. One of my favourite things to do is fix up my traffic problems. Sorting out roads and organising tube lines - I could lose hours and hours turning red lines to green. Mod support has been essential to the game\u0027s longevity, with some great designers creating fantastic mods. My only criticism would be the end game. In Sim City you had a point to each (tiny) city,Fantastic game. One of my favourite things to do is fix up my traffic problems. Sorting out roads and organising tube lines - I could lose hours and hours turning red lines to green. Mod support has been essential to the game\u0027s longevity, with some great designers creating fantastic mods. My only criticism would be the end game. In Sim City you had a point to each (tiny) city, which you would eventually link together and support the building of a wonder. With C:S however you just expand your population. There are 5 or 6 \"wonders\" to build with various effects, but these will only add to the successful city you had to build to obtain them. So you expand until demand dries up - around 200k population for me - and give up. Getting to this endpoint however is a fantastic trip.… ",
    "gameID": 0,
    "author": "123456"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2016-03-20T00:00:00.000Z",
    "score": 9.0,
    "comments": "I was a huge fan of SimCity 4 and have been searching for a modern city builder that could satisfy my simulation needs for quite some time. I am thrilled that I discovered this game after being let down by Cities XL, and extremely let down by the new SimCity. Cities Skylines is a fun, detailed, and somewhat realistic city builder that brings back many good qualities of past games and addsI was a huge fan of SimCity 4 and have been searching for a modern city builder that could satisfy my simulation needs for quite some time. I am thrilled that I discovered this game after being let down by Cities XL, and extremely let down by the new SimCity. Cities Skylines is a fun, detailed, and somewhat realistic city builder that brings back many good qualities of past games and adds many new features. You can zone industrial and commercial areas to make certain goods to meet trading demands and use natural resources. There are many different types of transportation and flow very well with the city when properly implemented. You can make very large cities with populations in the hundreds of thousands, and the graphics overall are very neat to look at, especially in cinematic view. A few things I would have like to see different but aren\u0027t major flaws include not much interaction with citizens/automobiles on the road, the time settings aren\u0027t different enough, and building can go by rather slow depending on the status of your city. Overall though this is a must play if you enjoy city simulation games, I have spent many hours on my city, and plan to continue with all the amazing mods and add-ons that are available.… ",
    "gameID": 0,
    "author": "chronoT"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2016-03-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "Alles wat SimCity niet heeft heeft deze game weer wel leuke game om te spelen werkt perfect in begin wennen maar blijft een top game SimCity is niks meer waard",
    "gameID": 0,
    "author": "Collintjuh22"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2016-05-05T00:00:00.000Z",
    "score": 9.0,
    "comments": "The best current city-build strategy. It is not hard game like some other titles from the same category, it si more like sandbox and in fact, it is harder to do something bad. Game has quality mechanisms, comfortable graphics design, nice soundtrack and good UI. My only problems has been with trainz, where is possible to create some deadlock situation. Summary great title for a nice price.",
    "gameID": 0,
    "author": "baris697"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2016-06-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "Definitely the best city builder/manager ever made until now. Things you \"may\" not like may be the relaxing recurring background soundtrack and the kinda-diorama style, don\u0027t get me wrong, I like both but I think they are the only things that someone may not like about this game, because everything else is pure awesomeness. One of the greatest achievements this game earned is thatDefinitely the best city builder/manager ever made until now. Things you \"may\" not like may be the relaxing recurring background soundtrack and the kinda-diorama style, don\u0027t get me wrong, I like both but I think they are the only things that someone may not like about this game, because everything else is pure awesomeness. One of the greatest achievements this game earned is that you can both play this game as a casual: building roads, services and enjoying your city growing, and as micromanagement maniac: setting district policies, modifying budgets, fine-tuning assets and many, many other things. Heck you can even watch the life of your citizens from when they move into your city till they die (possibly old, if you correctly managed pollution and health-care). If I\u0027d like to point out a flaw on this game I may say that performance is not that great (at least on linux) and that anti-aliasing is really bad (barely works), but it doesn\u0027t hurt that much I guess. So, well, get this game if you ever thought you may enjoy creating or managing a city (or actually even a village or idk, almost everything with buildings and roads on it) or just get it anyway since it\u0027s worth the money it costs. Just one warning: don\u0027t look at this title for SimCity-like challenge. This game is far more about fine-tuning, cleaning and beautifying your city than struggling to keep it alive, facing cataclysms and such, and sorry if I repeat myself, Cities Skylines does it extremely well, best city manager so far by a good margin.… ",
    "gameID": 0,
    "author": "smilzoboboz"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2016-06-21T00:00:00.000Z",
    "score": 9.0,
    "comments": "A simcity we always wanted. This game crept on me unexpectedly. I wasn\u0027t aware it\u0027s coming out, haven\u0027t heard anything before it released and was really positively surprised when it came out. This game is good. It really is. It\u0027s a city builder that just makes sense. The graphics are amazing. The sound, the ambience - everything is as you would like it to be. Even more they\u0027ve addedA simcity we always wanted. This game crept on me unexpectedly. I wasn\u0027t aware it\u0027s coming out, haven\u0027t heard anything before it released and was really positively surprised when it came out. This game is good. It really is. It\u0027s a city builder that just makes sense. The graphics are amazing. The sound, the ambience - everything is as you would like it to be. Even more they\u0027ve added day and night cycle for free. It\u0027s really enjoyable to build a city here. You get a wide array of tool that lets build the city in the way you want to. You will need to keep an eye on traffic and population happiness. Not really much more to say. At this point probably the best sim city like game out there.… ",
    "gameID": 0,
    "author": "agurczuk"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2016-07-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "Amazing graphics, Good gameplay. No bad points to be made for this amazing city builder. Huge maps, with lots to build and things to consider hen building and designing cities.",
    "gameID": 0,
    "author": "RIchieh007"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2016-07-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "[german/deutsch] Cities:Skylines ist ein Aufbausimulations-Strategiespiel und bietet vor allem sehr viel Abwechslung beim Bauen, eine schöne optische Aufmachung und ein allgemein positive Spielerfahrung.",
    "gameID": 0,
    "author": "LimitedEdition"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2016-08-16T00:00:00.000Z",
    "score": 10.0,
    "comments": "Cities: Skylines (I have the Steam version) is what SimCity should have been, but EA failed. So an Indie Team called \"Colossal Order\" took the City Builder genre in their hands and made it happen. Cities: Skylines has everything from sandboxes, custom made buildings/cars, and more. Best of all it\u0027s moddable for those who like that kind of thing, you can have mods replace a certain vehicle,Cities: Skylines (I have the Steam version) is what SimCity should have been, but EA failed. So an Indie Team called \"Colossal Order\" took the City Builder genre in their hands and made it happen. Cities: Skylines has everything from sandboxes, custom made buildings/cars, and more. Best of all it\u0027s moddable for those who like that kind of thing, you can have mods replace a certain vehicle, building or even plant. The mods go in-depth and make Cities: Skylines expand into a game that you can put countless hours into. As a plus side, you can sync your game saves to \"Steam Cloud\" (if you are using Steam) so you can have them on the go if you have different computers. From one minute you could be the cleanest city in the game, but in minutes you can have the dirtiest city in the world, have poop take over, flood everything and get people sick. This is one of the best City Building games ever made, and you can spend countless hours building your own city, your own way. It\u0027s like playing with LEGO\u0027s but now, you are your own creator in building your own city. I think the best thing I learned about this game is that this game was made by 10(ish) people. Colossal Order proves that you don\u0027t need 40 people working on the game, it might get the job done faster, but the game will be missing many features due to budget problems.… ",
    "gameID": 0,
    "author": "azgoodaz"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2016-10-06T00:00:00.000Z",
    "score": 9.0,
    "comments": "Cities: Skylines is a nice city builder game. I quiet enjoyed playing it however for the first time it was really difficult to start with it. It is different from other city builder like SimCity but graphics and controls are really easy to use. Graphics are very nice and neat as well! Good game!",
    "gameID": 0,
    "author": "atisfix"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2016-12-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "This game is very fun and addictive. However it is annoying that the DLCs are so expensive. There\u0027s also no way to get a monorail system into your city as of writing this, it has all other transportation systems you can imagine, but no monorails.",
    "gameID": 0,
    "author": "MzDanish"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2017-02-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "Sencillamente fabuloso. Da casi libertad total para crear una ciudad. El añadido de mods le da mucha mas variedad y además puedes crearte tus propios espacios. Los menús son fáciles de entender, el control es muy cómodo y los gráficos son muy realistas para este tipo de juegos. 100% recomendable.",
    "gameID": 0,
    "author": "rrafemi"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2017-03-02T00:00:00.000Z",
    "score": 8.0,
    "comments": "I like this game and I think it is much better than others with same kind, but I still miss that \"joy\" feeling from Simcity. Maybe adding some fun features (no dissasters please) would do right work for me.",
    "gameID": 0,
    "author": "Grza"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2017-03-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "So far the best city building game of all. There are millions of assets, props, mods in the workshop will turn this game to another whole level, it gives the game infinite possibilities. Just google some designer player and watch their finished cites, those will blow your mind.",
    "gameID": 0,
    "author": "leimingdun0"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2017-05-21T00:00:00.000Z",
    "score": 5.0,
    "comments": "This game contains very little possibilities to adjust and tune up anything at all. In Sim City 3000 over 25 years ago, you have much more options to make impact in game. There is very little or nothing fine tune in game and most of blocks seems to just live \"their own life\" without any players interaction. After 4-5 maps this game became very repetitive and very boring. There is justThis game contains very little possibilities to adjust and tune up anything at all. In Sim City 3000 over 25 years ago, you have much more options to make impact in game. There is very little or nothing fine tune in game and most of blocks seems to just live \"their own life\" without any players interaction. After 4-5 maps this game became very repetitive and very boring. There is just not enough content in this \"basic version\" of game. Probably idea was to sell more of content in those DLC / expansion set.… ",
    "gameID": 0,
    "author": "Arod_"
  },
  {
    "helpfulCount": 270,
    "helpfulScore": 7,
    "date": "2017-05-22T00:00:00.000Z",
    "score": 9.0,
    "comments": "Rewrite... in march 2015, I thought - Simcity 2013 better than CS:S. Now: With mods - 9/10. UI - 6/10; Graphic - 8/10; Steam Workshop - 10/10; Functionality - 10/10;",
    "gameID": 0,
    "author": "MakeyBx"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 6,
    "date": "2017-06-19T00:00:00.000Z",
    "score": 5.0,
    "comments": "Cities: Skylines is barely a decent game. Comparatively EA’s 2013 Sim City was a disaster, and that’s one reason Cities has done so well. However, I don’t think it will replace Sim City 4 Deluxe on my shelf anytime soon. Cities has a solid foundation, but its limitations are glaring. Without mod support and DLC, Cities is an average experience with no innovation. Cities looks fantasticCities: Skylines is barely a decent game. Comparatively EA’s 2013 Sim City was a disaster, and that’s one reason Cities has done so well. However, I don’t think it will replace Sim City 4 Deluxe on my shelf anytime soon. Cities has a solid foundation, but its limitations are glaring. Without mod support and DLC, Cities is an average experience with no innovation. Cities looks fantastic and runs smoothly. While zoomed in, I see bustling sidewalks and speedy cars zipping around my tidy neighborhoods. There’s enough detail to feel immersive, but not so much as to overwhelm older (or weaker) hardware. Load times can be a bit long tho. At first, city building is not all that different from Sim City. Players need to connect to an external highway, build roads, run utilities, designate zones, and watch as their cities come to life. Once populations reach certain points, players get access to more buildings and services. Each citizen has a name, address, education level, age etc. Players can select an icon above a citizen or car to automatically follow them around. Unfortunately, once towns hit 30,000 or so citizens, Cities’ shortcomings become apparent. Foremost, Cities lacks variety. All buildings look similar. Players can’t build space centers or towering skyscrapers. No army bases or national parks. No private schools or hockey rinks. Towns look generic. Players can’t micromanage stats either. Socioeconomic policies are rudimentary and have negligible impact. Tax revenues are too generous. City building merely entails constructing some roads and zoning for residential and business. That’s about it. What a startling lack of innovation. Cities is so featureless that players debate its merits over Sim City 4, a game which launched 12 years earlier. Town services are horrid. Landfills pile up insanely quick. There’s no sewage processing, so all sewage is pumped directly into waterways that become polluted within a few hours of play. Creative players will find ways around this. I’ve used in game assets to create my own sewage processing facility (no mods), but doing that ate up massive swaths of valuable real estate and tax revenues. Power stations are anemic. At early levels, the better stations are heavy polluters and resource hungry. And even little towns will need multiple stations or acres of wind turbines. Players will need to build dozens of cemeteries, police/fire stations, schools to service relatively small footprints. Players can’t connect multiple towns together. That was a fan favorite feature in Sim City. So each town must be self-sufficient. The game automatically exports/imports goods to and from imaginary neighboring towns. Players can’t arrange trade agreements. Cities tries to offset this limitation by providing players a larger sandbox. But it’s just not the same as linking a mining town to a farming community or a suburb to a technology hub. As towns grow larger, Cities devolves into a traffic manager simulation. Unexperienced players will likely rage over this. The Cities’ AI is laughably stupid. Vehicles always travel the shortest route regardless of obstructions or traffic. By default, they will not take detours or travel alternate routes. I’ve seen dozens of big rigs pile up on a dirt road but ignore a 6 lane highway one red light away because the route was 1 or 2 miles longer. Bus stops can have a dozen or more buses piled up and blocking traffic for 10 blocks. Train stations, docks, and airports will be flooded with unbearable congestion. The worst part about traffic is how early it wrecks towns. New players will need to commit hours of trial and error to fix traffic problems in even the smallest, most basic towns. Not managing traffic will shut towns down completely. Businesses won’t receive deliveries. Power plants won’t receive fuel. Traffic can be managed, but not effectively. I’ve built towns with 300,000+ citizens and spent half my time rerouting roads. The process resulted in the destruction of meticulously zoned sections. Without mods, traffic is helplessly broken even with the latest DLC. Players can’t send tornadoes ripping the suburbs nor can they summon earthquakes. That requires DLC. Want to see your town at night? DLC. Like snow? DLC. Cities is a barebones package without DLC. Unfortunately, the DLC’s have their own shortcomings. The other deficits—and there are plenty—require mods to fix. Thankfully, the mod community for Cities is robust, and many of its shortcomings are addressed by dedicated fans at no charge. Without those, I wouldn’t be playing Cities at all. Thanks to its fans, Cities can be fun. Cities: Traffic Manager Simulator should only be purchased on sale. It’s an incomplete package that requires DLC, mods, and tweaking to make it a decent experience. Sim City 4 Deluxe might be showing its age, but it’s considered the gold standard by many gamers for good reason.… ",
    "gameID": 0,
    "author": "captainkane"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2017-08-19T00:00:00.000Z",
    "score": 9.0,
    "comments": "By far the best city builder of this generation and since SimCity 4. Great graphics, fully 3d engine, and runs smoothly and with few glitches. The traffic/public transport simulation is one of the most addicting aspects of the game, it has a lot of depth and it is addicting spending time building and altering transit lines and building roads (that can be easily curved orBy far the best city builder of this generation and since SimCity 4. Great graphics, fully 3d engine, and runs smoothly and with few glitches. The traffic/public transport simulation is one of the most addicting aspects of the game, it has a lot of depth and it is addicting spending time building and altering transit lines and building roads (that can be easily curved or elevated/tunneled) in order to increase traffic flow. The variety of included buildings is decent, and there is a great variety of mods and assets - that are continuously created and updated - that drastically increase gameplay options and provide a much more personalized and enjoyable gaming experience. It is also remarkably easy to install and update them - just a matter of subscribing to them once online. No need to manually download and unpack files. Definitively a key core component of the game. Unfortunately I cannot give the game a perfect score because it suffers from a big, big drawback: size limitations. Yes, the allowed build-able area is much larger than SC2013, but that is really not saying much. The default 9 obtainable tiles add up to only 36 km squares, only a little more than two large SC4 (which allows for almost unlimited number of tiles at the cost of a shallower game simulation) tiles side by side. Now, there are mods that increase the maximum allowed number of obtainable tiles from 9 to 25 or even all 81 tiles, but then chances are (especially with the latter) that you will run into hard-coded limitations, such as 65k agents, a one million population limit, and most notably, around 32k road segments and nodes, that will halt to a stop any further growth in your city, very early on, unless you are playing in maps with lots of water and/or mountains. These limits have been imposed by the developers to maintain smooth performance across a wide range of PC configurations, with, sadly, no option for people with PCs that can handle the load to increase said limits. Because of the difficulty (or impossibility) in doing so, no mods have been released dealing with these limits, other than one increasing the number of trees. So caveat emptor. Also, lack of medium residential density and farming zoning - you must use ordinances to ban growth of skyscrapers or allow farms in industrial zones, tedious at best, Farming is also affected by the fact that zoning is limited to four squares deep (making them look totally out of scale, more than other things in-game other than the airports, which, for that matter, do almost nothing) beyond a road and best done in fertile areas only - basically, needlessly making it a much more complicated affair than in SC4, even with mods, as with these one is forced to manually plop/paint and decorate fields to visually simulate said farms. Many other minor complaints in vanilla (i.e. deathwaves, must build roadside first, etc.) that are easily fixable with mods. For the price, 30$ at launch, you cannot beat it though. It is a great bargain. As for the DLCs, I believe all of them are worth as well, except the disasters pack, which I do not own and cannot comment as I never cared for them in any city simulator game. But you do not require them to have an enjoyable experience, or to use user created content, for that matter (other than ones created specifically for content introduced in these DLCs).… ",
    "gameID": 0,
    "author": "crishy"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2017-08-31T00:00:00.000Z",
    "score": 9.0,
    "comments": "Хорошая игра, лучший градостроительный симулятор. Конечно не без багов. Играю со всем комплектом дополнений.",
    "gameID": 0,
    "author": "Ilya2017"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2017-11-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game sucks my life. Period. I am a veteran of city builder genre and I have to say that Cities Skyline is the BEST CITY BUILDER game I\u0027ve ever played. What makes it so standout is the TRAFFIC SYSTEM which is REAL. Unlike most other games in this genre that calculate traffic problem by statistic, this game use real driving vehicles. Building road and transportation have never beenThis game sucks my life. Period. I am a veteran of city builder genre and I have to say that Cities Skyline is the BEST CITY BUILDER game I\u0027ve ever played. What makes it so standout is the TRAFFIC SYSTEM which is REAL. Unlike most other games in this genre that calculate traffic problem by statistic, this game use real driving vehicles. Building road and transportation have never been this fun and challenging before. One U turn or wrong road placement can create a massive problem, not only because people will be late at work but all utility services are also delivered by vehicles. No matter how many fire station, garbage collector, police, clinic .... etc you have built, if the traffic is dead, these vehicles will not get to your people, thus create waves of a mess. ; In other games, as long as you have big money in your pocket, you can solve everything. This game is required more brain than that. The more you expand your population, more traffic problem will come. Apart from fantastic traffic system, this game also has everything you would normally want in Cities Building genre. Graphic is good depending on your PC spec. Size of the map is very huge, unless you are very devoted city builder (and good enough to deal with colossal population), you have more than enough. This game support mods. Actually, I would like the game to have more depth in other area too, not just traffic, for example, economy manipulation. I also feel like the game needs more content at mid-late game. However, since the PRICE is SO CHEAP. Only 30 USD at start, and now mostly you could buy it less than 20 USD. I understand that I cannot compare this game with AAA game attitude. You have gain more than what you have spent. That is why I give it a 10/10 which is very hard for someone like me to give. (I bought this game when steam has good discount, I paid approximately 7-8 usd, I mean seriously, super worthy game compared with the amount I paid for. I would not mind at all if I have to pay 30, it is still cheap for what you get ) In sum, If you like this genre, buy it !! you will have no regret. PS. I didn\u0027t buy any DLC yet because they are expensive if compared with base game. This review is solely for vanilla… ",
    "gameID": 0,
    "author": "pongkrit03"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2017-11-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "A great successor from Simcity 4. With mods and everything in between. 3D gaming never looks so good. And it makes sense of accomplishment too! Also buy Mass Transit.",
    "gameID": 0,
    "author": "ajyto"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-01-06T00:00:00.000Z",
    "score": 8.0,
    "comments": "It\u0027s like stepping into a time machine. You start the game Friday afternoon and suddently it\u0027s 2 am on Monday and you haven\u0027t eaten or fed your cat in two days.",
    "gameID": 0,
    "author": "TantFuriosa"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2018-02-01T00:00:00.000Z",
    "score": 9.0,
    "comments": "One of the best PC-Games ever. There is not a different City-Building-Game that can touch this one. The Mod-Support brings it to a whole other level.",
    "gameID": 0,
    "author": "TheCornflex"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2018-02-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "OH YEAH, my 2 review at cities skylines, the result was 7, but now is 10. due to lags \u0026 crashs, but they are fixed.",
    "gameID": 0,
    "author": "Review123"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2018-02-26T00:00:00.000Z",
    "score": 8.0,
    "comments": "The best game in the genre of urban planning. Very interesting and a lot of fun. I recommend!",
    "gameID": 0,
    "author": "Nazar228"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2018-03-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is what a city builder should be. After EA\u0027s... issues... This game stepped up to the plate and hit a home run.",
    "gameID": 0,
    "author": "jdowling"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2018-03-19T00:00:00.000Z",
    "score": 10.0,
    "comments": "Esse foi o único jogo que realmente lembrou muito o Sim City 2000 no PS1 eu jogava muito, apesar de não parecer, fica muito semelhante quando se joga com os gráficos no baixo, eu acho bacana mesmo, toda complexidade da cidade é muito boa, vou tirar um tempo pra jogar mais agora.",
    "gameID": 0,
    "author": "Innarik"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2018-04-03T00:00:00.000Z",
    "score": 6.0,
    "comments": "I agree with captainkane and Junambo, at first games looks great, especially in comparison with last Sim City from EA. This joy lasts about 6-10 hours, and then you realize, that game lacks variety and challenges(at least interesting), like no pandemics, fires or organized crime. And also I agree that when you get large city (30 000 - 40 000 ), you understand that the most of your time youI agree with captainkane and Junambo, at first games looks great, especially in comparison with last Sim City from EA. This joy lasts about 6-10 hours, and then you realize, that game lacks variety and challenges(at least interesting), like no pandemics, fires or organized crime. And also I agree that when you get large city (30 000 - 40 000 ), you understand that the most of your time you spent by planning and building roads and handle the traffic. Sure it is a good game, but it lacks the depth like SimCity 4 and variety. Also, I didn\u0027t like the gameplay idea that you could not upgrade any buildings(except roads and pipes), you should demolish the old building(fire department or police) and build the new one when a city grows.… ",
    "gameID": 0,
    "author": "denwer"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2018-04-05T00:00:00.000Z",
    "score": 9.0,
    "comments": "Absolutely superb game, I\u0027ve racked up nearly 2000 hours on this. One criticism I do have is the traffic. So stubborn and will only ever use one lane, which without mods causes endless traffic problems. Thankfully, due to the 100% support and encouragement of mods by the devs, this can easily be changed. Thank you for such a wonderful game.",
    "gameID": 0,
    "author": "ollyhinge11"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2018-04-20T00:00:00.000Z",
    "score": 10.0,
    "comments": "Recently, the genre of urban simulators has always been unlucky. Servers SimCity cool players at the time of its release. The recent Cities XXL was a trivial hoax. Studio Colossal Order, responsible for the development of the recently released Cities: Skylines, until now was known only for a series of transport simulators Cities in Motion. Let\u0027s be honest: from the new game we did notRecently, the genre of urban simulators has always been unlucky. Servers SimCity cool players at the time of its release. The recent Cities XXL was a trivial hoax. Studio Colossal Order, responsible for the development of the recently released Cities: Skylines, until now was known only for a series of transport simulators Cities in Motion. Let\u0027s be honest: from the new game we did not expect anything supernatural. But often good things appear when you do not expect them at all. This is what happened in the case of Cities: Skylines. This game resembles a kind of hodgepodge, collected from the successful ideas of the genre. Unlike the last SimCity, there are no \"micro-polis\" here, so it\u0027s not necessary to suffer from compact building. Initially, at your disposal comes a small square of land with the minimum amount of necessary resources, but as the city grows its borders can be significantly expanded. Each cell has its own characteristics: the availability of different types of resources, a source of water, acceptable for settlement of the landscape. It is also important to have external relations that allow you to export goods and attract tourists to your city. Coping with an insanely overgrown metropolis will not be easy: it\u0027s even surprising how much the developers from the Colossal Order were confused with all sorts of subtleties. Instead of building specific buildings in Cities: Skylines, a zoning system is applied: you can take entire plots of land for living quarters, commercial or industrial complexes. This approach is well known to all the fans of SimCity and, in our opinion, is very justified. When 10-15 thousand people live in your city, the last thing you have enough time for is to build each new apartment house in the area on your own. However, if you want, you can plant trees one by one or demolish dilapidated buildings. With each new level in the game a lot of new functionality opens up. You hardly have enough money for all the new \"chips\". In addition, to manage them requires a lot of attention. For example, when placing wind farms it is necessary to take into account in what area the wind blows with maximum force. The water pipeline is designed in such a way that the water pump station is upstream, and the discharge pipe is at the bottom. And, of course, it is necessary to protect the source of water from pollution by nearby factories and plants. What can we say about the transport system: from the developer of Cities in Motion, the catch is not worth waiting here. Also you can independently outline the boundaries of the city districts. But the craziest thing in the plan is the ability to rename every building, every inhabitant and every car. You can also find out full information about the unit: where it goes, where it lives and what place it occupies among all social strata. However, to monitor the mood of each individual resident is simply impossible - the game is too big.… ",
    "gameID": 0,
    "author": "DarkBee"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-05-07T00:00:00.000Z",
    "score": 6.0,
    "comments": "This is a really honest review. I think Cities:Skllines\u0027s biggest problem is that it is too addictive. 2~3 hours just fly away if I play the game. The degree of addictiveness was so immense so I had to uninstall and delete the game. This game is suitable for really old people who has nothing but only plenty of time. Conclusion: Great game for killing time. Harzadous game for ordinary people.",
    "gameID": 0,
    "author": "susej79"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2018-07-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "I love this game, I love all the possibilities which are presented to the players, I think it\u0027s an excellent game which has a lot to give, I play it every day and I love all the possibilities. The game is very well elaborated I love it.",
    "gameID": 0,
    "author": "AlexBlasio"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-07-26T00:00:00.000Z",
    "score": 8.0,
    "comments": "Let me start by saying that this is my first city builder so I am coming at this with a fresh perspective and I am not comparing this to something like sim city because I have never played any of them. My experience in this builder style genre is exclusive with the roller coaster tycoon a few years ago. Let start with the positives. I love how even though this is a sandbox style gameLet me start by saying that this is my first city builder so I am coming at this with a fresh perspective and I am not comparing this to something like sim city because I have never played any of them. My experience in this builder style genre is exclusive with the roller coaster tycoon a few years ago. Let start with the positives. I love how even though this is a sandbox style game that really does not need any sort of progression system, there is one anyway. That is very important for players like me because I am fairly goal-oriented when I play games. Every time you get to a certain amount of citizens you are rewarded with new gameplay elements like roads, building, transportation systems and technology advancements (things like hydro and nuke energy). Cities is realistic in that if you put certain buildings next to each other, you could create issues with real-life problems such as pollution and noise. Also, as you advance through the game you are able to build more high density based buildings such as office buildings, housing, and commercial based businesses. Things like Zoning, traffic management, pollution control (especially in waterways), water and electrical availability are all very important and could cause many issues if not handled carefully. Of course like any good management game you can easily lose hours of your life just building and planning with total relaxation. The music is also very complementary to the relaxing nature of the game. Cities definitely has its faults but nothing too egregious. Maybe I am old fashion but I would have liked to see the developers be a bit more friendly in the way they present their game to new players. There is no tutorial system and while I don\u0027t see a need to hold anyone had, they could at least give us some tips on how to do the basics. I guess that is YouTubes job now. Also, the game is really bad at telling you what I wrong if you are making a mistake. For example, I was literally killing hundreds of my citizens due to dirty water. I could not figure out what was wrong for the longest time and it turns out I had a water tower too close to a ground pollution area. In reality, your stooges that work for the city would be able to tell you that. Kinda hard to see with all these buildings in the way. Also, the game seems to be lacking in detail. A lot of the buildings that are built have the same company name. How many box building companies do you really need? All in all, this really is a great city builder. I just wish they put a little more into the base game rather than make you pay $15 for expansions. I would have been willing to pay more for the base game if more was in it but I guess that is the way games are made these days. 8/10 Great. If you like this genre you need to give Cities a try.… ",
    "gameID": 0,
    "author": "hiltong55"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-09-03T00:00:00.000Z",
    "score": 7.0,
    "comments": "This is one of those games that you can spend hours designing and maintaining a society in your image, but the game itself is what seems to limit your imagination. Once you get so far, unlock everything, you\u0027ll begin to realize that there\u0027s no chance of failing, which unfortunately kills the challenge of the game altogether. I feel that this game starts strong, but becomes disposable asThis is one of those games that you can spend hours designing and maintaining a society in your image, but the game itself is what seems to limit your imagination. Once you get so far, unlock everything, you\u0027ll begin to realize that there\u0027s no chance of failing, which unfortunately kills the challenge of the game altogether. I feel that this game starts strong, but becomes disposable as the societies that you can effortlessly allow to collapse without any drawbacks. This game seems to be inconsistent due to this flaw.… ",
    "gameID": 0,
    "author": "jnorth5834"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-09-09T00:00:00.000Z",
    "score": 8.0,
    "comments": "No doubt its the spiritual successor of Sim city 4 and what SimCity 2000 should have been but never was. It´s a Good indie game with lots of cheaps dlc that adds excellent new features Losing 1 point due to no Multi-Player or other cities interaction where to actively export/ import goods. or cities products specialization Losing another 1 point because you cannot change o directNo doubt its the spiritual successor of Sim city 4 and what SimCity 2000 should have been but never was. It´s a Good indie game with lots of cheaps dlc that adds excellent new features Losing 1 point due to no Multi-Player or other cities interaction where to actively export/ import goods. or cities products specialization Losing another 1 point because you cannot change o direct architecture structures in the main gameplay… ",
    "gameID": 0,
    "author": "exequielborghi"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-10-19T00:00:00.000Z",
    "score": 7.0,
    "comments": "Do you want to build a city? Yes? Then it\u0027s the game for you. Do you have more than 50 IQ, a few bucks to spare and free time in the evenings? Great! Sit there, and play this game! Jokes on a side, it\u0027s super casual city builder. It\u0027s ok, but nothing fancy. I hate when people evaluate games on behalf of workshop and actual work of users, not devs. Devs did good job, but maybe theyDo you want to build a city? Yes? Then it\u0027s the game for you. Do you have more than 50 IQ, a few bucks to spare and free time in the evenings? Great! Sit there, and play this game! Jokes on a side, it\u0027s super casual city builder. It\u0027s ok, but nothing fancy. I hate when people evaluate games on behalf of workshop and actual work of users, not devs. Devs did good job, but maybe they could do better?… ",
    "gameID": 0,
    "author": "markjohnson7861"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-10-28T00:00:00.000Z",
    "score": 9.0,
    "comments": "This game is fantastic and is what Simcity (2015) Should have been. Some Examples: 1. A good map size 2: Residents have ONE house, they go to ONE job and they come home to that same house Minus one point due to DLC",
    "gameID": 0,
    "author": "WilliamReviews"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2018-11-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "This is easily the greatest game I\u0027ve played in a few years! It definitely has a way of wasting your time so efficiently. The workshop on steam really helps immersion.",
    "gameID": 0,
    "author": "noelanz"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-11-22T00:00:00.000Z",
    "score": 9.0,
    "comments": "Лучшая стратегия в своем роде. Лучший городостроитель который вообще существует. Убивает SimCity даже не стреляя. Как же круто дополняет игру даже такая мелочь как переименование улиц, зданий и т.д., с этим можно очень весело побаловаться. Например улица (Фамилия вашего бест френда) или \"улица разбитых фонарей\". Крч веселая игрушка, всем рекомендую)Лучшая стратегия в своем роде. Лучший городостроитель который вообще существует. Убивает SimCity даже не стреляя. Как же круто дополняет игру даже такая мелочь как переименование улиц, зданий и т.д., с этим можно очень весело побаловаться. Например улица (Фамилия вашего бест френда) или \"улица разбитых фонарей\". Крч веселая игрушка, всем рекомендую)",
    "gameID": 0,
    "author": "NotBanMePLZ"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-11-27T00:00:00.000Z",
    "score": 9.0,
    "comments": "I love this game! It\u0027s helping me to still stay creative. Shame that on my computer it freezes or crashes a lot..",
    "gameID": 0,
    "author": "infsai"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-12-08T00:00:00.000Z",
    "score": 8.0,
    "comments": "..........................................................................-",
    "gameID": 0,
    "author": "DovahK"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2018-12-09T00:00:00.000Z",
    "score": 3.0,
    "comments": "Very overpriced, 30FPS on GTX 1070. DLS cost practically as a full game. But good abilities and graphic.",
    "gameID": 0,
    "author": "Zodiac_A"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2019-01-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "This game is everything that SimCity 5 should have been. In addition to its great user interface, it actually SUPPORTS mods, a change from SimCity 5. You can make any city you want using assets from the Steam Workshop, which is set up really well and is easy to use. The only issue is that when your city gets large 3 and 2 simulation speeds don\u0027t actually work anymore, but it is nice to seeThis game is everything that SimCity 5 should have been. In addition to its great user interface, it actually SUPPORTS mods, a change from SimCity 5. You can make any city you want using assets from the Steam Workshop, which is set up really well and is easy to use. The only issue is that when your city gets large 3 and 2 simulation speeds don\u0027t actually work anymore, but it is nice to see your city functioning real time. The DLCs are great and every time they add something new that was a feature the community was asking for. All in all, a great game, and I have poured 1600 hours into it and never been disappointed with the variety of things you can do in the game.… ",
    "gameID": 0,
    "author": "SGTB"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-01-30T00:00:00.000Z",
    "score": 10.0,
    "comments": "My past experience with city builders was pretty much limited to the DS SimCitys. This game is far superior to those in every way. And it has mod support too! 10 out of 10",
    "gameID": 0,
    "author": "SirAwesomeness5"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-04-01T00:00:00.000Z",
    "score": 8.0,
    "comments": "Well I had some performance problems in the late game, but all in all, it´s running fine. As always a good game from Paradox. The graphics are ok but the most important thing is, building up your city is fun!",
    "gameID": 0,
    "author": "patrick33"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-04-10T00:00:00.000Z",
    "score": 8.0,
    "comments": "An an excellent city builder with so many options its crazy, once you start down the dark path of planning and building your city the hours will vanish. Supported by a huge amount of mods also!",
    "gameID": 0,
    "author": "GarethB"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-05-03T00:00:00.000Z",
    "score": 9.0,
    "comments": "The summit of city building in PC in the 201x. Great map size, offline mode, map editor, mod support, systems and systems and systems. Every OS supported. Good graphics and great gameplay. The only caveat may be that many features similar to Simcity are behind paywall, like winter, nightlife or disasters. But the game by itself is already a deep experience. A must for fans of city builders.",
    "gameID": 0,
    "author": "NezharMC"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-05-07T00:00:00.000Z",
    "score": 8.0,
    "comments": "игра класс, но оптимизации нет, и аи не очень",
    "gameID": 0,
    "author": "kveldby"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-06-14T00:00:00.000Z",
    "score": 8.0,
    "comments": "A near perfect city simulator, I can\u0027t stress enough how much this soars over SimCity 5. From the city planning, to the massive possible city size, there is clearly a god, and its name is Paradox.",
    "gameID": 0,
    "author": "Ominutsu"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-06-20T00:00:00.000Z",
    "score": 8.0,
    "comments": "Its difficult to pile on negativity with a simulation, simulations or management \"games\" are quite impervious to some criticisms, since they actually do what they set out to from the start. So when I say \"Cities: Skylines,\" is a great simulation, with hardly any flaws that aren\u0027t inherent to the internal systems employed by the game itself, that\u0027s strong praise. In essence, you areIts difficult to pile on negativity with a simulation, simulations or management \"games\" are quite impervious to some criticisms, since they actually do what they set out to from the start. So when I say \"Cities: Skylines,\" is a great simulation, with hardly any flaws that aren\u0027t inherent to the internal systems employed by the game itself, that\u0027s strong praise. In essence, you are building a city from the ground-up, and it not nearly as complex as it could be, but its nice to see the steady level of progression, as your fledgling town grows, expands, shifts, renovates, and improves to a massive city over time. All the amenities typical of this genre are included as well. You have your fire safety services, local police, educational systems, power generators, and of course internal plumbing. However, you have quite the range of experimentation in how you execute any of this in your own construction projects. You start with a blank slate, a small territory of randomly generated geography, and much like Simcity, you begin to set-up your various residential, commercial, and industrial zones, accompanied by streets, power grids, and pipes to supply your citizens with everything they need water-wise. Before long, your streets will crowd with traffic, power plants will burn up their fuel, and you\u0027ll have to employ more strategies to keep your city running optimally. Now this is where the flaws come in. Balancing a city is one thing, but balancing your infrastructure, ends up being more of a complicated task than I think most other city management sims. For one, roads are not ideal long-term, you\u0027ll need four lane roads, which are more expensive. People who really understand how the traffic simulation in this game works in-depth will typically disagree with you if you happen to call \"Cities\" more of a traffic management game than a city management game. However, I think both are true, but you\u0027ll realize that it does become a large chunk of sustaining and growing your city further. Roundabouts work for a long time, but are eventually in need of larger roundabouts, better entrances in and out of the city, even highway ramps are necessary. So it this case its perfectly permissible to feel overwhelmed when a something simple turns into a giant grid-locked nightmare and you are running out of money or options. I personally am still trying to figure out the traffic systems in this game. I\u0027ve watched people analyze it, read a lot of information on how to place them as optimally as possible, but its still a bit of a mixed bag to me. Its easily the worst part of the game itself, not bad, but overly complicated and sometimes very confusing. Of course you can test many of your theories out in real-time, practice makes perfect as they say, so this alleviates some of the frustration. I found that a typical starter city proceeds in the same way as most any other, and working your way past some of the complex path-finding can almost feel like, well for lack a of better term, \"buggy.\" Its not as buggy as I\u0027d like to think, but it does feel that way when suddenly no coal trucks can reach your coal power plant, and theirs very little indication as to why. Little niggling thing like that can hamper the experience, but you are in control every step of the way. Want to know why some vehicles are having a hard time reaching buildings? Pull up your traffic assessment tool. Want to know how valuable your areas are or what it will take for residential areas to upgrade? You can also look at a chart that shows high value land areas and it will even tell you what citizens need to upgrade. Its all pretty seamless, and its quite easily the best \"non\" Simcity game to come out in a long time. it draws many comparisons to Simcity 4, but its an entirely different beast. Visually the game is outstanding, it crams a lot of detail into these city-scapes and the nighttime view is amazing. The hustle and bustle of the traffic and people walking about makes it feel truly alive. The background music is a triumphant, wondrous score with some breathtaking melodies, but it is somewhat best left off or at least lowered in volume as it can drown out other sound elements. As far as a management game is concerned, you have the ability to do whatever you want within the confines of the games internal systems and I\u0027m happy to say it really has stood the test of time. Its hard to say what else could possibly outdo Cities: Skylines in the near future.… ",
    "gameID": 0,
    "author": "RigerWortis"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-08-17T00:00:00.000Z",
    "score": 7.0,
    "comments": "I like this game. It\u0027s good. I feel like it\u0027s just not as addicting as others say it is though. I barely ever come back to this. Building up a city is fun, then i just don\u0027t touch this game for months. It\u0027s not like i think it\u0027s bad. Like i said, it\u0027s good. I think it\u0027s stupid that a 7 is considered mixed. Anyways, good game. But not really worth the price tag for me. There are anI like this game. It\u0027s good. I feel like it\u0027s just not as addicting as others say it is though. I barely ever come back to this. Building up a city is fun, then i just don\u0027t touch this game for months. It\u0027s not like i think it\u0027s bad. Like i said, it\u0027s good. I think it\u0027s stupid that a 7 is considered mixed. Anyways, good game. But not really worth the price tag for me. There are an abundance of better games (in my opinion) that are cheaper.… ",
    "gameID": 0,
    "author": "Oreox4"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-19T00:00:00.000Z",
    "score": 8.0,
    "comments": "The game has everything that is missing in the latest Sim City. Fun for hours. I love it!",
    "gameID": 0,
    "author": "twinkeywinkey"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-23T00:00:00.000Z",
    "score": 8.0,
    "comments": "This is really a pinnacle of city sims out there. Highly recommended. If only they fixed bugs instead of relying on modding community...",
    "gameID": 0,
    "author": "Hermano999"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-10-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "Everything Sim City should be. Modifications and customizations gives the players option how to tweak their cities. Only drawback I experience is the performance issues when you have a bigger city. Traffic management is the way to destress after experiencing a 2-hour traffic jam yourself.",
    "gameID": 0,
    "author": "MazrimTaim14"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-10-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "It started as a 7, a good game in its own right. After a few DLCs which added very interesting content it became an 8. Then I discovered mods and the Steam workshop. 10/10. If it would lose points now it\u0027s only due to the amount of my life this game has consumed making me wonder what I could have been or achieved if I wasn\u0027t pretending to be both a mayor and a god in a small city.",
    "gameID": 0,
    "author": "Garbz"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-10-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "Paradox Interactive Steam Türkiye\u0027de oyunlarını dünyanın geri kalanına göre çok daha uygun, Türk alıcının bütçesine göre fiyatlandırıyor. Tüm firmalar Türkiye fiyatlarına fazladan kâr payı eklerken, Paradox süresiz bir indirim uyguluyor. Üstelik oyunların kalitesi tartışılmaz derecede yüksek. Bu süresiz indirim hali devam ediyorken alın, çünkü oyun sadece eğlenceli değil aynı zamanda zihinParadox Interactive Steam Türkiye\u0027de oyunlarını dünyanın geri kalanına göre çok daha uygun, Türk alıcının bütçesine göre fiyatlandırıyor. Tüm firmalar Türkiye fiyatlarına fazladan kâr payı eklerken, Paradox süresiz bir indirim uyguluyor. Üstelik oyunların kalitesi tartışılmaz derecede yüksek. Bu süresiz indirim hali devam ediyorken alın, çünkü oyun sadece eğlenceli değil aynı zamanda zihin açıcı bence.… ",
    "gameID": 0,
    "author": "hknyrbkn"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-11-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "I love city builder games and wanted another SimCity game for so long and wish I found this sooner. It can use more improvements and more in depth content but looking for a simple SimCity game to play pick this one up.",
    "gameID": 0,
    "author": "death12123"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-11-07T00:00:00.000Z",
    "score": 8.0,
    "comments": "Лучший градостроительный симулятор как по мне. Проще, чем последний сим сити, но в то же время более увлекательный.",
    "gameID": 0,
    "author": "RomanGor"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-11-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "Best city builder of all time. Highly detailed, you have to care about everything in your city. However, Paradox wants you to buy 100s of DLCs.",
    "gameID": 0,
    "author": "dzbnkx"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-11-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "Even after i got sick of average play, the amount of ways to make THE WORST CITY EVER was awesome, i still play it after months!",
    "gameID": 0,
    "author": "LAKottke"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-11-20T00:00:00.000Z",
    "score": 9.0,
    "comments": "Review castellano, Jugado en Gamepass, Pc graficos medios. No es necesario explicar de que se trata dado que es un simulador perfecto para crear tus ciudades, vengo de pasarme mas de 70 hrs construyendo y mejorando ciudades desde sus cimientos y puedo decir que es un simulador muy completo. Corrigieron muchos errores por el Pionera SimCity, pero en esta ocasion se agregaron formas deReview castellano, Jugado en Gamepass, Pc graficos medios. No es necesario explicar de que se trata dado que es un simulador perfecto para crear tus ciudades, vengo de pasarme mas de 70 hrs construyendo y mejorando ciudades desde sus cimientos y puedo decir que es un simulador muy completo. Corrigieron muchos errores por el Pionera SimCity, pero en esta ocasion se agregaron formas de agilizar tanto el trafico como la obtencion de recursos. Moderno y facil de jugar, con buenos tutoriales para lograr llevar tu ciudad a lo mas grande. Recomendado para jovenes interesados en aprender a gestionar recursos y lograr la mejor eficiencia. Y que mejor que su version incluida en gamepass de xbox.… ",
    "gameID": 0,
    "author": "Armywild"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-11-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "the quintessential city builder,I really enjoyed the hours I spent playing this game, it has a great learning curve, there is always something to try and learn (the game is a bit dependent cpu)",
    "gameID": 0,
    "author": "alvackzMX"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-12-05T00:00:00.000Z",
    "score": 9.0,
    "comments": "puedo decir,digo y diré que es mi juego preferido. Miles de horas invertidas en este juego ¡, si bien es cierto que se echan de menos elementos que disponían sagas clásicas como SimCity hace ya muchos años pero que recuerda mucho también a las grandes bondades de la misma saga anteriormente mencionada. Un juego con capacidades infinitas bastante realista, y decente a nivel gráfico. Sinpuedo decir,digo y diré que es mi juego preferido. Miles de horas invertidas en este juego ¡, si bien es cierto que se echan de menos elementos que disponían sagas clásicas como SimCity hace ya muchos años pero que recuerda mucho también a las grandes bondades de la misma saga anteriormente mencionada. Un juego con capacidades infinitas bastante realista, y decente a nivel gráfico. Sin duda en la versión de PC con los mods es la mejor versión de todas con una diferencia abismal, si no fuese por los mods este juego merecería bastante menos nota, pero gracias adiós, a la suerte o a lo que queráis existen y transforman para mejor este título. No voy a mentir cuando digo que deseo una segunda versión, cities skylines 2 con un mejor motor gráfico, bastante más realista y que sepa aprovechar mejor los recursos de un ordenador, que no consuma tantísima memoria RAM y tantísimo procesador aunque sé que es muy difícil con un juego de este estilo, cargando tantísimos props ycon tantísimos cálculos por segundo. En definitiva un merecido nueve gracias a los mods, a la comunidad que tiene y al ser la única opción viable de un simulador de ciudades.… ",
    "gameID": 0,
    "author": "MadBert91"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-12-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "The God/Goddes of City Builder Games. Its awesome to create and manage a City that looks full of life. The Game gave the freedom to build huge cities in sandbox Style or you can lost in real micro managing to create the perfect traffic system, education or whatever . A huge modder community supports you with cool mods amazing buildings and many more. But only with official dlc its massive.",
    "gameID": 0,
    "author": "Verence"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-12-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "It\u0027s a huge sandbox. And it\u0027s GREAT. Graphics are nice , even though stability it\u0027s not the best, but that\u0027s what you get when you have that big of simulation. It\u0027s amazing feeling to micromanage your bus station and subway, decorate your city to your dreams..",
    "gameID": 0,
    "author": "Damislav"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-12-21T00:00:00.000Z",
    "score": 7.0,
    "comments": "Muy bueno, aún sin dlcs, pero llega un momento en el que el tráfico es un problema...eso le resta puntos. Y también con el tiempo llega a aburrir.",
    "gameID": 0,
    "author": "ZetaJiffils"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-12-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best and most complete simulation and management game I\u0027ve ever played. Lots of different game mechanics and special attention to detail that makes all the difference. The game has many tools to explore and is not repetitive because there are several ways to make your city work. Plus, it\u0027s a little more complicated compared to others, which makes the experience even more challenging andBest and most complete simulation and management game I\u0027ve ever played. Lots of different game mechanics and special attention to detail that makes all the difference. The game has many tools to explore and is not repetitive because there are several ways to make your city work. Plus, it\u0027s a little more complicated compared to others, which makes the experience even more challenging and fun. I\u0027m giving a 10 regarding the available mods on Steam.… ",
    "gameID": 0,
    "author": "MiguelGordiano"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-12-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "O jogo promete tudo aquilo que o simcity não pode ter: jogabilidade, gráficos e trilha sonora. Esse jogo é indispensável.",
    "gameID": 0,
    "author": "matsantos"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2020-01-23T00:00:00.000Z",
    "score": 0.0,
    "comments": "So Paradox decided it\u0027s a good idea to release a launcher for Skylines. Which does absolutely nothing useful but just wastes your time. And even worse, doesn\u0027t even work on linux and mac, making the game quite literally unplayable there.",
    "gameID": 0,
    "author": "DarkTl"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-01-26T00:00:00.000Z",
    "score": 8.0,
    "comments": "Big carat, realism, spent nerves, beautiful graphics, and so on and so forth, I liked the game",
    "gameID": 0,
    "author": "GoodMorningAss"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2020-01-27T00:00:00.000Z",
    "score": 0.0,
    "comments": "5 years after release paradox interactive decided that its a good idea to release a new launcher that does absolutely nothing, steam couldnt do for years. Also they install their bloatware on hidden locations without asking the user for permissoin. Neither deleting Cities nor the launcher removes everything from it (the launcher). On top of that you cant reach their support wihout5 years after release paradox interactive decided that its a good idea to release a new launcher that does absolutely nothing, steam couldnt do for years. Also they install their bloatware on hidden locations without asking the user for permissoin. Neither deleting Cities nor the launcher removes everything from it (the launcher). On top of that you cant reach their support wihout creating an account and using their confusing ticketing system.… ",
    "gameID": 0,
    "author": "ihateuselesssof"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-01-31T00:00:00.000Z",
    "score": 9.0,
    "comments": "So far had 30h in and I\u0027m really enjoying it. All building mechanics are well thought out, the entire city simulation is thematically and visually very well built. The overall complexity of the game slowly increases which makes the learning curve very accessible. Only thing is that I underestimated the importance of traffic management. But I guess that\u0027s my mistake as I didn\u0027t check someSo far had 30h in and I\u0027m really enjoying it. All building mechanics are well thought out, the entire city simulation is thematically and visually very well built. The overall complexity of the game slowly increases which makes the learning curve very accessible. Only thing is that I underestimated the importance of traffic management. But I guess that\u0027s my mistake as I didn\u0027t check some hints. Music in overall set a pretty chilled mood without being too intrusive. It runs very smoothly even on my old Laptop when I\u0027m traveling. Really well done.… ",
    "gameID": 0,
    "author": "simrik"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-01-31T00:00:00.000Z",
    "score": 7.0,
    "comments": "Great city builder, FAR better than bugged unfinished SimCity. However this is really bad that they can\u0027t update the game with the CRUCIAL micromanagement features that modders do for free in their spare time. I don\u0027t like situations when for so long time, game are playable only with proper game fixing mods.",
    "gameID": 0,
    "author": "Tomaso"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-02T00:00:00.000Z",
    "score": 7.0,
    "comments": "Without dlc\u0027s it\u0027s a really medicore game nevertheless it\u0027s still enjoyable",
    "gameID": 0,
    "author": "Simoners"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-06T00:00:00.000Z",
    "score": 10.0,
    "comments": "Its everything you want from a city builder. Plus all the things you didn\u0027t know you needed! Then add on an active community that is passionate about keeping this the best of the best.",
    "gameID": 0,
    "author": "balcobulls"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-09T00:00:00.000Z",
    "score": 9.0,
    "comments": "This review contains spoilers, click expand to view. This Game is 100% better than Sim-City, Another Game that I love 1. Able to buy new Land 2. Build pipes and power cables by yourself 3. More realistic graphics But, here is things from Sim-City that I want in Cities Skylines 1. Multiple cities on one map 2. something as \"big monument\" I hate that amount of DLC\u0027s that are in the game and also poor optimization, when I was on my laptop my FPS was on 35, so not good for slower PC… ",
    "gameID": 0,
    "author": "ondra2435"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-24T00:00:00.000Z",
    "score": 0.0,
    "comments": "This review contains spoilers, click expand to view. Language (Turkish): Arkadaşlar şöyle bir şey düşünün. Sistemin çok yeni ve oyunlara yetecek kadar sistemin olsun ama sadece bir oyunda affedersin y****k gibi çalıştığını gördüğünüzü düşünün, ne yapardınız? Bence kesin rage quit yapardınız sinirinizle. Optimizasyonu ETS 2\u0027nin TruckersMP modundan bile beter. İllaki yüksek bilgisayar istiyorsa fazla mod için ben tek oyun için bilgisayar toplamam ya da yükseltmem asla. Bildiğin rezalet... Garry\u0027s Mod MetroStroi\u0027de de optimizasyon sıkıntısı mevcut ama hiç bu kadarı olamaz. Benim şehir nüfusu 120 bin, 2000 tane küsür asset ve 25\u0027e yakın modum var. 15-20dk\u0027da açılıyor ve bilgisayar ağlıyor (sistemim de kötü değil bu arada). Benim sistemim bu arada 12GB RAM\u0027e, RX 570 GPU\u0027ya ve R3 1300X işlemcim var, diğer oyunlarda paşa paşa kaldırıyor. Sonuç gerçekten rezalet... Oyunun mod desteği ve gelişmiş teknolojilerini beğendim diyebilirim ama bu oyun modsuz da olmuyor. DLC\u0027leri çok pahalı değil fakat hepsini almaya kalkışsanız çok pahalı oluyor. İçerikleri çok beğendim diyemem. Grafik ve detaylar muazzam gibi bir şey, çok beğendim ama yine de bazı yerlerde detaylar performans için kısıldığını görüyorum. Onun dışında harika. Simcity (2013) ile kıyaslandığında iğrenç optimizasyonu ve bazı eksiklikler dışında ezer geçer. Çünkü oyunda gelişmiş bütçe belirleme, şehir bölgeleri oluşturma gibi özellikler oldukça iyi yapıyor oyunu. Ek bir bilgi olarak optimizasyon için hala yama gelmedi. Yapacağım yapacağım demişsiniz nerede o yama? Bir de ben Paradox\u0027u suç atmıyorum, bunu ben Colossal Order\u0027ın suçlu olduğunu çok net bir şekilde söyleyebilirim. İşte oyuna puanım: Oynanış: 0/10 (Optimizasyon yüzünden) Grafik: 8/10 Özellikler: 9/10 Detaylar: 6/10… ",
    "gameID": 0,
    "author": "eilhanz"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "A City-building game, with all possibilitys you want and with a big modding community",
    "gameID": 0,
    "author": "Bauju"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-26T00:00:00.000Z",
    "score": 4.0,
    "comments": "Building is too non-intuitive and complex, building a pretty functional city is being hindered by non intuitive mechanics and bad UI.",
    "gameID": 0,
    "author": "Wiebe"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "The game is awesome and takes the city building genre to a new level. I only wish it was better optimised.",
    "gameID": 0,
    "author": "ioculus"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-06T00:00:00.000Z",
    "score": 0.0,
    "comments": "Genuinely the worst dev team in the business. Outright stopped Mac support in 2019, despite selling MILLIONS of games they are LEGALLY REQUIRED to support MacOS for. EVERY SINGLE parafail title has been pulled from MacOS, because the devs couldn\u0027t be bothered maintaining their stupid redundant launcher that literally not one single person ever wanted. These devs SUCK. 0/10Genuinely the worst dev team in the business. Outright stopped Mac support in 2019, despite selling MILLIONS of games they are LEGALLY REQUIRED to support MacOS for. EVERY SINGLE parafail title has been pulled from MacOS, because the devs couldn\u0027t be bothered maintaining their stupid redundant launcher that literally not one single person ever wanted. These devs SUCK. 0/10 outright f**king stole my money… ",
    "gameID": 0,
    "author": "paradoxfail"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-10T00:00:00.000Z",
    "score": 9.0,
    "comments": "[ ] Perfect [x] Awesome [ ] Good [ ] Good Bad [ ] Fail Não vejo necessidade em escrever um longo texto analisando uma arte, a nota é apenas um conselho para saber o quanto ela vale para sua vida. I see no need to write a long text analyzing an art, the note is just a piece of advice to know how much it is worth in your life.",
    "gameID": 0,
    "author": "SrCre"
  }
]
