[
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2018-02-24T00:00:00.000Z",
    "score": 6.0,
    "comments": "fun and good looking but I lasted 15h\ni am going to tell you i did not play this game with any friendsthis is a fun game where you got to learn different ways to defeat the next monster or find ways to kill the same monster over and over to get the right re... ",
    "gameID": 0,
    "author": "crazyking321"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-02-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "A fantastic deep and rewarding experience\nLet me begin by saying I am an absolute rookie to the series and have no base in terms of comparing it to previous installments. This game is ridiculous as far as content is concerned in the best way possible. I will ... ",
    "gameID": 0,
    "author": "hovast0rm"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 6,
    "date": "2018-04-10T00:00:00.000Z",
    "score": 5.0,
    "comments": "Sloppy game full of ridiculous cliches, annoying characters and mediocre gameplay\n3 hours was all I could stand of this game. From the very start, it became clear this is a VERY Japanese game, written and produced in Japan meant primarily for a Japanese audience with a half hearted attempt at making p... ",
    "gameID": 0,
    "author": "ooozephyrosooo"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-05-15T00:00:00.000Z",
    "score": 8.0,
    "comments": "Monster Hunter that surely will satisfy every type of player.\nI never played any Monster Hunter, so everything was new to MH World, the experience with the game was positive, the game is a lot of fun, the story is simple, but not a bad point, since game focuses on gameplay and expl... ",
    "gameID": 0,
    "author": "phantomdark"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-07-31T00:00:00.000Z",
    "score": 7.0,
    "comments": "Loved it\nSome people may find difficult or hard at first as they developed the characters movement in quite different way, I\u0027d say more accurate in the real life (I know far from what they can do but..) - slow to start up when kn... ",
    "gameID": 0,
    "author": "gladuhere"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-10-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Great game\nEl juego es incre\u0026iacute;ble en todos los aspectos, se debe de tener en cuenta que la experiencia dependera mucho de tu pc, en los foros se quejan mucho sobre este tema, sin embargo es un juego hermoso, cualquiera que am... ",
    "gameID": 0,
    "author": "miketn"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-12-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Review from someone who actually spends 6 month in the game\nSpent around 1000hour into this game, got 2nd attack gem on my 600 hour mark and also killed about 400 arch tempered beast before quiting just after Extreme Behemoth event and have every sullied or hero streamstone you c... ",
    "gameID": 0,
    "author": "sakaixx"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-12-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "Monstertastic!\nPrior to Monster Hunter World the Monster Hunter series was already a well known and hugely successful series having sold more than 45 million copies worldwide as of January 2018.However having only previously played a v... ",
    "gameID": 0,
    "author": "xselphie1999x"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-02-03T00:00:00.000Z",
    "score": 8.0,
    "comments": "Team up with friends and slay giant beasts!!!\nMonster Hunter: World is the first MH I have ever played and I\u0027m glad I did because from what I hear this entry was one of the best in the series!! You start off by picking your character class and then you get your wea... ",
    "gameID": 0,
    "author": "SilentAssassin"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2020-03-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "yea\nMonster hunter worlds is too big for streaming and too big for gamer pcMonster hunter worlds runs very very very slowly (2f/second) only has monsters, very unintuitive (alabone???), and too many pixels, trex is too many ... ",
    "gameID": 0,
    "author": "alexveryfunny"
  }
]