[
  {
    "helpfulCount": 60,
    "helpfulScore": 23,
    "date": "2018-08-09T00:00:00.000Z",
    "score": 10.0,
    "comments": "This beautifully implemented port is a perfect PC introduction to the joys of Monster Hunter ! My Gametime will reach 24h for every day !!! Lets Hunt !!!",
    "gameID": 0,
    "author": "Jaden0502"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 2,
    "date": "2018-08-09T00:00:00.000Z",
    "score": 7.0,
    "comments": "La base de esta puntuación sé que puede denotar a una penalización y en parte, es así y en parte no; me explico, a lo largo del día y con la salida del juego muchos usuarios, de los que yo me incluyo, nos hemos visto sorprendidos porque una vez más Capcom a dejado a la comunidad de PC sin los 21:9 para monitores panorámicos, el problema es que esto no es la primera vez que lo hacen ya queLa base de esta puntuación sé que puede denotar a una penalización y en parte, es así y en parte no; me explico, a lo largo del día y con la salida del juego muchos usuarios, de los que yo me incluyo, nos hemos visto sorprendidos porque una vez más Capcom a dejado a la comunidad de PC sin los 21:9 para monitores panorámicos, el problema es que esto no es la primera vez que lo hacen ya que en títulos como Dragon Dogma o Resident Evil 7 han prescindido del mismo haciendo que la propia comunidad de PC tenga que editar los archivos base del juego dando problemas de HUD siendo del todo molesto y rompiendo la visión del juego. Para los que tengan intención de jugarlo en mondo panorámico sabed que desde Steam la comunidad del juego se está moviendo para enviar Feedback a la siguientes direcciones: - feedback@capcom.com - support@capcom.com con el fin de que el mayor número de usuarios pueda presionar a la compañía para que al menos, tomen en consideración futuras franquicias con una relación aspecto acorde a los tiempos que tocan. Sin más comentar que el juego base es del todo estupendo, la optimización del mismo está algo ajustada debido a esa explotación de la CPU la cual requiere tanto y que junto con Danuvo no ayuda demasiado, pero teniendo una buena base RAM y una 960 Nvidia de pasada generación, este título luce de manera notable. Recalcar también su componente offline y online, muchas personas estaban asegurando que no podían jugar en modo offline al juego, esto no es así, lo que hay que hacer es crear una sala privada y ya está, algo que también ocurría en PS4.… ",
    "gameID": 0,
    "author": "Galatea"
  },
  {
    "helpfulCount": 36,
    "helpfulScore": 20,
    "date": "2018-08-10T00:00:00.000Z",
    "score": 3.0,
    "comments": "This is my first entry into Monster Hunter, and I can clearly say the combat is terrible. Its feels so clunky to me, worse than the dark souls 2 pc port. I don\u0027t think I can adapt, nor am willing to adapt to the combat in this game, meaning its basically unplayable for me. I am sorry but if you are a fan of precise controls, like I am, stay the hell away from this game! I give it a 3 outThis is my first entry into Monster Hunter, and I can clearly say the combat is terrible. Its feels so clunky to me, worse than the dark souls 2 pc port. I don\u0027t think I can adapt, nor am willing to adapt to the combat in this game, meaning its basically unplayable for me. I am sorry but if you are a fan of precise controls, like I am, stay the hell away from this game! I give it a 3 out of 10 because the world is beautifully crafted and I believe it deserves a mention.… ",
    "gameID": 0,
    "author": "Ansatsu83"
  },
  {
    "helpfulCount": 69,
    "helpfulScore": 27,
    "date": "2018-08-10T00:00:00.000Z",
    "score": 4.0,
    "comments": "There is NOTHING about this game that is good enough to warrant a 9/10 rating. In the history of gaming, there\u0027s never been a port from console to PC that was any good. And sadly, I was right about this game as well. What all the game play videos do NOT show people is the worst parts of the game. So to keep it simple here\u0027s a list: 1. Camera system is terrible, you can tell itThere is NOTHING about this game that is good enough to warrant a 9/10 rating. In the history of gaming, there\u0027s never been a port from console to PC that was any good. And sadly, I was right about this game as well. What all the game play videos do NOT show people is the worst parts of the game. So to keep it simple here\u0027s a list: 1. Camera system is terrible, you can tell it was a direct port from console and designed to work with gamepads and not PC mice. 2. The Combat system is slow and clunky at best. 3. Anyone using an pre-Haswell CPU is struggling with FPS stability (I do not have this problem i7-5930K) (Yes they are trying to figure out how to fix this issue) 4. The Game world is setup like SkyForge (Central Hub *by yourself* where you prepare to enter an instanced zone either by yourself or while having someone connect to your session or vice versa otherwise it\u0027s a single player game, with a poorly implemented coop/multiplayer mode: It felt like an afterthought at best)) 5. Multiplayer is terrible at best, You would think after 8 months on Xbone, and PS4 they might have an idea of what network infrastructure would work? (Constant disconnects between player sessions) If I didn\u0027t know any better I\u0027d say they were using Peer-Peer server hosting, because I can\u0027t believe a normal Network Infrastructure is this unstable and bad. Disconnects and error codes are common, and being forced into offline mode are expected. (No it\u0027s not my connection either, I have a 500Mb/sec / 50Mb/sec connection, and I ping 15-100ms or less everywhere in the U.S. 6. Character animations are poor at best, you cannot move while attacking at the same time. In other words for those of us who played a real Action Combat MMO: The character position is locked while attacking, so no you cannot circle strafe around a target. 7. If you were expecting this game to be an Action Combat System it\u0027s not. Not when you throw a game like Tera into the mix as a comparison. Now there are only 2 things positive I can say about this game: 1. The Graphics 2. They do in fact have a mouse Y Axis invert option. Beyond that, I can\u0027t say anything else good about it. The idea is sound, but the control mechanics, character animations, and clunky combat system makes it eye bleeding to deal with. Worst $60 I spent so far on a game. (next to X-Universe that is but hey at least the camera system worked in that game.)… ",
    "gameID": 0,
    "author": "FlukeLSX"
  },
  {
    "helpfulCount": 49,
    "helpfulScore": 19,
    "date": "2018-08-10T00:00:00.000Z",
    "score": 0.0,
    "comments": "- **** DRM / Denuvo - Badly optimized - 1080ti runs at 40-50 FPS - No inherit controller support, relies on steam API for controller support which doesn\u0027t work. And yes, I did use the steam checkbox for controllers. Happy to change my review when all these issues have been fixed, but right now the game is not at an acceptable level.",
    "gameID": 0,
    "author": "Ukkoclap"
  },
  {
    "helpfulCount": 15,
    "helpfulScore": 3,
    "date": "2018-08-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "There is simply no better game. Best monster hunter game in the franchise so far. -IT is ON PC (finally) -huge collections of weapons to master -still a challenging game with 500+ hours into the franchise",
    "gameID": 0,
    "author": "hungryneko"
  },
  {
    "helpfulCount": 19,
    "helpfulScore": 5,
    "date": "2018-08-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "You can play good with Controller an Keyboard too. Monster Hunter World is one of the best CO-OP Games ever made. The World is so lively and beautiful and with friends, online or alone you can play 100 of hours.",
    "gameID": 0,
    "author": "LordEcke"
  },
  {
    "helpfulCount": 16,
    "helpfulScore": 3,
    "date": "2018-08-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "This is my first exposure to the series, and I must say I\u0027m highly impressed. The world feels like a living eco system, and has beautfiul locales. The combat is incredibly varied, as not only do the 14 different weapon types have seperate animations, they have their own set of combos as well. This makes each type of weapon play in unqiue ways, which makes the system always feel fresh.This is my first exposure to the series, and I must say I\u0027m highly impressed. The world feels like a living eco system, and has beautfiul locales. The combat is incredibly varied, as not only do the 14 different weapon types have seperate animations, they have their own set of combos as well. This makes each type of weapon play in unqiue ways, which makes the system always feel fresh. The premise is simple, but their are many intricacies in the gameplay that give it depth. I would highly reccomend this game!… ",
    "gameID": 0,
    "author": "JFoxy"
  },
  {
    "helpfulCount": 15,
    "helpfulScore": 4,
    "date": "2018-08-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Monster Hunter finally on PC. The game is awesome so far and no technical issues whatsoever. I5 4690@4.5ghz, 16gb, 1070ti. Game runs between 70 and 150 fps if unlocked. Great for gsync. The game itself is Monster Hunter with a bunch of QoL changes compared to previous titles. Best game to get into the franchise.",
    "gameID": 0,
    "author": "MitchPeeler"
  },
  {
    "helpfulCount": 24,
    "helpfulScore": 14,
    "date": "2018-08-10T00:00:00.000Z",
    "score": 4.0,
    "comments": "Honestly wait for MHW to go on sale of get some patches in. Like it\u0027s fun but I don\u0027t think it is a premium level. My poor friend was just frustrated the entire time because grouping is such a hassle or just doesn\u0027t work most of the time. The graphics while pretty have a lot of low quality flaws that stand out. Waiting all this time, I really expected a far more polished productHonestly wait for MHW to go on sale of get some patches in. Like it\u0027s fun but I don\u0027t think it is a premium level. My poor friend was just frustrated the entire time because grouping is such a hassle or just doesn\u0027t work most of the time. The graphics while pretty have a lot of low quality flaws that stand out. Waiting all this time, I really expected a far more polished product than was delivered… ",
    "gameID": 0,
    "author": "BigBragg"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 3,
    "date": "2018-08-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "I skipped the PS4 version of World so I could experience it for the first time on my PC... As a long time MH fan, it was worth the wait! I\u0027ve already put over 20 hours into this game and it just released.",
    "gameID": 0,
    "author": "Rumfish"
  },
  {
    "helpfulCount": 15,
    "helpfulScore": 4,
    "date": "2018-08-11T00:00:00.000Z",
    "score": 8.0,
    "comments": "A huge improvement from MHXX, spectacular Graphics and solid gameplay (as well for all games). MHW tries to impress with an history that for me felt a little forced with lack on actual writing. The game is OK on my PC with frame issues on cinematics. Playing with a I5, Geforce 940 and 4G RAM on Medium graphs (FPS is OK on the gameplay, but on cinematics, the FPS is slower andA huge improvement from MHXX, spectacular Graphics and solid gameplay (as well for all games). MHW tries to impress with an history that for me felt a little forced with lack on actual writing. The game is OK on my PC with frame issues on cinematics. Playing with a I5, Geforce 940 and 4G RAM on Medium graphs (FPS is OK on the gameplay, but on cinematics, the FPS is slower and dissynchronized). Grapics: 11 (Stunning scapelands and enviromental fauna, gorgeous designs on everything) Gameplay: 9.5 (Many weapons with new features, no palico controled gameplay tho. Gathering is fun now, but feels clunky). History: 6.5 (Well the history tryies to impress the player, and all. But some dialogues around discovering new creatures, observing and stuff instead of hunting bored me, no actual depth of danger at all...) Experience: 9 (Level design is awesome, but I found some difficulties when using item/chat/gesture hotkeys. Too many tutorials that are no friendly for the user, for some cases one video or oriented tutorial would be a much better choice) Soundtrack: 8.5 (Too jurassic world inspired tunes, the melodies don\u0027t give the hype factor when hunting). Final Score: 8.2/10 Definitely fun, but the game overall needs constant improvement for sure.… ",
    "gameID": 0,
    "author": "Mizuru"
  },
  {
    "helpfulCount": 21,
    "helpfulScore": 12,
    "date": "2018-08-11T00:00:00.000Z",
    "score": 1.0,
    "comments": "I bought this game hoping it would be good because it has great reviews, co-op, and I\u0027ve heard a lot of great things about it from my friends who play it on console. Single player is great... with a controller. Don\u0027t plan on using the mouse and keyboard you are so accustomed to as a PC gamer. Whoever worked at CapCom on this console port never played the game with the mouse andI bought this game hoping it would be good because it has great reviews, co-op, and I\u0027ve heard a lot of great things about it from my friends who play it on console. Single player is great... with a controller. Don\u0027t plan on using the mouse and keyboard you are so accustomed to as a PC gamer. Whoever worked at CapCom on this console port never played the game with the mouse and keyboard. You can\u0027t turn off mouse acceleration, which makes the mouse pretty much act like a joystick, you can\u0027t change certain keybinds in the settings, and the menu interface is definitely designed for console. Also you can\u0027t turn motion blur or bloom off. The game is, also, wayyy too bright even with the gamma turned down and volumetric fog off. Co-op is unplayable at the moment. You WILL get disconnected when you play with friends IF you are able to join them in the first place (unless you are super lucky). You cannot progress through the story with your friends, either. One member of your party has to have previously done it solo. (Really Capcom?) The graphics are also very, very bad for a AAA title like this. It looks like a console game at max settings and is overwhelmingly underwhelming. Most AAA games made in the past 5 years look much better than this game, imo. I think, honestly, Hitman: Absolution or Far Cry 3 have the same if not better graphics. Don\u0027t get me started on the textures. If you like the Monster Hunter franchise, you own a controller or gamepad, you don\u0027t care about multiplayer or co-op, you are fine with sub-optimal graphics and performance, go ahead buy the game, it\u0027s great. For me, I just think it would be better if I waited for them to fix most of the things, that I think, are wrong with the game or waited until it was heavily discounted to buy it. I think CapCom could\u0027ve done a better job and I\u0027m extremely disappointed with what bag of feces they lit on fire and threw onto Steam\u0027s doorstep, sharpie\u0027d on it \"ported and polished\".… ",
    "gameID": 0,
    "author": "burningman92"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 1,
    "date": "2018-08-11T00:00:00.000Z",
    "score": 8.0,
    "comments": "Great gameplay mixed with complex Monster fighting give this game a unique type of gameplay. Poor multiplayer implementation though hurt this game a lot. Random disconnections as well as Not being able to join your friends to watch cutscenes just to name a few problems. If this game had more open world type of gameplay this would be a real winner. Still this game has an excellent gameplayGreat gameplay mixed with complex Monster fighting give this game a unique type of gameplay. Poor multiplayer implementation though hurt this game a lot. Random disconnections as well as Not being able to join your friends to watch cutscenes just to name a few problems. If this game had more open world type of gameplay this would be a real winner. Still this game has an excellent gameplay and you can\u0027t go wrong with that.… ",
    "gameID": 0,
    "author": "Shekky"
  },
  {
    "helpfulCount": 26,
    "helpfulScore": 14,
    "date": "2018-08-11T00:00:00.000Z",
    "score": 0.0,
    "comments": "Monster Hunter: World redefines the meaning of a low quality console to PC port. If you thought Dark Souls or Nier Automata were bad prepare yourself for a whole new dimension of poor performance and visual quality from 2010. - Clunky/Stiff controls and movement - Weird mouse simulation, no raw input - The sound is so out of sync with whats going on on the screen it\u0027s almostMonster Hunter: World redefines the meaning of a low quality console to PC port. If you thought Dark Souls or Nier Automata were bad prepare yourself for a whole new dimension of poor performance and visual quality from 2010. - Clunky/Stiff controls and movement - Weird mouse simulation, no raw input - The sound is so out of sync with whats going on on the screen it\u0027s almost hilarious, especially the lip sync - Textures from a time before games had textures - More performance demanding than literally any modern game with high end graphics yet it looks very outdated. - Multiplayer is a mess, good luck trying to play with your friends. Why can every other game do this right, even Ubisoft games allow your friends to just jump in and out of your session at any time - Relying on half-working Steam API - Can\u0027t pause, open the main menu, or exit the game while on a mission. Seriously? - Denuvo DRM. Ok, other games have that too, but still. - DLC add ons that have been released on consoles forever are being withheld for the PC version - Pricetag. This game is many months old and a lot of content that is already available wasn\u0027t included, see above. Try harder, Capcom. If want to know how it\u0027s done look up to Square Enix. Final Fantasy XV is how you do a proper console to PC port.… ",
    "gameID": 0,
    "author": "Milenya"
  },
  {
    "helpfulCount": 22,
    "helpfulScore": 13,
    "date": "2018-08-11T00:00:00.000Z",
    "score": 2.0,
    "comments": "If you want to play with a specific friend or group of friends, the multiplayer matchmaking aspects of this game are terrible. If you want to play with a bunch of random people, it\u0027s merely bad. I have no idea how the actual multiplayer gameplay is because I could never get the matchmaking to work. And since that is the big hook on this game, that really sucks. Quests have twoIf you want to play with a specific friend or group of friends, the multiplayer matchmaking aspects of this game are terrible. If you want to play with a bunch of random people, it\u0027s merely bad. I have no idea how the actual multiplayer gameplay is because I could never get the matchmaking to work. And since that is the big hook on this game, that really sucks. Quests have two difficulty levels, 1 player or 4 player. This is set when you pick how many players you possibly want to join you on a quest. Not by how many players are actually participating. So if you want to play with another friends, and you set the quest limit to two players, you had better hope you can get matchmaking to work, and that y\u0027all can play like you are 4 people. And that is assuming you can get matchmaking to work. All the secret steps you have to take in order to get quests to work with multiplayer remind me of hiccup cures, in that they may or may not work for you. Even if they do, they are very unintuitive, and not documented anywhere in the game. Want to do a story quest with friends? That is like getting four people to simultaneously flush four marine toilets. It\u0027s absurdly complicated. And undocumented. Then there are expeditions, which have a different set of absurd conditions and steps. And god help you if there is a cutscene involved, then that is a different set of steps. Finally, you have to go through this garbage process every single time you take a new mission or expedition. If you were expecting a game like any other PC coop multiplayer game (Borderlands, Nazi Zombie Army, Left 4 Dead, The Division, Dying Light, Killing Floor, Dead Island, etc, etc) where you get your group together and go play - prepare yourself to be exceptionally disappointed. I\u0027ve enjoyed the singleplayer, but it isn\u0027t as good as any other dedicated singleplayer game. They story and plot elements are basic and threadbare. Basically a framework to justify going out with a group of folks and murder monsters. And that is what I got this game for. I got this game to play with friends \u0026 family. All it has been in that regard is a huge steaming pile of frustration.… ",
    "gameID": 0,
    "author": "wildstars"
  },
  {
    "helpfulCount": 28,
    "helpfulScore": 13,
    "date": "2018-08-11T00:00:00.000Z",
    "score": 0.0,
    "comments": "terrible port. badly optimised. can\u0027t even get a stable 60fps with a PC that\u0027s only 2 years old.",
    "gameID": 0,
    "author": "iamthewizard2"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 7,
    "date": "2018-08-12T00:00:00.000Z",
    "score": 0.0,
    "comments": "game server is totally broken. I can\u0027t play with my friend. but capcom was not fixed this game. it is so terrible, not a good game.",
    "gameID": 0,
    "author": "MeUMeU"
  },
  {
    "helpfulCount": 15,
    "helpfulScore": 8,
    "date": "2018-08-12T00:00:00.000Z",
    "score": 0.0,
    "comments": "To put it simple. One of the worst port of the entire year and truly a backstab to any gamer around the world . The fact that has been delayed for 6 months and the Pc version wich should have got best treatment is Downgrade to lower levels than consoles is disgusting . Yes Pc version do not have Xbox X textures neither water reflection in 2018 . Even Nier Automata sad port has visualTo put it simple. One of the worst port of the entire year and truly a backstab to any gamer around the world . The fact that has been delayed for 6 months and the Pc version wich should have got best treatment is Downgrade to lower levels than consoles is disgusting . Yes Pc version do not have Xbox X textures neither water reflection in 2018 . Even Nier Automata sad port has visual parity at least . Then add the limitation of Dlc, Anti- Tamper against Mods and you have a 60usd cash grab crime . GO F# Yourself Capcom.… ",
    "gameID": 0,
    "author": "aquiles1990"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 7,
    "date": "2018-08-12T00:00:00.000Z",
    "score": 0.0,
    "comments": "Mouse emulates a joystick and feels objectively bad to play with. Might as well be lugging around a boulder, the negative acceleration is unlike anything i\u0027ve ever seen on PC. keyboard bindings are fixable, but the defaults (V to aim? no drag and drop in menus, using Q and E in menu) just solidifies the notion that they did a console port to PC without a single thought about PC at all.Mouse emulates a joystick and feels objectively bad to play with. Might as well be lugging around a boulder, the negative acceleration is unlike anything i\u0027ve ever seen on PC. keyboard bindings are fixable, but the defaults (V to aim? no drag and drop in menus, using Q and E in menu) just solidifies the notion that they did a console port to PC without a single thought about PC at all. Whoever set these probably hadn\u0027t even tested it on PC. Overall, mouse+kb control scheme for this game are 100% objectively and factually (not an opinion) absolutely abysmal. As a console game, it\u0027s probably nice. But this review is for PC. And since the devs put about 1 minute of thought into the PC aspect and ended up with this mess of a control scheme, this doesn\u0027t qualify for a PC game and receives a zero.… ",
    "gameID": 0,
    "author": "alewares"
  },
  {
    "helpfulCount": 34,
    "helpfulScore": 17,
    "date": "2018-08-12T00:00:00.000Z",
    "score": 0.0,
    "comments": "This port is terrible. Controller issues, network issues, poorly optimized, and it doesn\u0027t even play well with SLi so I can\u0027t even brute force the game to an acceptable framerate. Thank you Steam refunds.",
    "gameID": 0,
    "author": "smahlt"
  },
  {
    "helpfulCount": 24,
    "helpfulScore": 12,
    "date": "2018-08-12T00:00:00.000Z",
    "score": 2.0,
    "comments": "Terrible port of an awesome game. It runs with constant 100% CPU usage and it suffers from huge lagspikes during combat. The game is barely playable in this state. I wish I could refund it.",
    "gameID": 0,
    "author": "PunishedVex"
  },
  {
    "helpfulCount": 19,
    "helpfulScore": 10,
    "date": "2018-08-12T00:00:00.000Z",
    "score": 0.0,
    "comments": "El peor port de consola que he visto en mi vida. Retraso de 1 año en pc sin justificación alguna. No han trabajado para nada la versión de pc, además está limitado intencionalmente para que ps4 no se vea tan inferior. Hicieron un copy paste horrendo. Más encima trae DENUVO, que hace sufrir de manera maliciosa a los CPU. Para un juego 100% online, con un loguin no quiere más. No voy aEl peor port de consola que he visto en mi vida. Retraso de 1 año en pc sin justificación alguna. No han trabajado para nada la versión de pc, además está limitado intencionalmente para que ps4 no se vea tan inferior. Hicieron un copy paste horrendo. Más encima trae DENUVO, que hace sufrir de manera maliciosa a los CPU. Para un juego 100% online, con un loguin no quiere más. No voy a aceptar un producto de tan baja calidad… ",
    "gameID": 0,
    "author": "Sfea"
  },
  {
    "helpfulCount": 16,
    "helpfulScore": 8,
    "date": "2018-08-12T00:00:00.000Z",
    "score": 0.0,
    "comments": "Terrible game, i spent ages running around like a headless chicken not knowing what to do, it kept disconnecting, waste of money!",
    "gameID": 0,
    "author": "Delcien"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 3,
    "date": "2018-08-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "this game is so great, beautifull whereas my qality graphism that\u0027s at minimum but is very fluid, while i have an aurdinary computer who turn with 15fps. he follow the previous MH, it\u0027s an pleasur to play but i\u0027m disappointed of a not much option to craft weapon compared the previous. i haven\u0027t test a multiplayer for moment.",
    "gameID": 0,
    "author": "mizuki"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2018-08-13T00:00:00.000Z",
    "score": 7.0,
    "comments": "Gameplay is is very tight and fluid, but in its own way. I have 300+ hours on PS4, and mechanically it feels no different. Yes, it takes some time to get used to with the heavy weapons that punish you horribly for button mashing by animation locking you to your death, but once you get it down, its very rewarding. I can see how it can be precieved as being clunky for new comersGameplay is is very tight and fluid, but in its own way. I have 300+ hours on PS4, and mechanically it feels no different. Yes, it takes some time to get used to with the heavy weapons that punish you horribly for button mashing by animation locking you to your death, but once you get it down, its very rewarding. I can see how it can be precieved as being clunky for new comers (especially with the \"Great Sword is easy\" ranking it gives you, when its one of the hardest weapons to use properly). After playing with KB/M for a bit, I ended up having to plug in my controller. The game just does not feel suited for KB/M and the inability to turn off mouse acceleration is extremely noticeable and got me killed several times. As for framerates, I can hit stable 60 FPS @ 1440P with Volume Rendering Quality set to off and all other settings at max with a 6600k and a 1070... if I have everything closed in the background. CPU usage frequently hits 70%. With that, Discord, and Chrome running in the background, it can chug every now and then. Overall, its the game I love on the PS4 and I personally havent been hit with all the bugs everyone else are reporting (like the Cutscene crash bug deleting your save). This would be a 9/10 if the port quality was better, so taking 2 points off for that, lack of 21:9 support (It says 3440x1440 in the menu but only displays 2560x1440) and the current issue that it seems to be a crapshoot to join in progress hunts with friends. We typically all have to back out load into the fight from the base camp rather than coming to help someone mid hunt. As it stands, I pretty much only bought it to play with friends who dont have a PS4. I\u0027ll still be doing all my high level hunts on it (currently farming Arch Tempered Teostra) until things smooth out a little bit with the PC port.… ",
    "gameID": 0,
    "author": "Cyph3rPunk"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 5,
    "date": "2018-08-13T00:00:00.000Z",
    "score": 5.0,
    "comments": "Not entirely impressed with this port. Kbm controls are unbearable, and yet even with a controller the combat feels slow and clunky. Navigating multiplayer is a nightmare, you need to jump through so many hoops. Want a smooth co-op campaign experience with friends? Forget about it. You need to all individually watch the cut scenes for every mission before you\u0027re allowed to co-op the story.Not entirely impressed with this port. Kbm controls are unbearable, and yet even with a controller the combat feels slow and clunky. Navigating multiplayer is a nightmare, you need to jump through so many hoops. Want a smooth co-op campaign experience with friends? Forget about it. You need to all individually watch the cut scenes for every mission before you\u0027re allowed to co-op the story. I really want to love this game but Capcom are making it so hard. Not worth the full price tag, wait until its on sale. Hopefully they\u0027ll have fixed the never ending list of issues by then.… ",
    "gameID": 0,
    "author": "thisyearsgirls"
  },
  {
    "helpfulCount": 28,
    "helpfulScore": 17,
    "date": "2018-08-13T00:00:00.000Z",
    "score": 5.0,
    "comments": "Game lack of - No ultrawide 21:9 display support - No option to disable DOF - No option to disable Motion blur - No option to disable or adjust Bloom - No option to disable Mouse Acceleration - No option to adjust FOV - No option to rebind buttons for Controllers - Very limited Anti-Aliasing - Limited granularity in other graphics settings - Bugged Full Screen support - Bug ofGame lack of - No ultrawide 21:9 display support - No option to disable DOF - No option to disable Motion blur - No option to disable or adjust Bloom - No option to disable Mouse Acceleration - No option to adjust FOV - No option to rebind buttons for Controllers - Very limited Anti-Aliasing - Limited granularity in other graphics settings - Bugged Full Screen support - Bug of High Resolution Textures not loading at max settings - Bug of Screen Space Reflections not displaying but still consuming system resources - Bugged DOF Distance Detection causing erratic blur on objects that should be in focus - Ridiculous number of Menu Layers - Bad Connection Stability causing frequent drop outs and disconnections from server even when playing solo - Awkward Multiplayer Lobby arrangement - Awful saving scheme - CPU incompatibilities - Badly optimized - Terrible Port… ",
    "gameID": 0,
    "author": "rlorenz"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 4,
    "date": "2018-08-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "So firstly I\u0027d like to say this is my first Monster Hunter Game I\u0027ve played and I would just like to say that I love it already! One thing i\u0027d like to address asap that I noticed about low score reviews on here, is that they really, REALLY dislike the animations of your characters during fighting, and think of it as clunky. well, fun fact, that\u0027s because its SUPPOSED to be. unlike yourSo firstly I\u0027d like to say this is my first Monster Hunter Game I\u0027ve played and I would just like to say that I love it already! One thing i\u0027d like to address asap that I noticed about low score reviews on here, is that they really, REALLY dislike the animations of your characters during fighting, and think of it as clunky. well, fun fact, that\u0027s because its SUPPOSED to be. unlike your typical multi-weapon based game, weapons in MH:W aren\u0027t made of paper and plastic and you can\u0027t just fling a sword thrice as big as you like it doesn\u0027t weigh anything. battles are HECTIC, with environmental traps and places to use a grappling hook for quick mobility, and at all times during a battle you\u0027ll be thinking on your feet. However, this game isn\u0027t a hack-and-slash where you can just button mash and expect things to die, you have to plan your strikes(and positioning if you\u0027re using a ranged weapon) before you make them or you\u0027ll be punished for attacking in the wrong way at the wrong time. Bows for example let you run around pretty well and let you stay agile, while a lance-and-shield will make you extremely sluggish but will allow you to take extremely minimal damage while blocking, and I LOVE this system, to many games I have played where you can just button mash and things die without even being in the Hack-And-Slash genre, its refreshing to play this. The maps look beautiful and vibrant, and of course, so do the monsters! speaking of the monsters, I found the adaptive AI really awesome, especially during a few instances so far of 1 monster attacking another monster I\u0027m currently fighting, which is something that is completely unscripted. Now, I do have some gripes with the game, Which is why im not giving it a 10, which, I agree with low score reviews, the game is pretty poorly optimized. I have a 1070Ti (overclocked as high as I could take it safely I might add) with a Ryzen 2700x OC\u0027d CPU, and this game still can not reliably hit 60 fps without me turning some settings down a little unless I\u0027m in a very open area without a lot of density, or i\u0027m in non-busy floors of the main hub area. during gameplay I\u0027m looking at around 50-65 fps with lows as bad as 40, but, highs reaching the high 70\u0027s. Hopefully some patches get released that will get this game \"unchugged\". I also don\u0027t enjoy the lack of depth to character creation, but I understand that certain aspects (such as size and body type) could cause some issues of game balance if they were to have immersive gameplay effects such as someone overweight moving slower than a fit body type, or a short character being much harder for the monsters to hit if their hitbox was also reduced to fit their height. all in all, the game so far is very enjoyable for me, and as someone that\u0027s always been on the low end hardware side of life for the last 20 or so years, and only just now finally getting a beefy PC, turning down a few settings to get the game at a stable 60 frames isn\u0027t the end of the world for me. on a completely unrelated note, I did notice some people saying the Co-op is unstable. I\u0027ve done a LOT of hunts so far, and with those, I did the majority single-player, I will admit to that. However every single multiplayer session i\u0027ve done has had no issues whatsoever, but, I\u0027m, speaking for myself, I\u0027d say try the game out, try to rush through the tutorial as fast as you can with the default character model(you can have up to 3 character profiles at once and can just delete the profile after) so you can do the multiplayer as soon as possible to see if it gives you issues. if you enjoy the game when doing your first quest tutorial, and there are no problems with multiplayer, delete that profile or just begin a new game and take your time with that profile, and have fun :)… ",
    "gameID": 0,
    "author": "ZePieMan"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 1,
    "date": "2018-08-14T00:00:00.000Z",
    "score": 8.0,
    "comments": "Running on a Lenovo y520 laptop. I7, gtx 1060 3gb, 8gb ddr4, 128 ssd. run on max settings but I keep it on unlocked frames. my xbox controller links right up no problems. i have 270 hrs on the ps4 pro version of this game already. I bought MHW for my laptop so i could play on the go or in different rooms. I have no regrets. only 1080p but looks good, plays good for me. i read some peopleRunning on a Lenovo y520 laptop. I7, gtx 1060 3gb, 8gb ddr4, 128 ssd. run on max settings but I keep it on unlocked frames. my xbox controller links right up no problems. i have 270 hrs on the ps4 pro version of this game already. I bought MHW for my laptop so i could play on the go or in different rooms. I have no regrets. only 1080p but looks good, plays good for me. i read some people having controller problems, just turn on your controller and press A (xbox) and it switches from mouse to controller on the fly. i have not played online yet so cant speak to that. but man i love this game. plays just as well as my ps4 as far as i can tell. it loads faster because of my ssd drive. got it for 49$ on green man gaming. worth it.… ",
    "gameID": 0,
    "author": "ELDiablo2531"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 3,
    "date": "2018-08-14T00:00:00.000Z",
    "score": 9.0,
    "comments": "The game clearly isn\u0027t optimized for PC, but a solid rig can run it smoothly. I\u0027ve logged 30 hours with no crashes or issues. The game itself is fantastic!",
    "gameID": 0,
    "author": "Jackenbu"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 4,
    "date": "2018-08-14T00:00:00.000Z",
    "score": 9.0,
    "comments": "Sad to see bad reviews due to performance issues or simply because people didn\u0027t get what they expected. I can only report my experience. So far I\u0027ve been enjoying the game immensely. The game´s goal is simple. Killing monsters. But you have to learn how to do it. You´ll need to discover their weak points. Work with others at times to accomplish the goal. There are many MMO likeSad to see bad reviews due to performance issues or simply because people didn\u0027t get what they expected. I can only report my experience. So far I\u0027ve been enjoying the game immensely. The game´s goal is simple. Killing monsters. But you have to learn how to do it. You´ll need to discover their weak points. Work with others at times to accomplish the goal. There are many MMO like features. Paths of progression. But above all, plenty of weapons that offer extremely different feels. This is part of the problem some people may have. They pick a weapon that they end up not enjoying with. And instead of trying a new one they persist. But here´s the thing. The game does have the right weapon for you. Although the goal is to kill big beasts over and over again, they are all unique. And the game keeps on trowing new layers of things you can do such as exploring, researching, hunting and so on. This is not a game I would recommend to play alone. Hallf the fun is going out on missions with friends or calling out for help and getting some random people to assist you in killing that major beast. Above all the game successfully makes you feel like a real monster hunter. Now this is a non serious game with the typical Anime style animations. I understand this game can be divisive. Some people will greatly enjoy it and some won´t. But that doesn\u0027t mean it´s a bad game. Just that it isn\u0027t for everyone. Then again, what game is?… ",
    "gameID": 0,
    "author": "Cometer"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 6,
    "date": "2018-08-14T00:00:00.000Z",
    "score": 0.0,
    "comments": "I wouldn\u0027t **** play this game as long as Capcom did not fix the server problem! How do I play with my friends when this stupid **** ass game keep dc dc and dc??? So called game that can play with friends, but from what I have tasted, it definitely a solo game that trying so **** hard to go online but keeps on failed! Stupid Capcom, if you can\u0027t fix this then don\u0027t make this game goI wouldn\u0027t **** play this game as long as Capcom did not fix the server problem! How do I play with my friends when this stupid **** ass game keep dc dc and dc??? So called game that can play with friends, but from what I have tasted, it definitely a solo game that trying so **** hard to go online but keeps on failed! Stupid Capcom, if you can\u0027t fix this then don\u0027t make this game go public! Why do people waste so much money to purchase this game and watch it dc?… ",
    "gameID": 0,
    "author": "superjim94"
  },
  {
    "helpfulCount": 14,
    "helpfulScore": 7,
    "date": "2018-08-14T00:00:00.000Z",
    "score": 0.0,
    "comments": "Tbh, bleh.... Just a regular console poop, poorly ported for PC... Nothing new, nothing special. -Graphics outdated and physical requirements are high... Do not get me wrong, graphics is OK on screenshots, it\u0027s made to be presentable for showcase, but in action very Epileptic and Annoying, even disgusting in some places and very Eye heavy, it\u0027s not far from Crysis 2 or Warframe, butTbh, bleh.... Just a regular console poop, poorly ported for PC... Nothing new, nothing special. -Graphics outdated and physical requirements are high... Do not get me wrong, graphics is OK on screenshots, it\u0027s made to be presentable for showcase, but in action very Epileptic and Annoying, even disgusting in some places and very Eye heavy, it\u0027s not far from Crysis 2 or Warframe, but requires 5 times more resources from Hardware (sponsored by Intel btw... one more Coincidence ?), like there is a Miner integrated.... Oh... wait... there is one... -Sounds nice, but repetitive and annoying after 2 hours of gameplay... Btw, in 2018 game do not work even with 5.1... -Gameplay ? Hmmmm... Just mobile version of Monster Hunter games, nothing new, nothing special... -Do not have MHW on PS4, but PC version is peace of poo... No really, I did not think, that there will be a game, which can be worse than NMS, KKD and MEA... This game is not worth a penny, so I refund this piece of poo and will not even try it, in near future as minimum, even if they will pay me.... -10 Epileptic Console ports out of 10...… ",
    "gameID": 0,
    "author": "Xelluse"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 7,
    "date": "2018-08-15T00:00:00.000Z",
    "score": 0.0,
    "comments": "Overall good game, played a lot on PS4, but with current broken multiplayer and constant disconnects - not worth buying at all.",
    "gameID": 0,
    "author": "Fessaer"
  },
  {
    "helpfulCount": 18,
    "helpfulScore": 7,
    "date": "2018-08-17T00:00:00.000Z",
    "score": 1.0,
    "comments": "Overrated game. Capcom should released on all platform, or never release on PC. Capcom has no principle.",
    "gameID": 0,
    "author": "Dr_9658516"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 6,
    "date": "2018-08-17T00:00:00.000Z",
    "score": 0.0,
    "comments": "There is NOTHING about this game that is good enough to warrant a 9/10 rating. In the history of gaming, there\u0027s never been a port from console to PC that was any good. And sadly, I was right about this game as well. What all the game play videos do NOT show people is the worst parts of the game. So to keep it simple here\u0027s a list: 1. Camera system is terrible, you can tell it wasThere is NOTHING about this game that is good enough to warrant a 9/10 rating. In the history of gaming, there\u0027s never been a port from console to PC that was any good. And sadly, I was right about this game as well. What all the game play videos do NOT show people is the worst parts of the game. So to keep it simple here\u0027s a list: 1. Camera system is terrible, you can tell it was a direct port from console and designed to work with gamepads and not PC mice. 2. The Combat system is slow and clunky at best. 3. Anyone using an pre-Haswell CPU is struggling with FPS stability (I do not have this problem i7-5930K) (Yes they are trying to figure out how to fix this issue) 4. The Game world is setup like SkyForge (Central Hub *by yourself* where you prepare to enter an instanced zone either by yourself or while having someone connect to your session or vice versa otherwise it\u0027s a single player game, with a poorly implemented coop/multiplayer mode: It felt like an afterthought at best)) 5. Multiplayer is terrible at best, You would think after 8 months on Xbone, and PS4 they might have an idea of what network infrastructure would work? (Constant disconnects between player sessions) If I didn\u0027t know any better I\u0027d say they were using Peer-Peer server hosting, because I can\u0027t believe a normal Network Infrastructure is this unstable and bad. Disconnects and error codes are common, and being forced into offline mode are expected. (No it\u0027s not my connection either, I have a 500Mb/sec / 50Mb/sec connection, and I ping 15-100ms or less everywhere in the U.S. 6. Character animations are poor at best, you cannot move while attacking at the same time. In other words for those of us who played a real Action Combat MMO: The character position is locked while attacking, so no you cannot circle strafe around a target. 7. If you were expecting this game to be an Action Combat System it\u0027s not. Not when you throw a game like Tera into the mix as a comparison. Now there are only 2 things positive I can say about this game: 1. The Graphics 2. They do in fact have a mouse Y Axis invert option. Beyond that, I can\u0027t say anything else good about it. The idea is sound, but the control mechanics, character animations, and clunky combat system makes it eye bleeding to deal with.… ",
    "gameID": 0,
    "author": "riaprone"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 2,
    "date": "2018-08-18T00:00:00.000Z",
    "score": 8.0,
    "comments": "First of all, just wow, at the negative voting brigade. I\u0027d like to give more of an opinion than just \"IT DOESNT WORK PC PORT BAD FPS LAG MULTIPLAY BROKE.\" Yes the multiplayer has trouble sometimes but other than that it is an overall good game. I haven\u0027t had any fps issues and mostly play alone.",
    "gameID": 0,
    "author": "fixpyburgh"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 6,
    "date": "2018-08-18T00:00:00.000Z",
    "score": 0.0,
    "comments": "Broken matchmaking and unplayable keyboard and mouse controls make this impossible to recommend - at least until the matchmaking is fixed. I share the other reviewers\u0027 incredulity at Capcom\u0027s inability to successfully implement matchmaking in the pc port of this game, because the game prefers to put you in online sessions when you start it so you can matchmake easier - it almost alwaysBroken matchmaking and unplayable keyboard and mouse controls make this impossible to recommend - at least until the matchmaking is fixed. I share the other reviewers\u0027 incredulity at Capcom\u0027s inability to successfully implement matchmaking in the pc port of this game, because the game prefers to put you in online sessions when you start it so you can matchmake easier - it almost always fails to get you into a multiplayer session, wasting your time trying to connect for a minute until it ultimately gives you an error code and puts you in an offline lobby, which you can\u0027t choose to enter until you fail to connect to a multiplayer session. Pass on this until there\u0027s news that capcom fixed the matchmaking.… ",
    "gameID": 0,
    "author": "998817268"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 6,
    "date": "2018-08-19T00:00:00.000Z",
    "score": 0.0,
    "comments": "- Very Bad Porting. - DENUVO. FFS DO YOU STILL USE THIS SHI*TY DRM? It\u0027s useless now, a couple of weeks top and it\u0027s cracked - SERVER. They delayed SEVEN FRIGGIN\u0027 MONTHS PC launch for \"SERVER WORK TO DELIVER THE BEST EXPERIENCE\" so they said. THE SERVERS SUCKS! Every 5-20 minutes (depends on your luck) the online crash, sending you in offline mode (and if you are hunting with a stronger- Very Bad Porting. - DENUVO. FFS DO YOU STILL USE THIS SHI*TY DRM? It\u0027s useless now, a couple of weeks top and it\u0027s cracked - SERVER. They delayed SEVEN FRIGGIN\u0027 MONTHS PC launch for \"SERVER WORK TO DELIVER THE BEST EXPERIENCE\" so they said. THE SERVERS SUCKS! Every 5-20 minutes (depends on your luck) the online crash, sending you in offline mode (and if you are hunting with a stronger version of the monster). - Phisics and graphic engine sucks. It feels like a ~2010 game instead of a 2018. Capcom did a very LOUSY job here. This company do not deserve the ~60 bucks they ask for this garbage… ",
    "gameID": 0,
    "author": "Darius_84"
  },
  {
    "helpfulCount": 14,
    "helpfulScore": 6,
    "date": "2018-08-19T00:00:00.000Z",
    "score": 7.0,
    "comments": "A well hyped game that\u0027s supposed to deserve all it gets for this port, but falls short of halfway optimized being riddled with a ton of network and performance issues. CAPCOM could\u0027ve done better in the optimization department, but didn\u0027t. But hey, Monster Hunter: World PC has good mouse/keyboard control (in spite of the mouse acceleration), so I guess that\u0027s that. Thankfully, itsA well hyped game that\u0027s supposed to deserve all it gets for this port, but falls short of halfway optimized being riddled with a ton of network and performance issues. CAPCOM could\u0027ve done better in the optimization department, but didn\u0027t. But hey, Monster Hunter: World PC has good mouse/keyboard control (in spite of the mouse acceleration), so I guess that\u0027s that. Thankfully, its complex but juicy gameplay, mechanics, and content is its saving grace.… ",
    "gameID": 0,
    "author": "muzmuz"
  },
  {
    "helpfulCount": 14,
    "helpfulScore": 7,
    "date": "2018-08-20T00:00:00.000Z",
    "score": 0.0,
    "comments": "This game mean nothing nowadays. Boring gameplay, bad optimisation and ordinaty graphic quality - is that what you get buying this game. Not good for a Capcom reputation, such as \"Umbrella Corps\"",
    "gameID": 0,
    "author": "Ky3mi4_raider71"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 1,
    "date": "2018-08-20T00:00:00.000Z",
    "score": 9.0,
    "comments": "From my experience, this game is an absolute delight on pc. But from what I\u0027ve seen from all the negative reviews, there are 3 problems with the game. 1) some people think it runs like a turd. I have not had an issue with how the game runs. I\u0027m not much of a graphics snob, I just want 60-50 fps and I\u0027m fine, and MHW delivers on that. I have a middle of the road $900ish pc and with mediumFrom my experience, this game is an absolute delight on pc. But from what I\u0027ve seen from all the negative reviews, there are 3 problems with the game. 1) some people think it runs like a turd. I have not had an issue with how the game runs. I\u0027m not much of a graphics snob, I just want 60-50 fps and I\u0027m fine, and MHW delivers on that. I have a middle of the road $900ish pc and with medium graphic settings and v sync turned off, I have no problems maintaining at least 50 fps during 99% of my time playing the game. The only issues I have with my frame rate is typically at the end of hunts when everyone puts bombs at the monsters head and they all blow up at once and it causes my game to freeze for a second, but nothing more. 2) Bad controller support. Once again, for me this was no issue. I played dauntless before this was released and I found that these games play and handle very well on mkb so thats what I chose to play mhw on. Especially since I am a bowgun main, where aim is a part of how good the weapon is, being able to use mkb is a blessing for me. And for anyone who is okay with playing on mkb, I promise after a couple hours you\u0027ll feel like a natural. The mkb controls are highly modifiable in every regard and you can swap any button you want to whatever feels comfortable. 3) The last issue is with matchmaking. I play probably about 65% of this game solo and it works just perfectly for that 65% of the time and then on the other 35% of the time I play with friends or with randoms, I have connectivity issues about 10%-15% of the time. so not much of my time is spent in matches where I get booted. I will say however that how this system is handled is incredibly poorly designed. Say you are in a hunt with 4 other people, the monster will scale its HP up to accommodate all 4 players, and when you DC, you don\u0027t get sent back to the home world, you continue through the hunt by yourself with the monster who\u0027s HP is still scaled up, so you basically have to abandon the quest because the monster in basically invincible. Also sometimes when you are trying to load into the game and you select matchmake to put you into a server, it will stall for a few minutes and give you an error message, again, this is easily remedied by filtering your search criteria and selecting a server manually, or just creating your own session, I have never in my already 60+ hours in this game been let down by doing either of those two things. Other than those 3 things, which are really just mild inconveniences to sensible people who aren\u0027t snobs like many in the pc gaming community are, this game is absolutely wonderful. I beat the main story on console but refrained from playing any past that point in waiting for the pc release and now that it is finally here, this game is as incredible as I hoped it would be and i couldn\u0027t possibly recommend any other game as much as I recommend this game.… ",
    "gameID": 0,
    "author": "pointdownguy"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 1,
    "date": "2018-08-21T00:00:00.000Z",
    "score": 8.0,
    "comments": "GreatGreat game................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................… ",
    "gameID": 0,
    "author": "Astratome"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 3,
    "date": "2018-08-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "Great game 10/10 would bang. People complaining about the optimization had driver trouble, my 1060 6GB runs it a 1080p 60fps with the hands on its back",
    "gameID": 0,
    "author": "firulero"
  },
  {
    "helpfulCount": 13,
    "helpfulScore": 2,
    "date": "2018-08-23T00:00:00.000Z",
    "score": 10.0,
    "comments": "To all the ppl who complain about the game 1st stop using your old pentium 4 pc and expeckt the game to run for you its a new game and i run it with an i5 7600 and a gpu gtx 1050ti w/o any problems on max setings with 55 to 60 fps the only downside to this game is that is using steam platform, face it noobs the game is gr8 steam makes all the bugs for us and the lags and dcs",
    "gameID": 0,
    "author": "Bardawolf"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 5,
    "date": "2018-08-25T00:00:00.000Z",
    "score": 10.0,
    "comments": "UPDATE: Capcom\u0027s initial patch has fixed the server issue for me. While the game is great, there are some improvements that I really look forward to, such as being able to bind gestures/items/SOS directly to 0-9 (or any other keys) instead of the annoying F1-F4 + number keys.",
    "gameID": 0,
    "author": "Seekersilver"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 4,
    "date": "2018-08-26T00:00:00.000Z",
    "score": 2.0,
    "comments": "The game itself is in my mind 7-8/10. Then comes the optimization and the customer management from Capcom which basically doesn\u0027t exist. The CPU keeps overloading reaching 100% usage during gameplay which freezes the computer for 2-5 seconds each time. After lowering or turning off most settings, this problem persists. The response from Capcom is useless and there is no knowing if andThe game itself is in my mind 7-8/10. Then comes the optimization and the customer management from Capcom which basically doesn\u0027t exist. The CPU keeps overloading reaching 100% usage during gameplay which freezes the computer for 2-5 seconds each time. After lowering or turning off most settings, this problem persists. The response from Capcom is useless and there is no knowing if and when this will ever get fixed. This is on a computer that has no problems running the witcher 3 on ultra settings. The problem itself is rather common but does by no means happen to everyone. Either way, I simply cannot recommend the game to anyone because of Capcoms lack of customer service and the lack of patches to fix this garbage.… ",
    "gameID": 0,
    "author": "brushan"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 7,
    "date": "2018-08-28T00:00:00.000Z",
    "score": 2.0,
    "comments": "Broken. If it can\u0027t find a server (which is about 50% of the time) then it will completely stonewall you and stop you from playing at all. Inexcusable that this hasn\u0027t been fixed yet. While some connection issues are inevitable when you\u0027re playing with strangers this is beyond the pale. This is combined with the extortionate price they\u0027re charging for a game that is severely padded outBroken. If it can\u0027t find a server (which is about 50% of the time) then it will completely stonewall you and stop you from playing at all. Inexcusable that this hasn\u0027t been fixed yet. While some connection issues are inevitable when you\u0027re playing with strangers this is beyond the pale. This is combined with the extortionate price they\u0027re charging for a game that is severely padded out with filler content and repetitive grinding (the thrill of fighting a new monster for the first time is quickly diluted when the game forces you to kill them 5 more times in order to progress). The maps as well, while pretty and well designed, are very small for a modern RPG and do not really encourage or reward exploration. Overall I definitely can not recommend buying this game until they fix the aforementioned online issues and drop the price to more fairly reflect the amount of content on offer.… ",
    "gameID": 0,
    "author": "qwerty100"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 1,
    "date": "2018-08-30T00:00:00.000Z",
    "score": 9.0,
    "comments": "Well I am surprised to see the number of negative reviews here. I have sunk 140 hrs into the game. Finished the main story line and did some grinding afterwards. There were some network issues that needed sorting in the beginning but for the most part the game is stable now. - Graphics are good - but you do need good hardware. I run Intel I-7, 16 GIG RAM and 1070 ti with everything maxWell I am surprised to see the number of negative reviews here. I have sunk 140 hrs into the game. Finished the main story line and did some grinding afterwards. There were some network issues that needed sorting in the beginning but for the most part the game is stable now. - Graphics are good - but you do need good hardware. I run Intel I-7, 16 GIG RAM and 1070 ti with everything max settings no issue. (No 4K monitor though...). - All keys are customisable and i recommend you spend some time fixing some of the painful mapping that people frequently speak about. XBOX controller worked without any tweaking required. Plug it into the PC and it works. - I can make some recommendations as well: ----- the top tier drops are out of reach for 99% of players with exceedingly low drop rates ----- annoying game design, its awesome in the beginning to traverse the levels in the home base and go back and forth to your room which quickly gets old. I wish i could just do everything from my storage chest. (Forging, changing cat gear, collecting harvests, tail-raiders etc. ----- There are a lot of features like how to manage your quick bar, which aren\u0027t immediately obvious. Spend some time on YouTube for the hints. ----- Move set combos missing from the hunters notes or tutorials. Again thanks to all the YouTube content creators out there. Still good value for money and a really well put together game.… ",
    "gameID": 0,
    "author": "WillGamer"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 5,
    "date": "2018-08-31T00:00:00.000Z",
    "score": 0.0,
    "comments": "MH is basically a button masher now? Thanks Capcom Seriously, how can a game that as a forced 50hr **** story with brutally long unskippable cut-scenes and still be considered good? The end game isn\u0027t much better, it\u0027s literally the same initial 50 hours where you fight the same damn monsters with increased HP and higher attack.",
    "gameID": 0,
    "author": "xoa"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 6,
    "date": "2018-09-01T00:00:00.000Z",
    "score": 6.0,
    "comments": "6 / 10 i think a lot of people are either Vets or bought into the hype a bit too much. This is a decently above average game. Once you get used to the purposely slow (human) control scheme and get your groove, it\u0027s a fun game. Despite it being monotonous, it\u0027s somehow a fun game. This however is a VERY \"content-poor\" game though being sold at premium full-game price. Let\u0027s look at6 / 10 i think a lot of people are either Vets or bought into the hype a bit too much. This is a decently above average game. Once you get used to the purposely slow (human) control scheme and get your groove, it\u0027s a fun game. Despite it being monotonous, it\u0027s somehow a fun game. This however is a VERY \"content-poor\" game though being sold at premium full-game price. Let\u0027s look at the facts: 1. Two hub/quest kiosk zones where you are alone (no online players visible) and Five world combat zones. That\u0027s it. Each zone is probably 1/100th of the size of zones in games like Breath of the Wild, Witcher 3, or any Elder Scrolls game. Fans will say \"but this is a MH game, not Elder Scrolls!\" Who cares. Irrelevent. That\u0027s not a valid rebuttal when people are simply pointing out that the MHW zones are small, few, and confining by comparison. If any other multiplayer game released with only five maps, people would laugh their @sses off at the ridiculous notion. 2. The game needs load screens, even on PC, and it\u0027s not a technically demanding game. Granted they are fairly fast load screens if you have a decent PC, but I hear they are abysmal on consoles. Pretty sure the optimization could be better. Your PC might run Crysis at max settings without issue, but your fps is going to drop insanely when Teostra shoots his laser beam at you. Doesn\u0027t really make too much sense. 3. The monster hunting is fun. Very fun. However, the game has what, like 10 - 15 truly unique monsters? Half of the monsters are either reskins of another or using the exact same movesets and skeleton, with a few minor special move changes. Compare Rathian with Blue Rathian, Rathalos, Kushala Daora. Compare Odagoron with Tobi-Kadachi. Diablos is just Anjanath with burrowing capabilities minus the fire breathing. Take away fire and burrowing, and all you have is two monsters that just non-stop charge at you. That\u0027s it. It\u0027s so uncomplicated, it boggles my mind. Even the big boss fight at the end of the story is just a damage-sponge with very little worry of death. HR mode is basically saying \"Hey, you just fought all the monsters in the game. GJ! Now fight them all again but they are a little stronger. After that, you get to fight the same monsters again, but they are Tempered now. Ooooooooh uh-maaaaazing!\" Absurd. 4. Grind. Holy sh*t the grind. I have about 150 hours put into this game and I\u0027d estimate that around 100 hours of that is grinding the same monsters over and over for materials just to progress passed a storyline HR gating mechanism. 5. RNG and No Endgame. By HR Level 50, I have already fought every monster in the game literally 30 - 50 times, and I had to FORCE myself to reach HR 50. I kind of wanted to walk away at HR 30. Now my Endgame option is...fight those same monsters another 100 times each for a .01% chance at getting a useful Decoration you can slot into armor. Why would I need that decoration you ask? OH! To make fighting those monsters you\u0027ve already fought 150 times easier to fight of course. Wait, what? I\u0027m only grinding these monsters in order to make fighting these monsters easier? WTF?!? This game literally has no end goal. It\u0027s a game about fighting things over and over. 6. They probably could have found a better solution than the crappy item wheel and tool belt. Half the time in battles I am hammering away at the monster, and the other half I\u0027m running around trying not to get hit while I am scrolling to find my mantle, trap, tranquilizers, flash bomb, ect. Annoying. 7. This game costs $60 or $70 depending on which version you get, the same price at release as aforementioned games like Witcher 3 and Breath of the Wild. That\u0027s a value disparity. This is not an opinion-based observation. It\u0027s a strict value-comparison. At $70, any reasonable person would choose one of those other games and get far more value. That is fact. If you\u0027ve never played Witcher 3, you can probably buy it now somewhere for $20-30 (likely cheaper) and you will lose your life in that game for half a year. In a world where Witcher 3 exists, MHW should be laughed at. Hell, I probably got 1000% more actual playtime variety out of games like Super Mario 64 and Zelda A Link to the Past. I probably got more playtime variety out of Super Metroid. I\u0027m not even going to compare this game to the likes of the Dark Souls franchise. That comparison is laughable at best. This game is a shiny toy with very little depth. The armor/stat system is one-dimensional. It\u0027s repetitive. It has gating mechanisms that force grind. It\u0027s got an RNG system with very little point to participating. Fighting monsters is extremely fun though...for a while. The \"promise\" of future content and nostalgia (that I don\u0027t even have) is not worth $70 that I spent. If you were intelligent, you\u0027d wait for a severe price drop or a year\u0027s worth of content before buying.… ",
    "gameID": 0,
    "author": "AlMcFly"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 3,
    "date": "2018-09-02T00:00:00.000Z",
    "score": 4.0,
    "comments": "Now I\u0027m gonna be honest, the game in itself if FANTASTIC, and easily earn a 9/10, BUT what prevent me from completely recommend this game... is the piss poor PC port they\u0027ve made, forget every advantages that you usually get from a PC version, you don\u0027t get any here, the game has been optimized to specifically run just like consoles does, (aka 30-45 FPS at 1080p at high settings most ofNow I\u0027m gonna be honest, the game in itself if FANTASTIC, and easily earn a 9/10, BUT what prevent me from completely recommend this game... is the piss poor PC port they\u0027ve made, forget every advantages that you usually get from a PC version, you don\u0027t get any here, the game has been optimized to specifically run just like consoles does, (aka 30-45 FPS at 1080p at high settings most of the time) just look at the recommended specs on Steam and you\u0027ll see what I mean. so if you\u0027re considering buying this game PLEASE be aware that you\u0027re not buying a proper PC version or even a port for that matter, you\u0027re buying a console version that will be played on your PC, the frame rate and the resolution you\u0027re gonna play in will be the same as the PS4 Pro and the Xbox One S and will very rarely go in the 60 FPS range, the only way to get a steady 60 FPS at 1080p unfortunately is to have a high-end PC (GTX 1080 coupled with a fairly recent i7) so if you\u0027re like me and own a medium range machine (GTX 1060/970 with an fairly recent i5) simply don\u0027t expect a fluid and stable experience that PC versions are known for, this is not what is delivered here. So... do I recommend this game despite its garbage port ? - if you can deal with what I said above and/or do not own the console version ? YES absolutely, the game is simply one that everyone that love grindy games should play - if you expect to play it at a constant 60 FPS at 1080p with your average medium range PC and expect a good PC port/version ? NO absolutely NOT, this is one of the worst version available right now, if you do own it on your PS4 or Xbox One just don\u0027t bother buying this one, you\u0027ll get the same experience out of it on your already owned console copy, unless you have friends that are only on PC i would not reccomend… ",
    "gameID": 0,
    "author": "Retromastery"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2018-09-03T00:00:00.000Z",
    "score": 7.0,
    "comments": "I\u0027m a casual gamer and this is the only game in the series I\u0027ve ever played. I skimmed through the negative reviews and I agree with the problems that the game has, but I feel that the scores are unfair and don\u0027t put consideration into the gameplay itself. Therefore, read on if you want a genuine review on what the game feels like, and what you should be aware of before you try the gameI\u0027m a casual gamer and this is the only game in the series I\u0027ve ever played. I skimmed through the negative reviews and I agree with the problems that the game has, but I feel that the scores are unfair and don\u0027t put consideration into the gameplay itself. Therefore, read on if you want a genuine review on what the game feels like, and what you should be aware of before you try the game out. First off, the game is best enjoyed solo or with the SOS Flare multiplayer feature. Multiplayer is similar to Vermintide 2 where you can have up to a four players on a single quest. Unfortunately, the matchmaking system is busted for reasons others have already elaborated on, so if you want co-op, either play with your friends or use the SOS Flare feature in game. Always start the game offline to begin with (i.e. create your own server), and then join others later via SOS or the filter servers option. If you attempt to use the matchmaker at the main menu, the game might get stuck for a long time. MHW is an action RPG where you go around killing bosses. The weapons are balanced insanely well so that you\u0027ll never overpower any boss by farming and building up your character, and high level players won\u0027t be able to do the same either when they join your game. I liked the way this was designed. The SOS Flare system is absolute genius because it allows you to easily find bosses you\u0027re looking for to farm or to open up your game for people to join without any difficulty. Overall, the game is somewhat easy because the boss AI isn\u0027t amazing (definitely not Dark Souls level) and you have several lives and a copious amount of time to complete each quest. Sadly, bosses have insane health pools which make it a chore to peashoot them to death. Each boss takes at least 15 minutes to kill solo, or half the time if you do co-op. The game becomes more entertaining once you unlock the High Rank quests, so I suggest that you don\u0027t spend too much time doing sides until you\u0027ve unlocked them. Aesthetically, the game looks pleasing (if you can look past the poor optimization and the need to lower the graphics), and story-wise the game has a pretty good one. The game definitely goes at your own pace and is catered for casuals. Ultimately, as long as you can look past the counter-intuitive multiplayer system, you\u0027ll find that the game is a nice way to burn a few hours whenever you\u0027re bored. If you find the keyboard and mouse controls janky, just use a controller. I give the game a 7 for \"not quite there yet because it has its feed of problems but not bad if you can look past them.\"… ",
    "gameID": 0,
    "author": "nitorita"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 2,
    "date": "2018-09-04T00:00:00.000Z",
    "score": 9.0,
    "comments": "I have never played a Monster Hunter game before, but Monster Hunter World made me fall in love with it. It has a different kind of combat system than I am used to, but after you get the hang of it it\u0027s really fun. It has a fair amount of combos that you can use, but there are only a couple that you will always do. There\u0027s many different kind of trees for each weapon and armour, alsoI have never played a Monster Hunter game before, but Monster Hunter World made me fall in love with it. It has a different kind of combat system than I am used to, but after you get the hang of it it\u0027s really fun. It has a fair amount of combos that you can use, but there are only a couple that you will always do. There\u0027s many different kind of trees for each weapon and armour, also monsters, but I still hope they will add some more which would make the gamers play it longer. Not saying you can get every armour/weapon quickly, you can play this game for hundreds of hours(especially with friends), also you can always switch to another weapon and master it, which would make the experience longer. This game also has some faults: Many people complain that this game is a bad PC port and let\u0027s face it the optimization is quite poor. The game uses a huge amount of CPU power. I have an I7 6700K + GTX 1070, running the game on 1080p with maxed settings(with 1-3 options turned down to medium/slow), and on a mission/quest I get around 67-80 FPS. Also the audio bug is a bit annoying, but doesn\u0027t take away from the experience. Haven\u0027t had any connection issues so I can\u0027t give you my opinion on that. It\u0027s a bit sad that you can\u0027t play the campaign in team, I mean you can, but every member has to watch the cutscenes separately and after that you can group up.… ",
    "gameID": 0,
    "author": "MarcusAgapus"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 2,
    "date": "2018-09-05T00:00:00.000Z",
    "score": 9.0,
    "comments": "So far I am really digging the game play. I use my Ps4 controller with zero issues and it is very responsive (keyboard was a pain). beautiful environment and gameplay. I ran this on a amd 8350 with an rx480 but now use a i7 7700k and nvidia 1070 and both ran just fine. only reason this game did not get 10 stars is because of match making.. other then that great game.",
    "gameID": 0,
    "author": "SaintAmd"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 5,
    "date": "2018-09-08T00:00:00.000Z",
    "score": 0.0,
    "comments": "This game is majorly overrated. Immensely boring for the vast majority of gameplay. Some of the design decisions blow my mind. Constant loading screens and pointless cutscenes followed by mundane tasks of finding monster footprints constantly. And the port itself is HORRIBLE. Constant crashes, multiplayer is a JOKE, runs horribly, DENUVO, controls were designed by a monkey, and severelyThis game is majorly overrated. Immensely boring for the vast majority of gameplay. Some of the design decisions blow my mind. Constant loading screens and pointless cutscenes followed by mundane tasks of finding monster footprints constantly. And the port itself is HORRIBLE. Constant crashes, multiplayer is a JOKE, runs horribly, DENUVO, controls were designed by a monkey, and severely lacking in settings options.… ",
    "gameID": 0,
    "author": "Chewieflakes"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2018-09-12T00:00:00.000Z",
    "score": 8.0,
    "comments": "9/10 because it\u0027s too Demanding for Ressources with that kinda unstatisfying graphics. Gameplay is great, Story is whatever. Muted \u0026 went afk/minimized the Game in pretty much all cutscenes. Awkward voice actors in german. Also they lock content / bugfixes and bring them over time ...shady move.",
    "gameID": 0,
    "author": "Crackfarmer"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 5,
    "date": "2018-09-16T00:00:00.000Z",
    "score": 0.0,
    "comments": "PC Port is very bad, the camera without using mouse is a pian in the ass , the idea and concept of the game is good but only if you play it with a joypad.",
    "gameID": 0,
    "author": "johnnymatto"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 3,
    "date": "2018-09-28T00:00:00.000Z",
    "score": 1.0,
    "comments": "It\u0027s unbelievable that this badly optimized garbage game (which has Denuvo DRM by the way) is in the number 1 place in the Metacritiic Reviews. Game is a very bad PC port with an awful camera system, with weird combat mechanics and the performance is inconsistent even in High end rigs.",
    "gameID": 0,
    "author": "Vasot"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 5,
    "date": "2018-10-06T00:00:00.000Z",
    "score": 0.0,
    "comments": "A complete steaming pile of pig **** with all the support of a 1st world war orphan. An absolute disgrace to the history of gaming. Perfect proof that capcoms cares for nothing more than a quick cashgrab. If you care for a stable enjoyable gaming experience avoid at all cost. Tried to refund this waste of disk space, steam wouldn\u0027t let me. Runs like **** servers are nothing short of anA complete steaming pile of pig **** with all the support of a 1st world war orphan. An absolute disgrace to the history of gaming. Perfect proof that capcoms cares for nothing more than a quick cashgrab. If you care for a stable enjoyable gaming experience avoid at all cost. Tried to refund this waste of disk space, steam wouldn\u0027t let me. Runs like **** servers are nothing short of an insult and cut out all the unskippable cutscences and you are left with maybe 7 hours of actual gaming time. Well done capcom for utterly messing up the first PC installment of monster hunter.… ",
    "gameID": 0,
    "author": "Velventianq"
  },
  {
    "helpfulCount": 14,
    "helpfulScore": 4,
    "date": "2018-10-06T00:00:00.000Z",
    "score": 1.0,
    "comments": "I hate tiny games,tiny world and tragic optimization MONSTER HUNTER: WORLD 1/10",
    "gameID": 0,
    "author": "4_giant_games"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 4,
    "date": "2018-10-10T00:00:00.000Z",
    "score": 4.0,
    "comments": "simply a bad port, 8 months for nothing and less content than the console version, the specialized press i think played a different game for i cant mind why they scored that high... o hell yes... money...",
    "gameID": 0,
    "author": "AcidClay"
  },
  {
    "helpfulCount": 12,
    "helpfulScore": 4,
    "date": "2018-10-15T00:00:00.000Z",
    "score": 4.0,
    "comments": "I will just critique one part of this game, as its 100% of the reason I dislike it and refunded it. \"Want to do anything?\" HERE navigate this IMPOSSIBLE MENU... This ULTRA confusing disgustingly laid out mess. And you can MAYBE do it. Weird, plays as fluid as a punch to the nuts. However, the menus, upon menus, upon menus of stupid confusing nonsense just to play an aspect of theI will just critique one part of this game, as its 100% of the reason I dislike it and refunded it. \"Want to do anything?\" HERE navigate this IMPOSSIBLE MENU... This ULTRA confusing disgustingly laid out mess. And you can MAYBE do it. Weird, plays as fluid as a punch to the nuts. However, the menus, upon menus, upon menus of stupid confusing nonsense just to play an aspect of the game is horrendous. 4/10 go home Capcom, you are drunk.… ",
    "gameID": 0,
    "author": "Nati"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2018-10-27T00:00:00.000Z",
    "score": 8.0,
    "comments": "If you are new to Monster Hunter, prepare for the long hour journey and, mostly, grind to fulfill your inner OCD to collect all types of weapon and all kinds of armor in the game. Haha. The game went from disastrous release to a smooth sail in a couple of weeks. After a few tweaks and fix here and there from Capcom, Monster Hunter World is finally enjoyable on PC. The most annoyingIf you are new to Monster Hunter, prepare for the long hour journey and, mostly, grind to fulfill your inner OCD to collect all types of weapon and all kinds of armor in the game. Haha. The game went from disastrous release to a smooth sail in a couple of weeks. After a few tweaks and fix here and there from Capcom, Monster Hunter World is finally enjoyable on PC. The most annoying issues I had before was connectivity and mouse camera control that feel sluggish (even though I mainly use gamepad, but sometimes switch to mouse/keyboard). Now: - No more server issues. - Mouse camera controls are very fluid. The graphic is certainly amazing. It is certainly a major improvement from previous installment in the series. Some people are complaining about low texture quality, but I don\u0027t feel bothered with it because when I\u0027m on the hunt, don\u0027t usually pay much attention to it. The gameplay is challenging as ever, with ridiculous hitboxes and the sluggish movement of your character even when using light weapon like dual blade or sword \u0026 shield. But all that hurdle will be rewarded with the iconic music at the end of the quest, but with the most awkward last hit. \"A little poke to the toe of that Nergigante, bam, quest finished. Okay I guess, let\u0027s carve it.\" I think things that lacking now are, the optimization of keyboard control (Rename loadout with escape? Oh come on. And don\u0027t forget to press F1-F4 first before using items in quest), and the lack of meaningful event. I get it, baby steps toward better future right? But those steps\u0027re better be like Xeno\u0027jiva\u0027s one, or people will lose patiences with this already scarce roster of monsters. All in all, I think this game deserve to be put in your library. Just find a friend to play with \u0027cause hunting alone is somewhat boring in the long run.… ",
    "gameID": 0,
    "author": "Kayla45"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2018-11-14T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best MH ever, i came from PSP and i can say that this game is amazing in every sense, yes it has optimization and network issues but still this is the best game in a worth/price scale, lot of hours of gameplay and a lot of ppl playing. Great gameplay, amazing graphics, tutorials everywhere for new ppl, events every month, updates and fixes, and the best FREE DLCS!!!! 1 new monster everyBest MH ever, i came from PSP and i can say that this game is amazing in every sense, yes it has optimization and network issues but still this is the best game in a worth/price scale, lot of hours of gameplay and a lot of ppl playing. Great gameplay, amazing graphics, tutorials everywhere for new ppl, events every month, updates and fixes, and the best FREE DLCS!!!! 1 new monster every 2 months FOR FREE, this is the kind of developers we need to support! I preodered the game and i couldnt be happier.. like other bad preorders from ppl with epic fails like shadow of the tomb raider price drop or no mans sky disaster. Dont pay attention to bad reviews, if u love monster hunter just buy this one.… ",
    "gameID": 0,
    "author": "Agr3ssiv3"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2018-11-15T00:00:00.000Z",
    "score": 9.0,
    "comments": "Very good and beautiful game! It could contain more monsters (like old ones from MHFU, MHP3 etc.), but devs said they will add them later, so it\u0027s fine. The game is not so hardcore as portable versions, but maybe I just get used to dodging from playing other MH games)",
    "gameID": 0,
    "author": "jgeorgea"
  },
  {
    "helpfulCount": 10,
    "helpfulScore": 5,
    "date": "2018-11-16T00:00:00.000Z",
    "score": 1.0,
    "comments": "Very one dimensional, slow, boring, unpolished, grindfest of a tragedy. Only hype comes form weeaboo culture.",
    "gameID": 0,
    "author": "x_Marshmallon_x"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2018-11-17T00:00:00.000Z",
    "score": 5.0,
    "comments": "Honestly MHW is great for the first 100hrs or so. After the 100hrs mark it does feel repetitive. Capcom needs to add more material to this game before they lose the entire player base.",
    "gameID": 0,
    "author": "Zhexuexiawang"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2018-11-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "Fantastic game for monster hunter fans keeps everything great about the franchise, and a ton more. Most people giving zeros are doing it because of technical issues such as the use of Denuvo, or the fact that the movement is just an emulated controller and not direct mouse input. The input issue was fixed. The game itself is very fun and provides a lot of content for 60 dollars. Not toFantastic game for monster hunter fans keeps everything great about the franchise, and a ton more. Most people giving zeros are doing it because of technical issues such as the use of Denuvo, or the fact that the movement is just an emulated controller and not direct mouse input. The input issue was fixed. The game itself is very fun and provides a lot of content for 60 dollars. Not to mention no microtransactions, and free content updates.… ",
    "gameID": 0,
    "author": "Nearous47"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 2,
    "date": "2018-11-20T00:00:00.000Z",
    "score": 9.0,
    "comments": "Played it on PS4, started playing it again on PC. Same amazing game. Looks even better on my PC. Only downside is I figured I would love playing it with mouse and keyboard, but still prefer a controller.",
    "gameID": 0,
    "author": "JimmyE3"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2018-11-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "Not going to lie. Was waiting for this game with my friends forever and it delivered and exceeded out expectations a lot. I am still knees deep in it way after the 150 hour mark. I wish Capcom will release more content for this game. At this stage I wouldnt really mind paying for it.",
    "gameID": 0,
    "author": "sXerra"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2018-11-22T00:00:00.000Z",
    "score": 8.0,
    "comments": "Buen port para mi gusto, tanto gráficamente como jugablemente. Una historia que cumple y variedad de monstruos. Como aspecto negativo diría que se ha simplificado bastante respecto a otros monster hunter y que el multijugador en pc tiene muchas carencias.",
    "gameID": 0,
    "author": "Camer6"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2018-11-29T00:00:00.000Z",
    "score": 8.0,
    "comments": "As my first entry to a Monster Hunter game, I am blown away by it. Playing with friends are recommended, but playing alone is equally fun. It is true that it\u0027s much easier than the previous titles, but that is supposed to be the reason behind introducing the PC or the new players market to the Monster Hunter franchise. The reason for a score of 8/10 is as follows: 1. Rocky launch (theAs my first entry to a Monster Hunter game, I am blown away by it. Playing with friends are recommended, but playing alone is equally fun. It is true that it\u0027s much easier than the previous titles, but that is supposed to be the reason behind introducing the PC or the new players market to the Monster Hunter franchise. The reason for a score of 8/10 is as follows: 1. Rocky launch (the first 30-45 days), but it has been improving considerably! 2. A little repetitive (but it\u0027s a given for the franchise, and it\u0027s my own humble opinion) 3. A quite small roster of monsters than the previous titles 4. Crashes from time to time due to graphics card crash (although I have a 1060 and an i7 6th gen and playing on medium graphics settings), but rarely (almost never) now due to the performance updates 5. Connection problems if you tabbed out or doing something else on your computer Will change rating as time progresses. TL;DR If you want to give it a go on tackling the Monster Hunter franchise, I recommend buying it. Well worth the price and it\u0027s been on sale too, so there\u0027s no reason to not buy or give it a go.… ",
    "gameID": 0,
    "author": "NylonCanvas13"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2018-12-04T00:00:00.000Z",
    "score": 1.0,
    "comments": "I hate the games which ported from console like this MHW. They are too lazy to make a PC version of the game. Most of serious issues from the game have been listed by many people, I don\u0027t need to show them here.",
    "gameID": 0,
    "author": "lhmtgame"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2018-12-04T00:00:00.000Z",
    "score": 7.0,
    "comments": "There is good, quick action and cool monsters. Then there are abysmally terrible characters, cringy dialogue and shameful stereotyping... along with whatever those cat things are. Load times are annoying and despite playing on a rather expensive computer, it feels like the time from clicking a button to seeing the character doing the action is a little delayed. Visually not as goodThere is good, quick action and cool monsters. Then there are abysmally terrible characters, cringy dialogue and shameful stereotyping... along with whatever those cat things are. Load times are annoying and despite playing on a rather expensive computer, it feels like the time from clicking a button to seeing the character doing the action is a little delayed. Visually not as good as Shadow of the Tomb raider by a long shot and model and character/equipment design is rather poor - but its fun - would be an 8 for certain if it wasnt for the long load times… ",
    "gameID": 0,
    "author": "Sjalka"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 6,
    "date": "2018-12-09T00:00:00.000Z",
    "score": 6.0,
    "comments": "It\u0027s a mixed experience for me. I\u0027ve played most of the 3ds titles and one PS2 title. I have a combined 400 hours of gameplay, so it\u0027s safe to say that i\u0027m sort of a fan. MHW on the other hand is a good game, probably the best game in the series. There are a lot of things i like in it, but there are a lot of things i outwardly hate in it. So First, the good. It\u0027s more streamlined, moreIt\u0027s a mixed experience for me. I\u0027ve played most of the 3ds titles and one PS2 title. I have a combined 400 hours of gameplay, so it\u0027s safe to say that i\u0027m sort of a fan. MHW on the other hand is a good game, probably the best game in the series. There are a lot of things i like in it, but there are a lot of things i outwardly hate in it. So First, the good. It\u0027s more streamlined, more fair to new players and it doesn\u0027t get tedious fast. Tracking a monster is easier than ever, with tracks and tracker flies. The maps are one big area with seamless transitions between segments, meaning no loading screens. Bigger item pouch, divided into two types of crafting materials, meaning more room for items and less grinding. You always have a map and items are marked on it until you are under attack. No more pickaxes, nets and whetstones needed, meaning more space saved. The graphics are great, albeit demanding at times. I use the 360 controller and so far it has been superb. The monsters however familiar, can be surprisingly challenging even to returning players. Also you can turn off most helpful options for a more hardcore experience. All in all a good game as a whole. Not great, but OK. The Bad, are mostly issues that plague AAA games of late. Still, it\u0027s sort of baffling to me how a company like Capcom can allow itself to skim on servers and server quality leaving millions of paying customers out in the dirt coping with constant server issues. Camera can be annoying as it doesn\u0027t always stay locked on target, and when it does it\u0027s mostly at a weird angle where you can\u0027t see how the monster is positioned leaving you vulnerable to attack. Constant lock-on, lock-off is sort of tiring. I thought they\u0027d fix this by now. I\u0027ll never understand the need for Denuvo DRM. Isn\u0027t there a way you can protect your IP from piracy that doesn\u0027t involve installing what is basically a backdoor/spyware to paying customers? Anything is better than this. So far i\u0027ve not seen a way to change style. There is also a myriad of sub-menues and options that make the UI a bit difficult to deal with. Worst offense though, at least for me is NO WAY TO PAUSE in offline mode. I mean what the hell Capcom? How basic is that feature? Not all of us are soulless robots just pining to play this 24/7, no matter what you\u0027ve been led to believe. Like i said before, it\u0027s a good game, not without faults. After a while for me, the experience became all too familiar and a tad boring. New players should be fine, but returning players will find very little new things in terms of core gameplay. So, same old grindfest, with a touch of flair here and there.… ",
    "gameID": 0,
    "author": "MadclownJack"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2018-12-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best game ever my rx 460 have 60 fps im normal settings idk about disconnects, all is ok hard game with big content",
    "gameID": 0,
    "author": "Coliente"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2018-12-21T00:00:00.000Z",
    "score": 10.0,
    "comments": "[PC] One of the best games, i\u0027ve played this year. Totally worth to try and play with friends!",
    "gameID": 0,
    "author": "Czektul"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 2,
    "date": "2018-12-28T00:00:00.000Z",
    "score": 8.0,
    "comments": "The game\u0027s optimization isn\u0027t the best, monsters act following the same pattern and you\u0027ll find yourself exploring the same areas over and over again. The gameplay is fun though, even more if playing online and I also liked the character\u0027s customization. Controls are easy to learn. The world\u0027s design is good.",
    "gameID": 0,
    "author": "MrFettuccini"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 5,
    "date": "2018-12-30T00:00:00.000Z",
    "score": 4.0,
    "comments": "Its a port and wow its bad, the game has next to no support for PC. I would have rather them not even bring the game to PC. Most of the menu items still reference controllers, no mouse settings in sight. they force mouse smoothing, and acceleration on by default. It was so bad I was getting sick. I love this game on the consoles, but its PC counterpart is horrible. The stuff that isIts a port and wow its bad, the game has next to no support for PC. I would have rather them not even bring the game to PC. Most of the menu items still reference controllers, no mouse settings in sight. they force mouse smoothing, and acceleration on by default. It was so bad I was getting sick. I love this game on the consoles, but its PC counterpart is horrible. The stuff that is still a problem from the consoles is there ie the gameplay is so so, but with the added problem of uncontrollability its bad... The game still looks good and the audio is spot on, but its hard to overlook the issues that plague the game. I will also say for a year old game it runs poorly even on my 2080ti cards... All in all this game is a non buyer until the PC controls are even remotely addressed.… ",
    "gameID": 0,
    "author": "siman0"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 2,
    "date": "2018-12-31T00:00:00.000Z",
    "score": 10.0,
    "comments": "I think lot of bad reviews comes from first version of port, which was not ok, but was patched performance wise and controls as well, because i have no problems at all. I dont like multiplayer, and except two big monsters made specifically for that, i soloed everything in game up to HR 90 - 300+ hours. Excellent combat, **** rng causing grind, but not in a bad sense imho. I am usually rpgI think lot of bad reviews comes from first version of port, which was not ok, but was patched performance wise and controls as well, because i have no problems at all. I dont like multiplayer, and except two big monsters made specifically for that, i soloed everything in game up to HR 90 - 300+ hours. Excellent combat, **** rng causing grind, but not in a bad sense imho. I am usually rpg lover and need story and all, and this is very weak side of this game, yet still - MHW is one of best games i ever played. Graphics are beautiful, and frames are stable on weaker GPU... probably needs powerful CPU, (my case). Controls are ok, if you spend time to set them up properly. KBM.… ",
    "gameID": 0,
    "author": "kiki78"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2019-01-05T00:00:00.000Z",
    "score": 9.0,
    "comments": "haha wow, so many bad reviews............ thats crazy man, people must be raging or something. i had lots of fun with this MH game on pc. even while there were a lot of multiplayer connection errors when it was just released. must be fixed by now if im correct... last time i played i didnt got any problems. anyway, singleplayer is fun a lot also. but ofcourse playing with randomhaha wow, so many bad reviews............ thats crazy man, people must be raging or something. i had lots of fun with this MH game on pc. even while there were a lot of multiplayer connection errors when it was just released. must be fixed by now if im correct... last time i played i didnt got any problems. anyway, singleplayer is fun a lot also. but ofcourse playing with random people online was the most fun. they are still putting updates in it with new content currently - January 2019… ",
    "gameID": 0,
    "author": "Roen86"
  },
  {
    "helpfulCount": 6,
    "helpfulScore": 2,
    "date": "2019-01-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best Monster Hunter, already 100 hours into it and many more to come. Ignore those old reviews, many issues are fixed by now.",
    "gameID": 0,
    "author": "Tobilo"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 0,
    "date": "2019-01-08T00:00:00.000Z",
    "score": 5.0,
    "comments": "лесом лесом лесом лесом лесом лесом лесом лесом лесом лесом лесом лесом лесом",
    "gameID": 0,
    "author": "kycokkycka"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2019-01-25T00:00:00.000Z",
    "score": 8.0,
    "comments": "Challenging game, nice amout of grind funny entertaing kind. Controls are inteded so ..it gives feeling of real battle ,where you doesnt have full control of fencing. FPS is good no issues with graphic (GeForce GTX 1080 Ti thou...so maybe she can handle it). Sometimes is fckin HARD. But the feelin when you start controling and sending dmg the right way... but smtimes...well THEY AREChallenging game, nice amout of grind funny entertaing kind. Controls are inteded so ..it gives feeling of real battle ,where you doesnt have full control of fencing. FPS is good no issues with graphic (GeForce GTX 1080 Ti thou...so maybe she can handle it). Sometimes is fckin HARD. But the feelin when you start controling and sending dmg the right way... but smtimes...well THEY ARE FCKIN EPICK BIG monster what you await from Gozzila ? lay down and give up ? Even real beasts when they are severely hurt ...they start FIGHT for their lifes ... then you need to know better save than sorry (thats the hunter part of gameplay)...… ",
    "gameID": 0,
    "author": "Von-Drako"
  },
  {
    "helpfulCount": 9,
    "helpfulScore": 4,
    "date": "2019-01-27T00:00:00.000Z",
    "score": 0.0,
    "comments": "Never played MH before, and now I hate it. It is the grindiest game I\u0027ve ever played. It took 20 minutes to kill the first dinosaur and got basically nothing in return. I ask my friends opinion on why they like this game and them replied like \"you can unlock more weapon and slay the monsters faster\". THEN WHAT?! MH is the least rewarding game with clunky control and boring plots. I felt INever played MH before, and now I hate it. It is the grindiest game I\u0027ve ever played. It took 20 minutes to kill the first dinosaur and got basically nothing in return. I ask my friends opinion on why they like this game and them replied like \"you can unlock more weapon and slay the monsters faster\". THEN WHAT?! MH is the least rewarding game with clunky control and boring plots. I felt I was just wasting my lift playing this crap.… ",
    "gameID": 0,
    "author": "laundsallyn"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 2,
    "date": "2019-02-10T00:00:00.000Z",
    "score": 0.0,
    "comments": "Very buggy. Lots of disconnects. Key bindings change randomly. Laggy even if your PC is way better than the recommended specs.",
    "gameID": 0,
    "author": "ralast"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 4,
    "date": "2019-02-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "Best Monster Hunter game of all time. Cant wait for the addon. The PC version could be a bit more polished but all in all its a great game with a bright feature in the also western countries .",
    "gameID": 0,
    "author": "Firefall77"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2019-02-23T00:00:00.000Z",
    "score": 1.0,
    "comments": "This game is terrible. Very poor story, no remarkable NPCs, graphics is really awful - like console game before 10 past years, PC port have many issues, combat is boring and tedious. I really don\u0027t know why so much people love it. 3DS versions were so much better.",
    "gameID": 0,
    "author": "GingerCat77"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2019-02-24T00:00:00.000Z",
    "score": 10.0,
    "comments": "Very fun game! Can\u0027t wait for the expansion this Fall!.............................................................................................",
    "gameID": 0,
    "author": "Sentinel82"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2019-03-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "One of the best games ever made. Having spent 500+ hours on PS4 and 600+ hours on PC. I constantly feel drawn back to the deep combat, fantastic crafting system, beautiful environments, fluid and weighty animations, and the fantastic challenge of the higher difficulty end game monsters. With an expansion coming this year I would encourage anyone to pick this game up and give it a fairOne of the best games ever made. Having spent 500+ hours on PS4 and 600+ hours on PC. I constantly feel drawn back to the deep combat, fantastic crafting system, beautiful environments, fluid and weighty animations, and the fantastic challenge of the higher difficulty end game monsters. With an expansion coming this year I would encourage anyone to pick this game up and give it a fair shot. Personally, this game is in my top 5 of all time.… ",
    "gameID": 0,
    "author": "Soulss"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2019-03-07T00:00:00.000Z",
    "score": 2.0,
    "comments": "The combat system is terrible. I\u0027ve never seen anything worse, and the whole game is built on it. Graphics does not match the performance of the game... And I know what I\u0027m saying because I work in the CG industry and with game engines as well. Score 2 just because there were moments in the game with interesting fights.",
    "gameID": 0,
    "author": "Aleksor99"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2019-03-21T00:00:00.000Z",
    "score": 7.0,
    "comments": "This is my second game into the MH franchise, the first being 3 Ultimate. Throughout playing the game, graphic wise it is completely revamped, it has a lot more texture and quality to the world design which gives it more aesthetics. Cut scenes are beautiful and appealing but are not skippable which in some cases makes gameplay longer for no reason. Setting it on max graphic does giveThis is my second game into the MH franchise, the first being 3 Ultimate. Throughout playing the game, graphic wise it is completely revamped, it has a lot more texture and quality to the world design which gives it more aesthetics. Cut scenes are beautiful and appealing but are not skippable which in some cases makes gameplay longer for no reason. Setting it on max graphic does give you the best experiences but slows down actual gameplay and has surreal lags throughout. Other than that it is open and looks good 8/10. Gameplay is pretty wonky, movement is delayed by a bit and sensitivity isn\u0027t too good which none can be changed. Slower weapons like the great sword or switch axe tend to have the most problems with timing as attack delay is more noticeable compared to the other weapons. Next thing is playing on keyboard just ins\u0027t recommended because the key bindings are set to weird keys and you can easily forget each placement without long hours of practicing. A controller on the hand just works better and gives you maximum control. Going into gameplay itself it feels just like the other series but slightly more boring. An experienced veteran player are able to run through things faster because the attacking patterns of each monster is practical almost the same. While as newer players spend longer time periods because the tutorial teaches you nothing. Over time some find it boring as the actual storyline is non-existence with only repetitive events and there is no character development throughout at all. The Pros to this are the SOS system is quite nice, it sets up a room and other people can join at any given time to play with you, but there are sometimes connection errors which after that playing solo is more viable than co-op. 6/10 Overall, the game does feel like a MH game but leans more towards veteran players who want to zip through and grind out materials, while for newer players allows them to explore a more open and casual hunt without any difficulty hurdles. It is a good game if you want to just have fun and play with friends but not really something you would spend most of your free time on since its just grinding and repetitive for the most part.… ",
    "gameID": 0,
    "author": "2k19Rev"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2019-04-04T00:00:00.000Z",
    "score": 6.0,
    "comments": "the game is cool, but you feel like a second category player because with the implementation of patches do not bother to name the new items",
    "gameID": 0,
    "author": "valdrak"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2019-04-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best version of the best Monster Hunter. The best version of the best Monster Hunter.",
    "gameID": 0,
    "author": "Orioldash2"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2019-04-26T00:00:00.000Z",
    "score": 10.0,
    "comments": "Very good game. I love it. It got a lot of updates after some time. I can recommend it. A lot of the neg. reviews are not more up to date.",
    "gameID": 0,
    "author": "Hosenmaus"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2019-05-10T00:00:00.000Z",
    "score": 9.0,
    "comments": "Having played Monster Hunter since the start, I can confirm Monster Hunter: World is a culmination of everything the franchise has been wanting to do since the start. If you don\u0027t think so, it\u0027s okay, everyone can have their own opinions. Except you, ♥♥♥♥ you elitist prick. I will now point out all the reasons World is better than any other game in the franchise and in order to appealHaving played Monster Hunter since the start, I can confirm Monster Hunter: World is a culmination of everything the franchise has been wanting to do since the start. If you don\u0027t think so, it\u0027s okay, everyone can have their own opinions. Except you, ♥♥♥♥ you elitist prick. I will now point out all the reasons World is better than any other game in the franchise and in order to appeal to both veterans and newcomers into the franchise, I\u0027ll be comparing it to the older ones the newcomers haven\u0027t played yet: ◘ The maps aren\u0027t a cluster of small-segmented areas divided by an inconvenient loading screen of 10 - 30 seconds. They are all combined into one BIG map. And when I say big I don\u0027t mean: \"Hey Ron, you know that sausage you ate during our BBQ last weekend at my place. It was pretty big, huh.\" I mean Notorious B I G levels of scale. The maps are all ample in both ground level and verticality; each area is connected in ways that even after dozens of hours of gameplay you\u0027ll still be finding new shortcuts to transverse the level. And that\u0027s without mentioning the ♥♥♥♥-ton of items, creatures and resources spread around everywhere. ◘ The combat staple in Monster Hunter has always been your commitment to the hits and your actions, be it to chug a potion as slowly as humanly possible, or to spend fifteen seconds loading a hit with your greatsword only to have the monster move his head at the last second leaving you to hit the floor in embarrassment as your other teammates look at you in disapproval of your life choices. In the same vein of the combat in DARK SOULS. Ok, with the required DARK SOULS mention in the review out of the way, let\u0027s move on to why World\u0027s combat kicks♥♥♥♥♥ They lowered your commitment to the attacks and items JUST enough so you wouldn\u0027t want to kill yourself everytime you accidentally use a whetstone in the middle of battle. \"NO Richard. Right now is not the time to sharpen your sword. Why? Oh I dunno. Maybe because there\u0027s a ♥♥♥♥ing dragon about to light your♥♥♥♥♥on fire! You know what, I\u0027m done. We are done. I tried to put effort into this marriage but it\u0027s just not working out for me. I want you out of my parent\u0027s house by eight tomorrow. And no, you can\u0027t take our computer. Get a job.\" Also, mounting attacks. ◘ The Handler. If even after everything I just said you still think Monster Hunter 4, or Monster Hunter 1 for PS2(Hah!) is better. Or even worse, if you have the brain capacity of a shrimp too dumb to know that if he falls asleep he\u0027ll go out with the tide; Monster Hunter Stories, for the sole reason it\u0027s \"kawaii.\" Even if it is. I\u0027m sorry but I can\u0027t help you. You\u0027ll have to seek counsel elsewhere. And for the rest of you, good. I expected as much from you. Your father and I are proud of the person you have become.… ",
    "gameID": 0,
    "author": "Medhead"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2019-07-12T00:00:00.000Z",
    "score": 4.0,
    "comments": "The world is not appealing and not blended well, looks congested for nothing, the player new mechanism engine is good but the monsters animation is poor, and unrealistic. In addition, cannot be compared with SEKIRO nor Dark Souls, picking and gathering seeds from everywhere looks weird at the first the game was looking appealing but after playing I lost all the excitement.",
    "gameID": 0,
    "author": "ADHGO"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 4,
    "date": "2019-07-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "you guys are dumb the game IS MENT TO FEEL CLUNKY when you swing a big sword in irl it feels clunky right? THATS HOW IT SUPOSED TO BE YOU DUMBASSES THIS IS NOT A HACK AND SLASH GAME ITS A GAME WHERE YOU HUNT MONSTERS THAT ARE BIGGER THEN OF COURSE IT FEELS CLUNKY",
    "gameID": 0,
    "author": "theonlyone21"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-08-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "A great iteration of one of my favourite franchise. The formula has been greatly modernized and we can see that it paid off looking at the sales !",
    "gameID": 0,
    "author": "tantrum_chaise"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-08-27T00:00:00.000Z",
    "score": 6.0,
    "comments": "A game where all you do is hunt monsters many times to get gear so you can fight the next monster and each fight takes around 20 minutes. Very repetitive with nothing else to do, the game is lacking any depth. It\u0027s a rather shallow experience with a boring story. I love cats and the cute palico companion and love how interesting the monsters look. If you like grinding and fightingA game where all you do is hunt monsters many times to get gear so you can fight the next monster and each fight takes around 20 minutes. Very repetitive with nothing else to do, the game is lacking any depth. It\u0027s a rather shallow experience with a boring story. I love cats and the cute palico companion and love how interesting the monsters look. If you like grinding and fighting the same monster over and over again then it would be your kind of game. I spent $43 Aud on this and only keep playing as I want to get my moneys worth. The game is alright, fun to kill a monster the first time but I bit too repetitive as you need to kill it many times to be able to craft a full set of gear so I find it overly grindy and can\u0027t recommend as it is not fun enough.… ",
    "gameID": 0,
    "author": "PrincessRose"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-08-27T00:00:00.000Z",
    "score": 10.0,
    "comments": "Awesome Games After 1000hours ! Thanks Capcom with iceborne for 2020 ! Best ever game for PC MASTER RACE",
    "gameID": 0,
    "author": "Kah974"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-08-31T00:00:00.000Z",
    "score": 8.0,
    "comments": "Detailed review as of mid-September. I\u0027m new to the MH series. Summary: - Overall score 8. (Great game, but has MASSIVE flaws) - Gameplay: 8 (What keeps this from being a 9.5 is the sheer tediouness; more on this below). - Graphics: 9 (Poorly optimized. More on this below) - Audio: 9 (Good music, good sound effects) - Story: 6. (Not a huge factor in the final score - it\u0027s a game,Detailed review as of mid-September. I\u0027m new to the MH series. Summary: - Overall score 8. (Great game, but has MASSIVE flaws) - Gameplay: 8 (What keeps this from being a 9.5 is the sheer tediouness; more on this below). - Graphics: 9 (Poorly optimized. More on this below) - Audio: 9 (Good music, good sound effects) - Story: 6. (Not a huge factor in the final score - it\u0027s a game, not a book) Gameplay PROs: As a whole, solid and fun gameplay loop - buy weapons and items at HQ, go to the wilds to explore and find your objective, kill it or capture it, go home then do it again. Lots of weapons, lots of different styles of play. Lots of ways to cross-utilize resources (basically there are ways to convert certain unused resources into resources you want/need). Lots of different bosses. If you enjoy Dark Souls, Nioh, and Bloodborne, but are new to Monster Hunter, then there is a good chance you will like this game. Gameplay CONS: TEDIOUSNESS. UNMITIGATED TEDIOUSNESS. To help me explain, allow me to make up a term for it...let\u0027s call it MICRO-DISRUPTIONS. How do I define micro-disruptions? They are moments in gameplay where you cannot do anything for several seconds. Examples - stopping to heal, getting knocked down, getting stunned, etc. So, the examples above are normal in games. You get knocked down in Bloodborne, you have to stop to heal in Dark Souls, etc. In a way, micro-disruptions add depth to the game because you have to plan around prevention/minimization of said micro-disruptions. HOWEVER, in Monster Hunter World, micro-disruptions are EVERYWHERE and are EXTREMELY LOOONG. I promise you, you will NOT be able to go ONE MINUTE without being interrupted. To make things worse, this is a VERY SLOW game. If you thought Dark Souls was slow, this is MUCH, MUCH SLOWER. The micro-disruptions in Dark Souls are already long, usually 2-3 seconds (healing, getting knocked down then getting up, buffing your weapon, etc). In Monster Hunter World, micro-disruptions are far, far LONGER and more TEDIOUS, specially since one micro-disruption often leads to another. Let me give you a basic example from MHW - when you have to heal, you have to sheathe your weapon (~1.5 seconds), drink up the potion (~4 seconds), now you\u0027re ready to fight! So draw your weapon again (~1.5 seconds). That\u0027s 6 seconds of you not playing the game. Not good. Adding to our example, take into consideration that while you\u0027re healing, your chances of getting hit are greater (slow movement, weapon and shield tucked away). If you do get hit - and this will happen OFTEN specially when you\u0027re a beginner, the whole process of getting knocked down and getting up takes ~4 seconds. Don\u0027t forget that your healing was interrupted, so you have to attempt to heal AGAIN. Another ~4 seconds. Another source of extreme tedium is how fast monsters move and how often they run away. I understand that it makes sense for monsters to outpace you no matter what cause they\u0027re so much bigger; but while it makes sense, it results in tedious gameplay. If a monster does a dash or charge attack, you\u0027re guaranteed to have to run to it for ~2-8 seconds. This is assuming it doesn\u0027t charge in another direction while you\u0027re running toward it, which would mean you run more again. Then, eventually, no matter how little damage you\u0027ve managed to do, the monster will fly or run away. You will now have to find it again. Even if your scoutflies (GPS, basically) know exactly where the monster is, you\u0027re guaranteed to run toward it for several minutes. Remember that these monsters have massively high health pools. The end result is battles last anywhere from ~15 minutes to ~40 minutes, only ~60% of which is actually spent in the battle. These individual micro-disruptions are not so bad on paper, and they probably sounded good to the developers when they were making the game, but in practice, I can say with confidence it has a disastrous effect on enjoyment. This slowness makes the game needlessly cruel to beginners and even for experienced players. At any point in a battle, there is a distinct chance that you will be micro-disrupted for anywhere from 5 seconds to 15 seconds. Remember that these disruptions often chain together. Bad game design. Instead of making the game this slow they should have sped up the whole thing instead. Examples: sprinting should be much faster, item use should be much faster, knock-down-get-up should be much faster, etc etc etc. Of course monster should be faster to compensate. If Monster Hunter World were as fast as, say, Nioh, it would\u0027ve been a 9.5 out of 10 for me. Easily. But it\u0027s not. D*mn shame. Graphics: Beautiful visuals, but on i5-4690, GTX1070, 24 GB RAM, I\u0027m getting 30-60 FPS. The dips are intense. Hard to enjoy fully. CPU heavy! I\u0027m not sure how they would go about fixing this, but it needs to be addressed. Everyone below my specs is having a worse time trying to run this game. Not good. Needs optimization! Hope this helped!… ",
    "gameID": 0,
    "author": "joshbreviews"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-03T00:00:00.000Z",
    "score": 1.0,
    "comments": "เล่นไม่จบ learning curve สูงไป การต่อสู้ไม่น่าสนใจ ............................................",
    "gameID": 0,
    "author": "ningky"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "I dunno why MHW mixed on 6.4 lmao MHW is the best MH (and easiest one I think xD) pro: + monster hunting, the harder monster gives you a great reward + great environmental design, I love they \"alive\". Capcom doing awesome on these things. + music is awesome please make another MH like this, Capcom. + daily quest and seasonal event + nice adding English and Japanese language on subI dunno why MHW mixed on 6.4 lmao MHW is the best MH (and easiest one I think xD) pro: + monster hunting, the harder monster gives you a great reward + great environmental design, I love they \"alive\". Capcom doing awesome on these things. + music is awesome please make another MH like this, Capcom. + daily quest and seasonal event + nice adding English and Japanese language on sub or dub. since the old MH only using MH language, but they still have MH language in here cons - they nerf sword and shield (bring back oil meta pls) - bit problem on the connection server, but they keep fixing it. - we need more exploration map… ",
    "gameID": 0,
    "author": "amzngredpanda"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-13T00:00:00.000Z",
    "score": 10.0,
    "comments": "I loved the series of the game since playing monster hunter freedom unite and with new monsters and stunning graphics makes it worth buying and spending 100+ hours on it",
    "gameID": 0,
    "author": "tututulip"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-09-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "I have been a fan of the series since monster hunter 4 ultimate. The quality of life improvements are so substential that I could not go back to the older games. The one complaint I have is the design of the weapons. At the moment it\u0027s the base weapon plus a bit of fur / skin and teeth from the monster, which is considerable downgrade from insane amount of visual variaty of the older games.",
    "gameID": 0,
    "author": "Karakonjol"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-10-01T00:00:00.000Z",
    "score": 2.0,
    "comments": "Минусы: кривое управление, тупые заставки, тупой сюжет, бесящие персонажи Плюсы: котики",
    "gameID": 0,
    "author": "Nexitt"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2019-10-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "Beautiful game. I always dream to play MH titles on PC, and my dream comes true. PC control is finely tuned so you will not experience any \"this is a crappy port\" moment. There are options to change control scheme, those complain about controls probably did not discover the option to switch to mouse. (Go over to setting, there are options that ask you what alternative you want to use, andBeautiful game. I always dream to play MH titles on PC, and my dream comes true. PC control is finely tuned so you will not experience any \"this is a crappy port\" moment. There are options to change control scheme, those complain about controls probably did not discover the option to switch to mouse. (Go over to setting, there are options that ask you what alternative you want to use, and will suggest an alternative for KB\u0026M.) Weapons. As the game is on PC, and animations are much more fluid than previous titles, so it becomes a bit easy as weapons are much more responsive now. MH has its own combat system, and people tend to criticize it for being clunky or something. It is supposed to be clunky, so that every action is a risk-reward decision making. Back in 2G, Khezu was my teacher. It taught me when to strike, and when to roll away, and never be greedy. MHW lacks a monster like Khezu, so players might have a difficult time to learn how to play MH. First MH game was released in 2004, and Demon Soul was released in 2009, so please do not consider MH a soul game, and do not expect to play like in soul game in MH. With an open mind, you will quickly learn how to play the game, including some delicate details like rolling backwards when facing forwards is slower than rolling backwards when facing backwards. As long as you set the setting to mouse alternative, movement is 100% in your control.… ",
    "gameID": 0,
    "author": "Hecate2014"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2019-10-20T00:00:00.000Z",
    "score": 9.0,
    "comments": "Now i\u0027m played in mhw more than 500 hours and have HR 273 it\u0027s not so much but i\u0027m still love this game. Capcom make this game better and better but very slowly)) I was happy about mouse camera fix and hi-rez textures. Now i\u0027m waiting Iceborn. Game still have many lags, but not so critical. I love events system, you will never miss something like it in almost all multiplayer games. ForNow i\u0027m played in mhw more than 500 hours and have HR 273 it\u0027s not so much but i\u0027m still love this game. Capcom make this game better and better but very slowly)) I was happy about mouse camera fix and hi-rez textures. Now i\u0027m waiting Iceborn. Game still have many lags, but not so critical. I love events system, you will never miss something like it in almost all multiplayer games. For 500 hours i played only with insect glaive (mostly), Bow, Big sword and little Bow Gun. Well, here so many other things to do for me\u003d) Love how cool fights like Extreme Behemoth or Ancient Leshen, you need really good team and equipment to beat it, but efforts very fun and enjoyable. Want to give 10 but it\u0027s not perfect yet, hope Capcom will made it in the future.… ",
    "gameID": 0,
    "author": "cyberlaw4"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2019-11-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "While the initial launch of the PC version of the game was fairly rocky. Monster Hunter World has become a game well worth the time and money. The team have added a great deal of free content including quests, monsters, weapons, armor and more. In Monster Hunter World you take on the role of a new hunter of great beasts ranging from reptiles the size of sedans, to wyverns and dragons asWhile the initial launch of the PC version of the game was fairly rocky. Monster Hunter World has become a game well worth the time and money. The team have added a great deal of free content including quests, monsters, weapons, armor and more. In Monster Hunter World you take on the role of a new hunter of great beasts ranging from reptiles the size of sedans, to wyverns and dragons as big as a house. You have a wide variety of weapons to choose from. Weapons you can fire from further away, swords for getting close and personal and even a horn for supporting allies and bashing monsters. This game is one of the most rewarding franchises you can play. You can spend your time refining your skills with your weapon, tracking and following monsters, learning their weaknesses and hunting them down. Hunts are only as easy as you make and prepare for them. When you finally do take that monster down, you are rewarded with components you can use to upgrade your weapons and armor. Make heftier and stronger gear to hunt the next great beast. Perhaps the weakest aspect of the game is that this title carries the smallest list of available monsters you hunt. While that is a shame considering the monsters themselves are the content. This has been fixed with the patches mentioned earlier as well as the recent DLC content \u0027Iceborne\u0027. If you\u0027re a fan of action games and like the idea of playing co-op online to take on massive monsters, this game is for you. (Initially I would rate this game an 8/10 at launch but because of the effort put into making this such a complete and fun title it has to be a 10.)… ",
    "gameID": 0,
    "author": "GrungeHamster"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 1,
    "date": "2019-11-15T00:00:00.000Z",
    "score": 9.0,
    "comments": "they made a good game and after all the updates its worth the 9. the monsters added in the game are great and i love it. new armors , weapons and stuff.",
    "gameID": 0,
    "author": "FluffySpartan"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2019-11-16T00:00:00.000Z",
    "score": 7.0,
    "comments": "Боевка, графика, шикарные кувалды в 2 раза больше самого перса, кастомизация героя и питомца - все это великолепно. Оптимизация и управление очень плохо исполнены. На системе с i9 9900k + rtx 2080 + 32gb ram на ультра в 2к выдает 60-70 с просадками до 40. Пока что 7Боевка, графика, шикарные кувалды в 2 раза больше самого перса, кастомизация героя и питомца - все это великолепно. Оптимизация и управление очень плохо исполнены. На системе с i9 9900k + rtx 2080 + 32gb ram на ультра в 2к выдает 60-70 с просадками до 40. Пока что 7",
    "gameID": 0,
    "author": "wasabi250603"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2019-12-07T00:00:00.000Z",
    "score": 3.0,
    "comments": "This game is just bad. I don\u0027t understand all these people, who spend 100+ hours in it. Optimization is terrible, combat is so clunky, hitboxes are awful. Controls are so weird it\u0027s hard to actually enjoy the game. Missions are boring. The only good thing about this game are pretty good looking monsters.",
    "gameID": 0,
    "author": "Shinjuukyuu"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2019-12-15T00:00:00.000Z",
    "score": 10.0,
    "comments": "A fantastical experience that just keeps on giving, MONSTER HUNTER: WORLD is the best multiplayer RPG I have ever had the honor of playing.",
    "gameID": 0,
    "author": "Vieltoor"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-01-10T00:00:00.000Z",
    "score": 2.0,
    "comments": "I played this game around 19 Hours. I used Guides for Combat and also for hunting so i can get behind the idea real quick in 2020. Positives : - Graphics are still ok and has some enjoyable moments. - The Idea behind the \"Hunt monsters and get stronger so you can beat more monster\" is neat but also frustrating sometimes. - Almost every NPC in this game looks unique - Beating hugeI played this game around 19 Hours. I used Guides for Combat and also for hunting so i can get behind the idea real quick in 2020. Positives : - Graphics are still ok and has some enjoyable moments. - The Idea behind the \"Hunt monsters and get stronger so you can beat more monster\" is neat but also frustrating sometimes. - Almost every NPC in this game looks unique - Beating huge Monsters - a good amount of decorations and armor Negatives : - Combat system is disgustingly bad. If you like precise controls.. avoid this game. The Combat is clunky as hell and after 20 hours of trying.. i gave up. You are locked in combat stances and the character wont move unless you stop smashing the attack button or certain combos. Targeting does nothing except switching between targets so the camera can go ape **** and turn away from the selected target but even than your character refuses to relocate himself. - Stoy and Characters are so bad.. even a 12 year old could write a better story/character arc. - The handling of the controls are awful and the camera movements aren\u0027t good either. You have to manually change them until you found the perfect spot between \"slow camera rotation\" and \"OMFG what is happening.. \" - This game looks dead. No one wants to help new players at all. You are stuck on certain points in the game after you unlock the option to craft better gear. I tried the multiplayer 10 times on different time zones and only 2 out of those had up to 3 players.. ready to help me. - I did not like the \"tutorials\" at all. They felt like rushed piece of crap. It was simple written down but it was more like \"You can do this and that but dont ask if you can unlock other things later or do other stuff on certain times or whatever. Please have no questions! Thank you… ",
    "gameID": 0,
    "author": "Trollripper"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2020-01-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "one of the best game in the series. now with iceborne is full of quality of life improvements, classic monsters returned and the soundtrack is just amazing",
    "gameID": 0,
    "author": "MuriloMatos"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-01-12T00:00:00.000Z",
    "score": 8.0,
    "comments": "OVERALL - 8/10 A mediocre PC port but not the worst by any means. It\u0027s a game for a somewhat niche audience that will really fit the people who like it... but scare away those that don\u0027t relatively fast. It\u0027s had support since launch so quite a few reviews are out of date. This in itself is strange from a Japanese-based game since they are typically launched and all support isOVERALL - 8/10 A mediocre PC port but not the worst by any means. It\u0027s a game for a somewhat niche audience that will really fit the people who like it... but scare away those that don\u0027t relatively fast. It\u0027s had support since launch so quite a few reviews are out of date. This in itself is strange from a Japanese-based game since they are typically launched and all support is abandoned outside of DLC. Being a Japanese game though, as the great \"SsethTzeentach\" once said... it\u0027s a Japanese game so they have absolutely no idea what discounts or depreciating value is. Further reading is a more indepth review of various standard categories. Optimization - 7/10 (Extreme preference for new hardware) Still has no ingame FOV and the graphics settings are seemingly arbitrary, like they are reading reviews and implementing the very specific options people are upset about. But the game has been supported since launch, as previously said, so some claims about missing features or limited options are outdated. For instance the game now has 21:9 ultrawide support Controls - 4/10 (Mouse/Keyboard) As per the norm for a port from another platform... the controls are an absolutely terrible and asinine on Mouse/Keyboard. They\u0027ve changed them from the original ASININE controls the game launched with, and you can rebind the buttons... but you can\u0027t leave buttons unbound when saving or else it throws away your changes without warning. Controls - 8/10 (Controller) A controller is necessary for any sort of comfortable longterm play and you can get used to the many layers. Luckily I also played the PS4 version first so it came naturally. If preferable, maybe use the Mouse to browse menus to get rid of some of the convoluted nonsense if you can\u0027t handle it. The crafting menu, item management, and comparing things in the blacksmith are the troublesome areas. But you can still get used to using solely the controller after a while. Story - 0/10 Absolutely abhorrent story and irredeemable characters. It makes me lose faith in humanity that someone had to sit back and approve of this. Filled to the brim with unbridled cringe and objective stupidity. It can be broken down into 2 parts, being told to go kill something with extraneous nonsensical reasoning or constantly saving your retarded sidekick. Previous games had little-to-no story and followed a very baseline \"Go do this\" mercenary-style quest system. This game tries so hard to have \"deeper\" context that it\u0027s monumentally failed. It\u0027s also filled with unskippable and cringey cutscenes. So have fun with that. Gameplay - 7/10 As a Monster Hunter game, it does what it does. There\u0027s a grind loop and it works. The combat does what it does. I think alot of the criticism on PC comes from the very simplistic but also strangely complicated (at times) combat that dips into both the Dark-Souls style dodge/hit combat but keeps the standard RPG spongy enemies with a hint of jank. So it\u0027s a weirdly balanced and very abnormal game for PC. There ARE i-frames like Soulslike games, and you can equip armor to further buff this, so you can get away with some really dumb stuff. Another good (or bad) thing is that the hitboxes are absurdly accurate but the attacks have no tracking whatsoever. Enemies will consistently whiff attacks from low-effort strafing because of this. So they give enemies alot of omni-directional attacks or having the enemies themselves be extremely mobile. Meaning melee-combat can be absolutely cancerous at times while ranged-combat can be inconspicuously easy. So it\u0027s not a terrible game. It just speaks to a specific audience, like this franchise always has.… ",
    "gameID": 0,
    "author": "Heyzus"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-01-13T00:00:00.000Z",
    "score": 7.0,
    "comments": "Monster Hunter: World is my first real foray into the franchise after poking at demos for the older 3DS games prior. I\u0027m sure I\u0027m not the only one with that background, but I can say that World on the whole feels like an attempt to get more people into the series. MHW\u0027s premise is rather thin for a game of its scale. This is not in of itself a bad thing, but as a lore-hound I might haveMonster Hunter: World is my first real foray into the franchise after poking at demos for the older 3DS games prior. I\u0027m sure I\u0027m not the only one with that background, but I can say that World on the whole feels like an attempt to get more people into the series. MHW\u0027s premise is rather thin for a game of its scale. This is not in of itself a bad thing, but as a lore-hound I might have appreciated a little more fluff. Mechanically speaking however the game is significantly more complex, with more keyboard binds, at least as far as I can remember, then any game I have played in the past 15 years, with the possible exception of Sins of a Solar Empire: a 4X space strategy game. That MHW is an action game with this many binds is impressive, if at times kind of annoying. I would also regard it as strangely akin to Axiom Verge in that having tried both mouse and keyboard versus controller, neither is 100% comfortable for me to use and I find myself wishing I had an extra hand, or at least a few more neurons. You may wish the same when attempting to ascertain the breadth of content in MHW: There are fourteen different types of weapons to use, some melee, some ranged, some simple and others tactically complex, multiple environments to hunt in, a few dozen monster types with varying strengths and weaknesses and tables of dropped crafting materials, many, many items to pick up, craft, an arm-mounted \"slinger\" that can fire various types of found ammo and use and at least two different sets of armor and one of each weapon type to make for each monster, with the Iceborne expansion adding an entirely new \"grapple claw\" mechanic, more moves for the weapons and of course, a lot more monsters and gear to craft. In the vein of many Japanese games I have played in the past: The EDF series, Sengoku Basara, Navel Ops, and others: There is a staggering amount of stuff to do, find and make. MHW is, in a word, dense. If nothing else, you will get your money\u0027s worth in hours played by far, if the game is your bag. When hunting alone or with one other player, and I do recommend at least one other player, you have the option of being accompanied by a helpful cat-like creature called a Palico, who can use a selection of unique support items, gather materials, distract the monster for you, and generally be nice to have around. When playing with three or four players however, the Palicos stay behind to enforce the 4-player party size limit. And now the meat of it: The combat in MHW is certainly more accessible then earlier iterations of the franchise, but gameplay overall is notably clunkier and rigid when compared to contemporary titles, especially western ones. It took some hours for me to adjust to the various oddities of the game\u0027s design and hurdles of progression, not the least of which is your extremely limited defense and damage at the game\u0027s outset- you will regularly die in early quests and any quest thereafter you are not properly geared for, as player skill will not save you from getting one shot by a powerful attack, thus wasting one of your team\u0027s precious limited respawns per assigned quest, costing you time, money and patience. Gear levels aside, as I mentioned earlier I\u0027ve never been able to reach a real level of comfort with any control setup for MHW. Mouse and keyboard simply has too many separate binds to be usable within a reasonable frame of response time, not helped by a complete remap of the default binds accompanying the infamously delayed-for-pc Iceborne expansion, and locking character movement to eight cardinal directions versus the more nuanced directional control of an analog stick. Controller makes character movement and certain melee attacks and other inputs easier to perform, but hopelessly complicates aiming any projectile weapon or the grapple claw. And both control setups must contend with what I felt, at least initially, was a labyrinthine, archaic menu system and curiously unresponsive quick-use wheel. Aside from any of this, there is also the issue of the disparity in design quality between armors for the two available genders. Whatever your personal feelings on skimpy armor designs for female characters, there is simply a marked lack of quality and design creativity for the female armors. All that being said, MHW is nonetheless fun, perhaps inexplicably so at times. It\u0027s loud and colorful, with easily understandable icons, recognizable outlines for monsters, weapons and armors, reasonable load times, and it\u0027s very easy for friends to link up and do hunts together. Combat can be satisfying when all factors line up sufficiently, especially the mounting mechanic and grapple claw techniques. The map and guidance system is fairly robust. Above all, a bulk of my online friends have the game, and it is always in my experience better to play games of this nature with friends. Whatever its flaws, and there are many, MHW manages to be an entertaining and addicting experience.… ",
    "gameID": 0,
    "author": "Captain_Chaos"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-01-18T00:00:00.000Z",
    "score": 10.0,
    "comments": "Awesome game all the way through. The plebs who are complaining in these reviews are probably playing the game with a mouse and keyboard. If they had any sense, they would play with a controller. But they don\u0027t have any sense, do they? Also, I would hate to reinforce the notion that people who don\u0027t like a game are just too bad at it to \"get it\", but really -- the amount of people hereAwesome game all the way through. The plebs who are complaining in these reviews are probably playing the game with a mouse and keyboard. If they had any sense, they would play with a controller. But they don\u0027t have any sense, do they? Also, I would hate to reinforce the notion that people who don\u0027t like a game are just too bad at it to \"get it\", but really -- the amount of people here that are complaining that the combat is clunky is just unreasonable. If you get used to the combat mechanics, it\u0027s not clunky. It\u0027s different to other games similar to this one. Yes, in this game you get punished for making stupid decisions in combat. Boo-hoo.… ",
    "gameID": 0,
    "author": "AM0N"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2020-01-21T00:00:00.000Z",
    "score": 0.0,
    "comments": "Опять эти анимешные герои с огроменными мечами... Скучная однообразная, не интересная",
    "gameID": 0,
    "author": "Sashko"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-01T00:00:00.000Z",
    "score": 9.0,
    "comments": "Its my first Monster Hunter game and i have to say i didnt expect to like it this much. My only problem with this game is the way you get decorations.",
    "gameID": 0,
    "author": "BiionicGolem"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "This game is better than crack. Minus one point due to the desastrous issues at launch week.",
    "gameID": 0,
    "author": "Nerevarinho"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-22T00:00:00.000Z",
    "score": 6.0,
    "comments": "I got excited when it launched, because I have vague memories about the 2004 ps2 hit and they stuck to some visuals. All in all there is not much to do except grinding. Plus I did not like the slow combat movements, which i guess is a personal taste. For the high price they launched poor content.",
    "gameID": 0,
    "author": "Adriella01"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-25T00:00:00.000Z",
    "score": 2.0,
    "comments": "If you are thinking of buying now, don\u0027t buy! The game doesn\u0027t work! Constant problems, crashing the entire computer and there is still no decent fix from Capcom! I liked the game. I liked the world and would like to recommend this game to others, but honestly, I can\u0027t! The game had a bug that was fixed, but after an update, the game just became unplayable! No matter what graphicsIf you are thinking of buying now, don\u0027t buy! The game doesn\u0027t work! Constant problems, crashing the entire computer and there is still no decent fix from Capcom! I liked the game. I liked the world and would like to recommend this game to others, but honestly, I can\u0027t! The game had a bug that was fixed, but after an update, the game just became unplayable! No matter what graphics quality you are (ultra, high, medium or low), no matter that your windows and your graphics driver are fully updated, the game locks and locks the entire computer together, forcing you to restart it in order to use your machine. And Capcom just seems to ignore the issue, leaving the player unanswered on the official topics or here on Steam. The game is cool, but you will have little time to appreciate it, as you will be very nervous about the constant crashes… ",
    "gameID": 0,
    "author": "Doidorotto"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-26T00:00:00.000Z",
    "score": 9.0,
    "comments": "First game I\u0027ve played in the series and I\u0027m really blown away by it. I understand why a lot of people don\u0027t like the controls or how sluggish the combat feels, but to me that\u0027s what makes it so satisfying. The entire point is that it\u0027s not meant to be easy to be a little person with a massive weapon fighting a huge monster. I think with the way the combat is designed, the \u0027sluggishness\u0027First game I\u0027ve played in the series and I\u0027m really blown away by it. I understand why a lot of people don\u0027t like the controls or how sluggish the combat feels, but to me that\u0027s what makes it so satisfying. The entire point is that it\u0027s not meant to be easy to be a little person with a massive weapon fighting a huge monster. I think with the way the combat is designed, the \u0027sluggishness\u0027 is essential to the difficulty and the satisfaction of finally landing a huge hit on a monster. But like I said, it\u0027s not for everybody. As people who have even given the game 1\u0027s and 2\u0027s have said, the environments are breathtaking. Never been so blown away by a world in a game than when I first discovered the \u0027coral highlands\u0027. Just insane visuals. Reminds me of something like Pandora in the movie Avatar. The first time you see it, it\u0027s almost hard to comprehend how it could\u0027ve possibly been made by the developers. Each world genuinely feels like a living, breathing ecosystem. Which is even more impressive when you come to realize that they\u0027re not even particularly that big in size. The progression feels incredibly rewarding to me as well. As long as you avoid the defender gear, which is basically the Monster Hunter equivalent of heirlooms from World of Warcraft. Going on a hunt to get materials to work towards making a specific weapon is always exciting, although often these upgrades do become redundant to a certain point. The different weapon types are all fun to try out. I personally enjoyed the charge blade, the great sword and the long sword the most. But every weapon has its own unique complexity to it and they can all be mastered to a degree, though some are harder than others. Overall a great game and I\u0027m now interested in the series as a whole and any future games in the Monster Hunter saga.… ",
    "gameID": 0,
    "author": "Luper"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-12T00:00:00.000Z",
    "score": 8.0,
    "comments": "It is a great game with lots of different play style to learn and improve. Each weapon type really requires lot of learning to master and has different way of apporaching each monsters with it. It is fun to find your best favorite weapons etc to deal with each situations. However, the weapon balancing is bit too simple and you often reach the same ultimate weapon armor combination to dealIt is a great game with lots of different play style to learn and improve. Each weapon type really requires lot of learning to master and has different way of apporaching each monsters with it. It is fun to find your best favorite weapons etc to deal with each situations. However, the weapon balancing is bit too simple and you often reach the same ultimate weapon armor combination to deal the maximum damage. Therefore as you play further into the game you often end up in the same equipments as other players. Other than that it is a fun game to play and you will defnitely enjoy the first 200-300hrs of the game play.… ",
    "gameID": 0,
    "author": "sarakyuuri"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-16T00:00:00.000Z",
    "score": 6.0,
    "comments": "The game is just OK. I don\u0027t have any other connections to the Monster Hunter Series (this is my first Monster Hunter Game), so this should be a very objective view on the game. Graphics: This game looks fantastic! The people designing it did a really nice job with making the world feel realistic. Everything in this game just looks so detailed and beautiful! Gameplay: Gameplay wiseThe game is just OK. I don\u0027t have any other connections to the Monster Hunter Series (this is my first Monster Hunter Game), so this should be a very objective view on the game. Graphics: This game looks fantastic! The people designing it did a really nice job with making the world feel realistic. Everything in this game just looks so detailed and beautiful! Gameplay: Gameplay wise the controls are just OK. I\u0027m not sure if this is a recurring thing happening in the monster hunter series but the controls definetly felt clunky. It didn\u0027t feel very smooth. I also found that there wasn\u0027t any way to cancel a move after you made it. If you were using long sword and did an overhead slash infront of you there was no way to stop yourself from completing the action. Even worse if you press the button multiple times the character will proceed to do the action multiple times. However these were minor issues and could be easily overlooked. What really killed it for me was the terrible Palico AI and the annoying effects monster can place on you (stunned, poison, sleep). Here is an example of what can happen: You get stunned by a monster and you are on half health. Naturally you are immobile for a certain period of time. However! The monster is able to also posion or burn you causing you to lose health while immobile, plus the monster can knock you around while you are stunned giving you no way to dodge or avoid the attacks leading to fainting, Cases like being pushed against the wall with no where to go and being killed has happened to me WAY TOO often for me to be able to overlook this as an one time occurance. Also the Palico (cats/helper in combat in the game) is never able to deliever a vigorwasp (health potion) to me properly. When I find myself in need of one it always says that its too busy or whatever when it clearly doing nothing. Also monsters are way too overpowered! Tons of monsters out there are able to kill you in one or two hits. The beginner area should have easier to kill monsters, not an Anjanath that can one shot you using a flame thrower move. I recognize the fact that it could be just me who is bad at this game and more experienced players would be able to get out of these situations, but you have to keep in mind that for many people this is their first entry into the monster hunter series. Being a begginer at a game shouldn\u0027t impact the enjoyment of it. All of this combined with the fact that you can\u0027t actually remap controls on controller just made this game unenjoyable. However I won\u0027t be returning it as it still a decent game. It will probably become a game that I revisit like once every two weeks or so, definetly not one I would play everyday.… ",
    "gameID": 0,
    "author": "pinapelz"
  }
]
