[
  {
    "source": "https://www.trustedreviews.com/reviews/monster-hunter-world",
    "date": "2018-08-07T00:00:00.000Z",
    "score": 10.0,
    "comments": "For those with a penchant for punishment, a soft spot for stats, and a crush on brilliant combat – you simply have to buy this game.",
    "gameID": 0,
    "author": "Trusted Reviews"
  },
  {
    "source": "http://www.ign.com/articles/2018/08/07/monster-hunter-world-for-pc-review",
    "date": "2018-08-07T00:00:00.000Z",
    "score": 9.5,
    "comments": "Fitting for the series’ first ever western PC version, this isn’t a case of bringing flashy new exclusive content but a supremely stable, confidently-put-together package of what got all the console players so excited about in January. If it’s the first time you’ve gotten a chance to see what Monster Hunter is all about, this is as good a starting point as you’re likely to get.",
    "gameID": 0,
    "author": "IGN"
  },
  {
    "source": "https://www.gameinformer.com/review/monster-hunter-world/a-fertile-new-ecosystem",
    "date": "2018-08-07T00:00:00.000Z",
    "score": 9.3,
    "comments": "Monster Hunter: World’s PC version provides the same great hunting and gathering loops console players dove into earlier this year, and after having not played the series until now I’m absolutely hooked, both on the series and how the PC version enhances the experience.",
    "gameID": 0,
    "author": "Game Informer"
  },
  {
    "source": "http://www.digitallydownloaded.net/2018/08/review-monster-hunter-world-pc.html",
    "date": "2018-08-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "An amazingly done port. Graphics alone could be cause for some to leave the consoles behind in order to view this world the way that it really should be, but for others, it could be the start to the series that you’ve been waiting for as it makes itself easy to slide into and is now available on the PC.",
    "gameID": 0,
    "author": "Digitally Downloaded"
  },
  {
    "source": "http://www.jeuxvideo.com/test/897810/monster-hunter-world-la-version-pc-valait-elle-son-attente.htm",
    "date": "2018-08-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "PC players, the wait is over and it \u0027stotally worth it. This version of Monster Hunter World is smoother and offers more customisation options than its consoles counterpart. Yet it’s not really prettier though.",
    "gameID": 0,
    "author": "Jeuxvideo.com"
  },
  {
    "source": "https://www.pcgamesn.com/monster-hunter-world/monster-hunter-world-pc-review",
    "date": "2018-08-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "Simply put, Monster Hunter: World is one the finest action RPGs ever made and a unique, rich co-op title to boot. Spectacular and deep in equal measure, with the technical improvements of the PC version, it\u0027s happy hunting all round.",
    "gameID": 0,
    "author": "PCGamesN"
  },
  {
    "source": "https://www.pcgamer.com/monster-hunter-world-review/",
    "date": "2018-08-07T00:00:00.000Z",
    "score": 8.6,
    "comments": "Monster Hunter: World’s thrilling fights with fantastic beasts never get old, even if they require tiresome item management during downtime.",
    "gameID": 0,
    "author": "PC Gamer"
  },
  {
    "source": "http://cogconnected.com/review/monster-hunter-world-pc-review/",
    "date": "2018-08-07T00:00:00.000Z",
    "score": 8.2,
    "comments": "What it is though, is a damn good time.",
    "gameID": 0,
    "author": "COGconnected"
  },
  {
    "source": "https://www.gamespot.com/reviews/monster-hunter-world-review-deadliest-catch/1900-6416842/",
    "date": "2018-08-07T00:00:00.000Z",
    "score": 8.0,
    "comments": "While the PlayStation 4 version had its hiccups with getting the squad together, those aren’t present at all in the PC version, which makes the most of its integration with Steam to get you playing together in under a couple of minutes. It\u0027s refreshingly simple compared to laboriously typing out a string of numbers, or fiddling with the PlayStation 4’s subpar native interface.",
    "gameID": 0,
    "author": "GameSpot"
  },
  {
    "source": "https://www.rpgsite.net/review/7555-monster-hunter-world-pc-review",
    "date": "2018-08-07T00:00:00.000Z",
    "score": 8.0,
    "comments": "Monster Hunter: World is a staggeringly interesting game, with a breadth of content and plenty complex mechanical options, it\u0027s a perfect fit for the PC gaming enthusiasts that like like to lose themselves in a game for months at a time. The port may have come a good tick after the console versions, but the wait was largely worth it. While the slight performance issues and crashing are a disappointment, Capcom has already committed to fixing these problems. If you have been eagerly awaiting this version of the game, don\u0027t let some slight technical issues hold yold back from picking it up.",
    "gameID": 0,
    "author": "RPG Site"
  },
  {
    "source": "https://www.gamewatcher.com/reviews/monster-hunter-world-review/13051",
    "date": "2018-08-08T00:00:00.000Z",
    "score": 10.0,
    "comments": "Capcom perfected the combat formula over countless releases, but it wasn’t until Monster Hunter: World that they stripped away what ultimately was never much fun to begin with. You spend less time spent preparing, and more time actually fighting. And sales figures suggest, as we all expected, that Capcom really had something special sitting under all that bloat.",
    "gameID": 0,
    "author": "GameWatcher"
  },
  {
    "source": "http://www.gameblog.fr/tests/3121-monster-hunter-world-pc",
    "date": "2018-08-10T00:00:00.000Z",
    "score": 9.0,
    "comments": "This Monster Hunter World PC version is not perfect, notably because of lack of details in textures definition and some errors in binding of keyboard. And the game doesn\u0027t support cross-platform. For the rest, the game is a good experience with lots of graphics options like a 60FPS possibility and more. We just need to wait for an HD textures pack to have the ultimate PC version.",
    "gameID": 0,
    "author": "Gameblog.fr"
  },
  {
    "source": "http://www.4players.de/4players.php/dispbericht/PC-CDROM/Test/38849/83310/0/Monster_Hunter_World.html",
    "date": "2018-08-10T00:00:00.000Z",
    "score": 8.9,
    "comments": "Intense and motivating action in a visually impressive fantasy world.",
    "gameID": 0,
    "author": "4Players.de"
  },
  {
    "source": "https://es.ign.com/monster-hunter-world-pc/137636/review/monster-hunter-world-analisis-para-pc",
    "date": "2018-08-10T00:00:00.000Z",
    "score": 8.0,
    "comments": "PC players finally have the chance to try one of the best games of the year. After a great success in other platforms, it is time to play it in our PCs. Still, it needs a really high-specifications device in order to work properly.",
    "gameID": 0,
    "author": "IGN Spain"
  },
  {
    "source": "http://www.gamersky.com/review/201808/1085223.shtml",
    "date": "2018-08-13T00:00:00.000Z",
    "score": 9.7,
    "comments": "The PC version of Monster Hunter: World brings everything fantastic in the original game to Steam, and it even has better graphics performance and higher frame rate.",
    "gameID": 0,
    "author": "Gamersky"
  },
  {
    "source": "https://www.thegamesmachine.it/monster-hunter-world/monster-hunter-world-recensione-pc/",
    "date": "2018-08-13T00:00:00.000Z",
    "score": 9.5,
    "comments": "The series arrives for the first time on PC as a really well done adaptation. Monster Hunter World is a stable and ever so graphically satisfying experience.",
    "gameID": 0,
    "author": "The Games Machine"
  },
  {
    "source": "https://multiplayer.it/recensioni/monster-hunter-world-recensione-pc.html",
    "date": "2018-08-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "Monster Hunter World arrives on PC with a very successful porting.",
    "gameID": 0,
    "author": "Multiplayer.it"
  },
  {
    "source": "https://www.eurogamer.it/articles/2018-08-13-monster-hunter-world-pc-recensione",
    "date": "2018-08-13T00:00:00.000Z",
    "score": 8.0,
    "comments": "Finally the Monster Hunter series lands on PC with an explosive version. Too bad for some minor bugs that compromise the final score.",
    "gameID": 0,
    "author": "Eurogamer Italy"
  },
  {
    "source": "https://www.cgmagonline.com/reviews/monster-hunter-world-pc-review/",
    "date": "2018-08-14T00:00:00.000Z",
    "score": 9.5,
    "comments": "Monster Hunter World is one of the best games of the year, and it shines brightly on the PC.",
    "gameID": 0,
    "author": "CGMagazine"
  },
  {
    "source": "https://www.gamespew.com/2018/08/monster-hunter-world-review-port-majeure/",
    "date": "2018-08-14T00:00:00.000Z",
    "score": 8.0,
    "comments": "Despite its flaws, no other game compares to the thrill and sheer wonderment that beating a monster in a perfectly co-ordinated group can bring.",
    "gameID": 0,
    "author": "GameSpew"
  },
  {
    "source": "https://www.everyeye.it/articoli/recensione-monster-hunter-world-stagione-della-caccia-inizia-pc-40341.html",
    "date": "2018-08-16T00:00:00.000Z",
    "score": 8.5,
    "comments": "Its value lies also in the scalability of the experience that - it is true - is not yet perfect, but certainly has taken the right path.",
    "gameID": 0,
    "author": "Everyeye.it"
  },
  {
    "source": "",
    "date": "2018-08-19T00:00:00.000Z",
    "score": 8.5,
    "comments": "Quotation forthcoming.",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "http://www.darkstation.com/reviews/monster-hunter-world-pc-review",
    "date": "2018-08-20T00:00:00.000Z",
    "score": 9.0,
    "comments": "An amazing confluence of level and monster design, combat and gameplay systems, Monster Hunter: World is undoubtedly best Monster Hunter game. After spending well over a hundred hours outside the campaign, I think my original review score was actually a little low. As a game, Monster Hunter: World is still incredible, but the PC release can only be considered definitive for a relatively small number of power users with top-shelf GPUs and zippy processors. While everyone with a recent PC and decent graphics card can make the game work, for many players the best experience may still be on console.",
    "gameID": 0,
    "author": "DarkStation"
  },
  {
    "source": "https://www.3djuegos.com/juegos/analisis/29773/0/monster-hunter-world/",
    "date": "2018-08-20T00:00:00.000Z",
    "score": 9.0,
    "comments": "The PC version of Monster Hunter: World follow the steps of other ports for the platform. They’re always correct, but without that extra push of polish and options that could have been implemented.",
    "gameID": 0,
    "author": "3DJuegos"
  },
  {
    "source": "https://as.com/meristation/2018/08/20/analisis/1534743701_938373.html",
    "date": "2018-08-20T00:00:00.000Z",
    "score": 8.0,
    "comments": "Monster Hunter World is one of the best game of the year, and it\u0027s still solid, deep and challenging on PC. However, it has some important connection and stability problems.",
    "gameID": 0,
    "author": "Meristation"
  },
  {
    "source": "http://www.ztgd.com/reviews/monster-hunter-world-pc/",
    "date": "2018-08-22T00:00:00.000Z",
    "score": 9.5,
    "comments": "It is one heck of a ride, and with the systems in place it can be one of the most rewarding experiences players can have. On top of all that, Capcom has already planned to bring a lot of the missions and special events to the PC version over time, and they’re all free. The PC version holds up very well and even if with its co-op woes still present, this is one game that no one should miss out on, and now that it is everywhere, you have no excuse to not pick it up.",
    "gameID": 0,
    "author": "ZTGD"
  },
  {
    "source": "https://www.gry-online.pl/S020.asp?ID\u003d12850",
    "date": "2018-08-22T00:00:00.000Z",
    "score": 7.5,
    "comments": "It\u0027s not the worst console port I have seen, but it surely isn\u0027t the best one. The only real flaw of the PC version of Monster Hunter World is the buggy multiplayer mode. Everything else works just fine and deserves some attention - after all, this is one of the most captivating adventures in the virtual world ever.",
    "gameID": 0,
    "author": "GRYOnline.pl"
  },
  {
    "source": "https://www.gamingnexus.com/Article/5760/Monster-Hunter-World/",
    "date": "2018-08-27T00:00:00.000Z",
    "score": 8.8,
    "comments": "When it comes to Monster Hunter, the level of depth in the game leaves a lot to talk about, and I don’t think it’s possible to capture everything in this review. I personally think this entry in the series is a fantastic addition, both for returning fans and new players like myself. The game is a tremendous amount of fun, balancing challenge and reward perfectly in a way that made me want to keep on hunting for hours on end. The PC port itself has some technical issues which detract from the overall experience, but the quality of the game underneath more than makes up for it.",
    "gameID": 0,
    "author": "Gaming Nexus"
  },
  {
    "source": "https://www.gamestar.de/artikel/monster-hunter-world-keine-monster-portierung-aber-ein-monster-spiel,3333197.html",
    "date": "2018-08-31T00:00:00.000Z",
    "score": 8.7,
    "comments": "Monster Hunter World captivates with thrilling boss fights and its variety of weapons, but the PC port could have been technically better.",
    "gameID": 0,
    "author": "GameStar"
  },
  {
    "source": "https://www.game-debate.com/articles/3135/monster-hunter-world/bag-em-and-tag-em-monster-hunter-world-review",
    "date": "2018-09-04T00:00:00.000Z",
    "score": 8.5,
    "comments": "Arriving eight months late on PC, everything that can be said about Monster Hunter World already has done. Rest assured though, the wait was indeed worth it. Anyone looking for a deep action game they can potentially invest hundreds of hours into need look no further. This is Monster Hunter, back and better than it\u0027s ever been before.",
    "gameID": 0,
    "author": "Game Debate"
  },
  {
    "source": "https://opnoobs.com/reviews/adventure/monster-hunter-world",
    "date": "2018-09-13T00:00:00.000Z",
    "score": 8.0,
    "comments": "The first of its kind to be delivered to the salivating grasp of PC gamers, Monster Hunter: World has been well worth the wait as it delivers a breathtaking experience through a near-flawless port.",
    "gameID": 0,
    "author": "The Overpowered Noobs"
  },
  {
    "source": "http://www.cubed3.com/review/5087/1/monster-hunter-world-pc.html",
    "date": "2018-09-17T00:00:00.000Z",
    "score": 8.0,
    "comments": "Monster Hunter: World still has all the complexity expected from this series, but it dishes it out in much more palatable chunks than usual. It\u0027s still got a frightening amount of depth, but it feels manageable in a way that few in the series have pulled off before. Players may still feel a little lost from time to time, but a little guidance from series vets or other friends can drastically reduce the growing pains new players will likely experience. On top of all that, this is one of the best-feeling titles the series has had to date; so saddle up with some friends, and explore all the New World has to offer.",
    "gameID": 0,
    "author": "Cubed3"
  },
  {
    "source": "https://ragequit.gr/reviews/item/monster-hunter-world-pc-review/",
    "date": "2018-10-06T00:00:00.000Z",
    "score": 8.6,
    "comments": "Monster Hunter: World offers unique gameplay of high quality. However, the whole package could have been an order of magnitude superior if it included a properly designed online party system and the port from consoles was better taken care of. But even like this, MH:W is worth every penny it asks.",
    "gameID": 0,
    "author": "Ragequit.gr"
  },
  {
    "source": "https://www.mmorpg.com/monster-hunter-world/reviews/a-solid-title-that-will-soak-up-a-lot-of-time-1000000508",
    "date": "2018-12-19T00:00:00.000Z",
    "score": 8.5,
    "comments": "Monster Hunter World is a solid title that will soak up a lot of time if you enjoy beautiful graphics, hunting beautiful, dangerous and unique creatures, and crafting buttloads of weapons and gear.",
    "gameID": 0,
    "author": "MMORPG.com"
  }
]
