[
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2020-01-29T00:00:00.000Z",
    "score": 5.0,
    "comments": "Graphical details aside, ReForged feels less and rather shallow\nWith the release of Reforged, I just can\u0027t fathom the nostalgia of playing old school RTS game, it\u0026rsquo;s just awesome to see classics like this game being released. I feel like both the film/tv industry and game is re... Read Full Review",
    "gameID": 0,
    "author": "khardrosomega"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2020-01-31T00:00:00.000Z",
    "score": 1.0,
    "comments": "Warcraft III: Ruined\nWarcraft III but reworked (ruined) by greedy, lazy and lying company. Reworked without love and hope, definitely not worth a single cent. Game itself is very buggy, not delivering promised content and Activision Blizzard... Read Full Review",
    "gameID": 0,
    "author": "zaki08"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2020-01-31T00:00:00.000Z",
    "score": 1.0,
    "comments": "Blizzard forgot how to code\nTerrible frame rates about 20.The game crushing a lotThe graphics aren\u0027t really updated.No new promised cutscenes.The new policy - \"Blizzard now claims full copyright for player-made \u0026ldquo;custom game\u0026rdquo; mods\", does... Read Full Review",
    "gameID": 0,
    "author": "Leftel"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2020-02-01T00:00:00.000Z",
    "score": 1.0,
    "comments": "The gaming apocalypse has started...\nThe fact that Blizzard spent time and money to kill an 18 year old game that was still going strong is beyond chilling. It\u0027s absolutely appalling that we are FORCED to update and kill the game forever even if I bought t... Read Full Review",
    "gameID": 0,
    "author": "youtube1000"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2020-02-02T00:00:00.000Z",
    "score": 1.0,
    "comments": "CASH GRAB\nThis is a disgrace, don\u0027t buy it, stop giving money to this a-holes. Activision destroyed Blizzard, its like Bethesda and EA. Nowdays you should wait for reviews, DON\u0027T PREORDER, fanboys STOP!. Companies are ruinning our... Read Full Review",
    "gameID": 0,
    "author": "suko1983"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2020-02-03T00:00:00.000Z",
    "score": 1.0,
    "comments": "Not finished, horrible game\nWhat an absolute let down of a game and company. You took what was arguably one of the greatest rts games of all time (aside from Starcraft) and managed to \"REFORGE\" it into absolute trash. Let\u0027s take a look at the obvio... Read Full Review",
    "gameID": 0,
    "author": "drakso"
  }
]