[
  {
    "helpfulCount": 85,
    "helpfulScore": 69,
    "date": "2020-01-28T00:00:00.000Z",
    "score": 0.0,
    "comments": "Thank you, Blizzard. You dissapointed me. Why u can\u0027t reforged company? I bought this game only for this.",
    "gameID": 0,
    "author": "Velz"
  },
  {
    "helpfulCount": 35,
    "helpfulScore": 1,
    "date": "2020-01-31T00:00:00.000Z",
    "score": 8.0,
    "comments": "Игра не настолько плоха, чтобы её так сильно хаять. Главная проблема в рекламе и в урезанности, думаю скоро исправят.",
    "gameID": 0,
    "author": "DRKR"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-02-05T00:00:00.000Z",
    "score": 0.0,
    "comments": "This review contains spoilers, click expand to view. The game is literally horrible, it isn\u0027t an remastered, it got a lot of removed features, the Graphics are really bad and they removed the original Warcraft 3 game from all the stores, it is disappointing and sad, my childhood got destroyed… Expand",
    "gameID": 0,
    "author": "youngZuber"
  },
  {
    "helpfulCount": 11,
    "helpfulScore": 11,
    "date": "2020-03-03T00:00:00.000Z",
    "score": 0.0,
    "comments": "This review contains spoilers, click expand to view. This is the worst work of blizzard, turning the games we love to ashes i hope blizzard think very well this situation reorder the priorities money or happy users xD and we know already the answer xD… Expand",
    "gameID": 0,
    "author": "rfav1987"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-03T00:00:00.000Z",
    "score": 0.0,
    "comments": "After waiting for about an hour for the dreaded black screen to do something, I finally got to play the game that has received such hatred. But I wanted to give this a chance. I was foolish. This is only a remaster if you look at graphics. And even those lack the charm the original had. But somehow, in some way, Blizzard DEMASTERED this once beautiful piece of art. It\u0027s a perfectAfter waiting for about an hour for the dreaded black screen to do something, I finally got to play the game that has received such hatred. But I wanted to give this a chance. I was foolish. This is only a remaster if you look at graphics. And even those lack the charm the original had. But somehow, in some way, Blizzard DEMASTERED this once beautiful piece of art. It\u0027s a perfect reflection of the company. It\u0027s a husk of its former self. Rotting. Cold. And smells of corporate reed. Warcraft III wasn\u0027t remade, remastered, or re-released. It was slaughtered like a stuffed pig with a gimp leg, and tossed in the drying and muddied riverbed of passion and creativity. And I can\u0027t even return to the game I once held so dear... because the toxic sludge oozing from this remaster has poisoned and ruined it. Physically and emotionally. My sympathy to the poor developers and artists that were forced to take part in this. No one should willingly have their names be part of such a disgrace.… Expand",
    "gameID": 0,
    "author": "WillowWhisps"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-03T00:00:00.000Z",
    "score": 0.0,
    "comments": "I am appalled that Blizzard would dare rip the original Warcraft 3 out from under me despite my avoidance to try to purchase the Reforged. Reforged broke my Warcraft 3 game and frustratingly downgraded the old client to their buggy mess. This is absolutely corporate greed at its worst and when coupled with unbounded, endless failures in competency I am left angrier at the situation than II am appalled that Blizzard would dare rip the original Warcraft 3 out from under me despite my avoidance to try to purchase the Reforged. Reforged broke my Warcraft 3 game and frustratingly downgraded the old client to their buggy mess. This is absolutely corporate greed at its worst and when coupled with unbounded, endless failures in competency I am left angrier at the situation than I thought possible.… Expand",
    "gameID": 0,
    "author": "hp94"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-03T00:00:00.000Z",
    "score": 0.0,
    "comments": "I have been playing Warcraft 3 since the beginning. And I am still playing it and now after the reforge, blizzard auto updates the old warcraft 3 and makes it unavailable to play offline! - A single player game. Blizzards games have always been my favorites but I don\u0027t think I will play more of them, except Diablo 2. I am even banning my kids to buy blizzard games in the future after thisI have been playing Warcraft 3 since the beginning. And I am still playing it and now after the reforge, blizzard auto updates the old warcraft 3 and makes it unavailable to play offline! - A single player game. Blizzards games have always been my favorites but I don\u0027t think I will play more of them, except Diablo 2. I am even banning my kids to buy blizzard games in the future after this betrayal!… Expand",
    "gameID": 0,
    "author": "Jormungandur"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-03T00:00:00.000Z",
    "score": 0.0,
    "comments": "This review contains spoilers, click expand to view. Dear Activision, Thanks for **** one of my favorite childhood games right in the ass, and without the God damned courtesy to give a reacharound. Worthless pieces of **** Stick to CoD you window lickers...… Expand",
    "gameID": 0,
    "author": "AlexStoll"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2020-03-03T00:00:00.000Z",
    "score": 10.0,
    "comments": "Nice example of testing on production......................................",
    "gameID": 0,
    "author": "MasterArthur"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-03T00:00:00.000Z",
    "score": 0.0,
    "comments": "There are several major features outright removed in Reforged or simply not functioning because it’s in a buggy state including player profiles, ladder system and custom campaigns. The updated EULA also discourages map makers and modders to participate in making content for Reforged. The cutscenes for the most part are undone and severely lacking in the quality Blizzard was once known for.There are several major features outright removed in Reforged or simply not functioning because it’s in a buggy state including player profiles, ladder system and custom campaigns. The updated EULA also discourages map makers and modders to participate in making content for Reforged. The cutscenes for the most part are undone and severely lacking in the quality Blizzard was once known for. The map textures are horrendous compared to the original game, the models are on par with Raid: Shadowlegends, this does not in any way feel like a homage to legendary classic Warcraft 3. Rather it feels like a slap in the face to Warcraft fans. If they didn’t ruin the original version of the game by merging the old client with this bug infested one, many people would not be complaining as much or refunding. I wouldn’t be complaining if they didn’t touch the original WC3 client. The issue is that they took out features from the original, released an unfinished product and downgraded classic WC3. Not even Bethesda was foolhardy enough to tamper with the original Skyrim when they released the special edition. This is an unmitigated disaster of a game, the developer \"update\" shows only the incompetency of the dev team leading this project further into the gutter. Rather than adding back basic features, fixing cutscenes and restoring the original client of WC3 they have doubled down on their justification for this mess of a game. I will no longer be supporting Blizzard games due to this disaster, you\u0027ve ruined the game I enjoyed for most of my childhood. Reflect on what made the original WC3 a 9.2 user score and 92/100 critic score and how you\u0027ve ended up as the worst rated game in history. Goodbye Blizzard, I would say we\u0027ve had a good run but we obviously haven\u0027t.… Expand",
    "gameID": 0,
    "author": "Konrack"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-03T00:00:00.000Z",
    "score": 0.0,
    "comments": "What they promised and showed was not fulfilled. The classic version is forcibly updated. The cut-scenes remained old. Effects and sprites are old. But the worst thing is the translation (I can’t say anything about the English version. But there’s something wrong here as well). Ears are bleeding from the new translation! If the classic version is completely separated fromWhat they promised and showed was not fulfilled. The classic version is forcibly updated. The cut-scenes remained old. Effects and sprites are old. But the worst thing is the translation (I can’t say anything about the English version. But there’s something wrong here as well). Ears are bleeding from the new translation! If the classic version is completely separated from \"REFORGED\", then it will be possible to change the rating of the game.… Expand",
    "gameID": 0,
    "author": "CrazyGhostRider"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-03T00:00:00.000Z",
    "score": 0.0,
    "comments": "Oh man. I have refunded it. Gave it some time after release but the reactions where even worse than the game. Blaming the expectations and still trying to get 30-40 EUR? Is this just a joke or a nightmare? If it was a release to honor the lang and hard working community and it was free... But it is never worth what Blizzard is trying to get.",
    "gameID": 0,
    "author": "wajo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-03T00:00:00.000Z",
    "score": 0.0,
    "comments": "This review contains spoilers, click expand to view. Ужасная игра от омерзительной компании. Заслуженные ноль баллов за \"качество\" близзард… Expand",
    "gameID": 0,
    "author": "BiteLikeASnake"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-03T00:00:00.000Z",
    "score": 0.0,
    "comments": "O que a Activison Blizzard fez foi crime contra seus próprios fãs, propaganda falsa, mentiras e falta de respeito ao extremo com seus jogadores, o que ela espera com tudo isso? Nesse caminho eles só tendem a perder muitos fãs e muito dinheiro. Estão muito sem noção, estão cegos pelo dinheiro cagaram de várias formas pros usuários de pc inclusive no momento de anuncio de DIablo IV paraO que a Activison Blizzard fez foi crime contra seus próprios fãs, propaganda falsa, mentiras e falta de respeito ao extremo com seus jogadores, o que ela espera com tudo isso? Nesse caminho eles só tendem a perder muitos fãs e muito dinheiro. Estão muito sem noção, estão cegos pelo dinheiro cagaram de várias formas pros usuários de pc inclusive no momento de anuncio de DIablo IV para mobile, eles estão cagando pra todos os consumidores deles, só querem a grana e xau, bando de criminosos safados, deveriam responder judicialmente por isso e devolver o dinheiro de todos e não censurar como fizeram, sacanearam toda a comunidade e cagaram em cima do jogo tirando as funções mais importantes para impedir os usuários de criar mapas para eles(usuários) para reter toda a grana para a empresa, são criminosos, não tenho nem palavras pra definir essa corja de corruptos e cegos por dinheiro.Tenho nojo da Activision Blizzard.… Expand",
    "gameID": 0,
    "author": "EmanuelJanebro"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-04T00:00:00.000Z",
    "score": 1.0,
    "comments": "As a fan of the Rts genre and as a Warcraft fan, I\u0027m sorry, but this is a farce.",
    "gameID": 0,
    "author": "leo1linksalvaje"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-04T00:00:00.000Z",
    "score": 10.0,
    "comments": "I just came here because I told my friend who was playing Nasus in ARAM: \"If you finish the game I\u0027ll rate Warcraft III: Reforged a 10\" and he went and finished the game.",
    "gameID": 0,
    "author": "Rennyo"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2020-03-04T00:00:00.000Z",
    "score": 0.0,
    "comments": "Don\u0027t you guys have browsers to launch our menu for playing this browser game?? omfg blizz.....",
    "gameID": 0,
    "author": "Slare"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2020-03-04T00:00:00.000Z",
    "score": 0.0,
    "comments": "failure, bugs, false advertising. not worth your money, dont buy this game, not worth the money!!",
    "gameID": 0,
    "author": "aaa22"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-04T00:00:00.000Z",
    "score": 0.0,
    "comments": "Pre-ordered it a long time ago. I\u0027ve played and enjoyed the old version for years. This \"reforge\" version just doesn\u0027t even deserve to be a free indie-project. Awful interface, no reconnect function, no rating, the trailer was the only one really good improvement in cut-scenes, all forums are in complaints about consistently game crashes. I really loved Blizzard games before, but theyPre-ordered it a long time ago. I\u0027ve played and enjoyed the old version for years. This \"reforge\" version just doesn\u0027t even deserve to be a free indie-project. Awful interface, no reconnect function, no rating, the trailer was the only one really good improvement in cut-scenes, all forums are in complaints about consistently game crashes. I really loved Blizzard games before, but they continue to ruin them...… Expand",
    "gameID": 0,
    "author": "Melfor"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-04T00:00:00.000Z",
    "score": 0.0,
    "comments": "La mayor estafa desde el timo de la estampita!!! Asco de compañia mucho asco, Activiion-Blizzard",
    "gameID": 0,
    "author": "Tamfox"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-04T00:00:00.000Z",
    "score": 0.0,
    "comments": "False advertising, pathetic effort. Don\u0027t ever preorder! I may never buy another Blizzard game again.",
    "gameID": 0,
    "author": "phlathead3"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-04T00:00:00.000Z",
    "score": 0.0,
    "comments": "Creo que cuando se lanzó Reforged, muchos aspectos de la campaña original de Reign of Chaos y Frozen Throne estaban rotos o a medias, y todavía existen algunos problemas que existían en las campañas originales.",
    "gameID": 0,
    "author": "gexik84"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2020-03-04T00:00:00.000Z",
    "score": 0.0,
    "comments": "It\u0027s a worse version of the game. A massive failure by Blizzard. Disrespectful to the community.",
    "gameID": 0,
    "author": "bunnicula352"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2020-03-04T00:00:00.000Z",
    "score": 0.0,
    "comments": "I was soo excited to have one of my favorite childhood games being re-released... what I got was a reskinned version which actually looks worst than the original with this half cooked shoddy excuse for a remaster.",
    "gameID": 0,
    "author": "TheDerz"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-05T00:00:00.000Z",
    "score": 0.0,
    "comments": "This review contains spoilers, click expand to view. Worst update ever, cant play classic single or multiplayer games using original cd keys.… Expand",
    "gameID": 0,
    "author": "DanielGlavan123"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-05T00:00:00.000Z",
    "score": 0.0,
    "comments": "First of all i have to say old version still better graphic animations. But remastered version got more detailed graphics for higher resolutions. This game not include what we saw in blizzcon. Cinematics like a dumb. No custom game mods... There is no way... It cant be remastered.",
    "gameID": 0,
    "author": "Ledox"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-05T00:00:00.000Z",
    "score": 1.0,
    "comments": "They lied about almost everything. It was very much false advertised. Delayed but still very unfinished when released. Hardly any MP functions. Just a remaster in HD that\u0027s it. Hardly worth maybe 5, max 10euro",
    "gameID": 0,
    "author": "Wvm"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2020-03-05T00:00:00.000Z",
    "score": 0.0,
    "comments": "anneni sikiyim blizzard, en sevdiğim oyunu mahvettin göt kafalılar amınıza koyıyım",
    "gameID": 0,
    "author": "synexin_666"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-05T00:00:00.000Z",
    "score": 0.0,
    "comments": "What is the t say that already hasn\u0027t been said? Not much in my opinion. The issues with this game are rampant and are absurd in both quantity and severity.",
    "gameID": 0,
    "author": "Greenfishes"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2020-03-05T00:00:00.000Z",
    "score": 10.0,
    "comments": "I honestly played through it and had a blast! These bandwagons giving the game a negative score probably don\u0027t even own the game and are just doing it because of the Hearthstone controversy. I love the upgraded graphics units and current smooth game play. Yes, it had some issues at launch, but, come on! What game hasn\u0027t?! They are ironed out and game run fine! I\u0027m currently playing itI honestly played through it and had a blast! These bandwagons giving the game a negative score probably don\u0027t even own the game and are just doing it because of the Hearthstone controversy. I love the upgraded graphics units and current smooth game play. Yes, it had some issues at launch, but, come on! What game hasn\u0027t?! They are ironed out and game run fine! I\u0027m currently playing it again on hard and I have not run into any issues. You morons need to get a life… Expand",
    "gameID": 0,
    "author": "favipx21"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-05T00:00:00.000Z",
    "score": 0.0,
    "comments": "Why bother making a good remade game like Resident Evil 2 when you can milk your fanbase for with the hastily put together, piece of junk game that barely functions. Not only that, but it also wrecks the perfectly goo and WORKING game from 2002. Check yourself, \u0027ACTIVISION\u0027 Blizzard.",
    "gameID": 0,
    "author": "AngryBaneling"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-05T00:00:00.000Z",
    "score": 0.0,
    "comments": "What a terrible joke. Not only did they tarnish the reputation of the original game with whatever botched release this counts as, but they went back and made sure that the original game got ruined as well. The day where you saw the Blizzard logo and it was a mark of quality, is now gone. It\u0027s never coming back.",
    "gameID": 0,
    "author": "Samboli"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-05T00:00:00.000Z",
    "score": 0.0,
    "comments": "Look how they massacred my boy... How new full price game is worst than 2002 orginal",
    "gameID": 0,
    "author": "Mehwhy95"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-05T00:00:00.000Z",
    "score": 0.0,
    "comments": "This entire ACTIVISION company must be purged. Damn when blizz did good...",
    "gameID": 0,
    "author": "IvanTsenov"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-06T00:00:00.000Z",
    "score": 0.0,
    "comments": "Created an account just to express my fury of losing all my campaign progress after my HD with the game installed died out. What is the point of an ONLINE ONLY 2020 game with no cloud save? The UI and cinematics are lackluster and not what they promised and we still don\u0027t have ladder on multiplayer. It is 100% a downgrade over the 20 year older version of the game. This ReforgedCreated an account just to express my fury of losing all my campaign progress after my HD with the game installed died out. What is the point of an ONLINE ONLY 2020 game with no cloud save? The UI and cinematics are lackluster and not what they promised and we still don\u0027t have ladder on multiplayer. It is 100% a downgrade over the 20 year older version of the game. This Reforged is a complete SCAM and destroyed the masterpiece legacy.… Expand",
    "gameID": 0,
    "author": "Seizon"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-06T00:00:00.000Z",
    "score": 0.0,
    "comments": "Trash game ever , netcode like **** The graphic sucks A waste of money , not worth buying",
    "gameID": 0,
    "author": "Chosenboyeee"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-06T00:00:00.000Z",
    "score": 0.0,
    "comments": "I got into the game when the Battle Chest was released many years back for the original WC3 with it\u0027s expansion. I was there for beta of reforged. I was there for release day. I watched it all unfold. I could have done with the poor ui and the non-delivery of nearly all that was promised content-wise. However, the game barely runs. In singleplayer, 4/5 times you go to play a missionI got into the game when the Battle Chest was released many years back for the original WC3 with it\u0027s expansion. I was there for beta of reforged. I was there for release day. I watched it all unfold. I could have done with the poor ui and the non-delivery of nearly all that was promised content-wise. However, the game barely runs. In singleplayer, 4/5 times you go to play a mission and on the following mission you will auto-defeat for no apparent reason. only way to fix it is to completely restart your game.. Worse even, you will crash to desktop quite often, especially when trying to play custom games online. What players have begun to refer to as \"desynchs\" happen all too often where you will sit at the \"loading map\" screen with the other players, after host has started the game, and you will sit and sit for mmm maybe 5-10 minutes (if you\u0027re lucky) and then the game will open the map for about 2 seconds where you will be suddenly crashed to desktop. WORSE EVEN sometimes you survive and get to see the other players suddenly disconnect at the start of your game and you and all the other players just sigh, attempt to remake and usually a repeat of the situation... Wc3 reforged is a readying experience for hell. The previous wc3 was killed. Servers are kaput. Profiles, gone. They offer an option hidden away in the ESC menu to attempt merging your old BNET profile into your new BNET 2.0 profile.. I tried to merge mine and it didn\u0027t work, God only knows how many others that\u0027s happened to. Ontop of that, they\u0027ve again broken many of the previous (original) wc3 maps from custom games. There\u0027s just so many balls dropped here I cannot possibly say they deserve a good rating. They have truly made the game worse. Now is it \"worse off\"? No, because thankfully there has been a community revival. Hopefully that gives enough meaning to Blizzard to not lose sleep over. Not that I feel they really give a **** anymore anyways.. It\u0027s all been downhill since Blizz North dipped.… Expand",
    "gameID": 0,
    "author": "BreathTaken"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-06T00:00:00.000Z",
    "score": 0.0,
    "comments": "This is some kind of joke blizzard? If was. That\u0027s not funny. A broken game and worst. You change the original game than we loved for that?",
    "gameID": 0,
    "author": "Joaodasilva21"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-06T00:00:00.000Z",
    "score": 0.0,
    "comments": "It \u0027s very bad \u003d( ! This looks like an unfinished alpha-beta and it looks like Blizzard is not going to fix it, although it should not have been expected after seeing how they released it .",
    "gameID": 0,
    "author": "CinderShoiler"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-06T00:00:00.000Z",
    "score": 0.0,
    "comments": "BLIZZARD WAKE UP! You have been such a great company because you have shown that you\u0027ve cared about your players. This \"reforged\" game is an atrocity, don\u0027t release something that doesn\u0027t live up to what you promised. If the game isn\u0027t done, don\u0027t release it! We want a good product, not this. Not only that, but you have ruined the original version of the game, if this could be given aBLIZZARD WAKE UP! You have been such a great company because you have shown that you\u0027ve cared about your players. This \"reforged\" game is an atrocity, don\u0027t release something that doesn\u0027t live up to what you promised. If the game isn\u0027t done, don\u0027t release it! We want a good product, not this. Not only that, but you have ruined the original version of the game, if this could be given a negative score, I would. This is just sad because I\u0027ve been a Blizzard fan for many years.… Expand",
    "gameID": 0,
    "author": "Rage128"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-06T00:00:00.000Z",
    "score": 0.0,
    "comments": "On its own it wouldn\u0027t be a terrible game, but so much promised and so little provided. Really disappointing money grab that I got a refund for.",
    "gameID": 0,
    "author": "Deneroth"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-06T00:00:00.000Z",
    "score": 0.0,
    "comments": "I would have paid double the price and not complained for the exact same game/UI/Voice acting with enhanced graphics. How can you mess a main menu this badly when 18 years ago you had a decent and fonctional one? Why can\u0027t you switch to the original voices even though you can play with the original graphics? How come the game and even the menus are super slow? On a computer that can runI would have paid double the price and not complained for the exact same game/UI/Voice acting with enhanced graphics. How can you mess a main menu this badly when 18 years ago you had a decent and fonctional one? Why can\u0027t you switch to the original voices even though you can play with the original graphics? How come the game and even the menus are super slow? On a computer that can run any 2019 game on Ultra mind you. How come 2020 cutscenes lack the spirit and energy of a 2002 game? Should I start talking about how every name for items got changed? Or maybe the fact that Holy Light and Hold position are bound to the same key? How about units not answering when you click on them making you believe you muted your game? Maybe I should mention the campaign loading screens that ironically don\u0027t load properly? You delayed the game for this? Who are you kidding?… Expand",
    "gameID": 0,
    "author": "Arcturus64"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-06T00:00:00.000Z",
    "score": 0.0,
    "comments": "I\u0027m done with blizzard! Game looks like garbage(I dont care about cinematics), they even achieve to kill the modding community too! I wont buy new Diablo too ANYTHING!!! You wont milk us again! here is 0!",
    "gameID": 0,
    "author": "GrizzlymanTR"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2020-03-06T00:00:00.000Z",
    "score": 0.0,
    "comments": "I didn\u0027t mind the game until I learned how poor programming is effecting pro players careers. Completely unacceptable.",
    "gameID": 0,
    "author": "Sojourn"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-07T00:00:00.000Z",
    "score": 0.0,
    "comments": "-Literally every f\u0027ing games and in diifferent maps desync -Ugly disgusting UI -No chat commands -No clan -NOT EVEN HAS A SINGLE PLAYER FUNCTION Congratz on making the one of the best game ever made and turn it into worst garbage ever All hail eurobattle and old wc3",
    "gameID": 0,
    "author": "wc3refukced"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-07T00:00:00.000Z",
    "score": 0.0,
    "comments": "a game they ruined. now rubbish. used to be a masterpiece with so much awesome moments",
    "gameID": 0,
    "author": "ccsmschulz"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-07T00:00:00.000Z",
    "score": 0.0,
    "comments": "They ruined my favorite game that stood for almost 2 decades. I was lied to about my rights to get a refund at the start and then ruined my classic copy with their 30GB of trash. Never write reviews but this has really got to me since release. The cant just sell lies and make us pay for half finished rubbish.",
    "gameID": 0,
    "author": "yeahpryme"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-07T00:00:00.000Z",
    "score": 0.0,
    "comments": "Por donde empezar.... Que decir de un juego que marco mi adolescencia, recuerdo de ir al ciber y jugar horas y horas con los amigos, y depues de tantos años yo seguia jugando en casa sobre todo a los Legion TD. Esta puta violacion que le habeis pegado al juego no tiene perdon, Blizzard estais muertos y no quiero volver a compraros ninguna mierda mas y ojala os abucheen en la Blizzcon aPor donde empezar.... Que decir de un juego que marco mi adolescencia, recuerdo de ir al ciber y jugar horas y horas con los amigos, y depues de tantos años yo seguia jugando en casa sobre todo a los Legion TD. Esta puta violacion que le habeis pegado al juego no tiene perdon, Blizzard estais muertos y no quiero volver a compraros ninguna mierda mas y ojala os abucheen en la Blizzcon a mas no poder, por engañar y por destrozar algo tan bonito. Sin Clasificatorias, sin campaña, sin clanes, sin na de naaaa, si no se podia ni wispear no me jodas... Con lo facil que lo teniais joder... solo tenias que ponerle ilusion y trabajo. Que os jodan mamonazos.… Expand",
    "gameID": 0,
    "author": "Rakxor"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-07T00:00:00.000Z",
    "score": 0.0,
    "comments": "Blizzard must close. Can\u0027t **** do anything starting from overwatch, hearthstone, world of warcraft and ending with this.",
    "gameID": 0,
    "author": "DjEnder"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-07T00:00:00.000Z",
    "score": 0.0,
    "comments": "Lose my classic ver. coz of that piece of sh... Terrible optimization, without new cinematic and redone missions...Just want some fast money... They even cant do proper refund.(coz of some problems they cant give my money back to my card, only on my blizz acc)...",
    "gameID": 0,
    "author": "Bernkastell"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2020-03-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "I love the original and I love reforged. It’s the same core game with better graphics. The gameplay is exactly the same as the original, so anyone complaining about gameplay has a problem with the original too. People need to remember that it’s still run on the same engine so the UI will stay the same. But it still has all the features of the original and holds up to it.",
    "gameID": 0,
    "author": "ChiefRokaCola"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2020-03-07T00:00:00.000Z",
    "score": 9.0,
    "comments": "Я ожидал, что Варкрафт получится примерно вот такой как есть, поэтому меня почти всё устраивает",
    "gameID": 0,
    "author": "Serey23F"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-08T00:00:00.000Z",
    "score": 1.0,
    "comments": "I have the game since 2002. I loved it. It took 3gb in my hard drive. they destroyed the game. is barely playable. *can\u0027t play it without installing a 30gb patch with 4k textures of which i don\u0027t care. * animations are cut in half, *lots of maps have been banned. *no ladder or competitive games *even official tournaments CRASH!! . Not going to give money to this crap. Stay away ☹️",
    "gameID": 0,
    "author": "dedidedi"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-08T00:00:00.000Z",
    "score": 0.0,
    "comments": "Reforged?!?! Its just remastered, and also downgraded... Also you can not instal old version... well done",
    "gameID": 0,
    "author": "DaBumTss"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-08T00:00:00.000Z",
    "score": 0.0,
    "comments": "Кто-то бормочет, что игра функционирует,с минимумом багов и типо она не заслуживает такой оценки, но это в основном продажные обзорщики (за что близам жёсткий минус, но и плюс за то что открыли глаза, какие они *** ). Такая оценка здесь не за игру, а лживый маркетинг и вырвиглазазный ремастер (фанаты делали лучше, но близард не захотели терять прибыль и обломали игру энтузиастам..)Кто-то бормочет, что игра функционирует,с минимумом багов и типо она не заслуживает такой оценки, но это в основном продажные обзорщики (за что близам жёсткий минус, но и плюс за то что открыли глаза, какие они *** ). Такая оценка здесь не за игру, а лживый маркетинг и вырвиглазазный ремастер (фанаты делали лучше, но близард не захотели терять прибыль и обломали игру энтузиастам..) Someone mumbles that the game works, with a minimum of bugs and tipo it does not deserve such an assessment , but it is mainly selling reviewers (for which blizam hard minus, but also a plus for opening your eyes, what they are ***). This assessment is not for the game , but false marketing and vyrviglazazny remaster (fans did better, but Blizzard did not want to lose profit and broke off the game to enthusiasts..)… Expand",
    "gameID": 0,
    "author": "steelrain"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-08T00:00:00.000Z",
    "score": 0.0,
    "comments": "Blizzard. It´s simply awful what they´ve made to their fans... From cut off features which were more than promised on the game´s presentation day to a hug disrespect for all of us which had the classic version which EVEN is no more accessible out of the new remaster´s engine.",
    "gameID": 0,
    "author": "JuGGernautISON"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-08T00:00:00.000Z",
    "score": 1.0,
    "comments": "It’s bad game, oh now is very very very bad game, now graphics, now sounds, now lan, now old game",
    "gameID": 0,
    "author": "stnv25"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-08T00:00:00.000Z",
    "score": 0.0,
    "comments": "farewells to my beloved Blizzard it was a long sweet relationship and it didn\u0027t had to finish this way",
    "gameID": 0,
    "author": "Tsipouro"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-08T00:00:00.000Z",
    "score": 0.0,
    "comments": "not up to Blizzard standards... Activision: let Blizzards respects it own standards.",
    "gameID": 0,
    "author": "silence9123"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-08T00:00:00.000Z",
    "score": 0.0,
    "comments": "Complex? it\u0027s boring i had the war 3 ROC and TFT for this. Simply I CANNOT **** PASS THE PROLOGUE SINCE IT CRASHES................. Eh. ACTIVISION SUCKS",
    "gameID": 0,
    "author": "temerare"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-08T00:00:00.000Z",
    "score": 0.0,
    "comments": "Blizzard. You ruined a 17 year old game completely so you could have the money and I hope now you can spend it on getting proper developers and doing some market research. Because you have all the grace of a reversing dump truck without any tyres on. So Blizzard return my money and get out of the market. You’re done. RIP Blizzard",
    "gameID": 0,
    "author": "chujoza98986"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-08T00:00:00.000Z",
    "score": 0.0,
    "comments": "Warcraft 3: Reforged! It is a game title from the past that strikes and swells up intense feelings of competitive combat! Orcs grunting, elves screaming, undead moaning? Disappointing!",
    "gameID": 0,
    "author": "Metacritic_Will"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-08T00:00:00.000Z",
    "score": 0.0,
    "comments": "Absolutely inexcusable the product they have delivered. It would be one thing if the features that Reforged \u003eAdded\u003c to the game were bad, however it just entirely broke a perfectly fine working old game. Many core features were removed, a lot of advertised content were straight up lies and they do not give any option to play the old version of the game under any circumstance. fps drops,Absolutely inexcusable the product they have delivered. It would be one thing if the features that Reforged \u003eAdded\u003c to the game were bad, however it just entirely broke a perfectly fine working old game. Many core features were removed, a lot of advertised content were straight up lies and they do not give any option to play the old version of the game under any circumstance. fps drops, desync, auto loss, game crashes, unplayable custom maps etc. are just a few of the absolutely game breaking bugs. They have even removed the the option to play Reign of Chaos altogether (except the altered Reforged campaign), which means you can not play the old version in multiplayer / custom map at all. No proper communication and little to no chance that they will salvage the mess they have created. To top it all off they actually charge 30 € just for the new graphics which in my eyes does not fit the original warcraft 3 design at all and is overall pretty disappointing.… Expand",
    "gameID": 0,
    "author": "Kelseran"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-08T00:00:00.000Z",
    "score": 0.0,
    "comments": "\"how they massacred my boy warcraft\" It hurts to see what they did to my lovely WC3 RoC/TFT :\u0027(",
    "gameID": 0,
    "author": "Vanbeef"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-08T00:00:00.000Z",
    "score": 0.0,
    "comments": "Biggest scam in Blizzard history! They robbed us from our money and served uncooked piece of crap!",
    "gameID": 0,
    "author": "Lord_gregor"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-09T00:00:00.000Z",
    "score": 0.0,
    "comments": "This should not have been released in the state that it is currently in. There\u0027s no good reason for the game to be missing features, to force you to play the reforged version, and to have been downgraded from what was initially advertised. Not worth your time or your money.",
    "gameID": 0,
    "author": "ShiroX3"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-09T00:00:00.000Z",
    "score": 0.0,
    "comments": "Игра представляет из себя хуй, который разработчики положили на канон и чувства фанатов трахать хуй сперма пирожок чусасус",
    "gameID": 0,
    "author": "Yadebil2004"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-09T00:00:00.000Z",
    "score": 0.0,
    "comments": "Hopes and promises that were all nailed. Worst remake ever. The cinemarics and cutscenes are still the same as the previous version. I don\u0027t wanna wast my cash on a piece #$%@.",
    "gameID": 0,
    "author": "Valiyaant"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-09T00:00:00.000Z",
    "score": 0.0,
    "comments": "RIP Blizzard. A reskin was the last thing the Warcraft community needed (even if it\u0027s a nice touch). Turns out it is (almost) the only thing this \"game\" brings. Bad UI, horrible online lobbies, glitches, crashes, no new content, **** policy on custom games. 2 years to design characters models? You somehow managed to do everything wrong. This game is far from finished. I created aRIP Blizzard. A reskin was the last thing the Warcraft community needed (even if it\u0027s a nice touch). Turns out it is (almost) the only thing this \"game\" brings. Bad UI, horrible online lobbies, glitches, crashes, no new content, **** policy on custom games. 2 years to design characters models? You somehow managed to do everything wrong. This game is far from finished. I created a Metacritic account just for this. Game refunded. Arthas: \"We\u0027re too late. These WC3:Reforged devs have all been infected. This entire Blizzard-Activision must be purged.\" Muradin: \"You lied to your consumers, and betrayed the community that made you so successful. What\u0027s happened to you, Blizzard? Is money the only thing you care about?\" Uther: \"Blizzard made this game nearly 20 years ago, and you’ve ground it to dust in a matter of days.\"… Expand",
    "gameID": 0,
    "author": "Perfeks"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-09T00:00:00.000Z",
    "score": 0.0,
    "comments": "There are some things that should never see the light of day, this game needed 5-6 more years of polish before it should\u0027ve been released considering how much it lacks, and performs. This isnt even beta viable. This shows me blizzard is now Activision. R.I.P.",
    "gameID": 0,
    "author": "Warcraftdoodoo"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-09T00:00:00.000Z",
    "score": 0.0,
    "comments": "The game is just bad. Might have been a good thing, an nostalgia. But seems the Blizzard as always doesn\u0027t care about us. All I can say is that this game is the worse game ever made. Just like in the competitive scenario, disconnect over disconnect. Shame Blizzard.",
    "gameID": 0,
    "author": "alexiva9"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-09T00:00:00.000Z",
    "score": 0.0,
    "comments": "Failure of a \"Reforge\". What we get here is just a wonderful example of greed and way how to BADLY run a company, and mistreat your clients. Luckily the Universe Hate the void and after Blizzards Disappearance (for me it no longer exists) there will come a trustworthy company with quality goods to get my money. Once a quality game company turns into this... Bye Blizzard",
    "gameID": 0,
    "author": "Madderdin"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-09T00:00:00.000Z",
    "score": 0.0,
    "comments": "Do not enter the classic game. Custom campaigns do not work. Generally deceived us.",
    "gameID": 0,
    "author": "jimmy12345"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-10T00:00:00.000Z",
    "score": 0.0,
    "comments": "Never before have I been this disappointed in a game. The fact that Blizzard are still selling this product which is nothing more than a reskin and cull of features from WC3 classic for $45 is a disgrace.",
    "gameID": 0,
    "author": "Cinquleur"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-10T00:00:00.000Z",
    "score": 0.0,
    "comments": "I am actually sad, because I planned to play this game. Also port the coop campaign (with the new PROMISED map editor) that a few guys did years ago and play that with my friends.",
    "gameID": 0,
    "author": "tokman2"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2020-03-10T00:00:00.000Z",
    "score": 10.0,
    "comments": "Я доволен игрой. Хоть при покупке предзаказа в сетевой игре иногда вылетало, но чего я ждал так - кампанию для одного игрока. Обещанная крутая графика, приемлемая озвучка, сделаны подвиды героев кампании(паладины, нетрезимы и т.д.), ослепительная анимация персонажей и т.д.. А со всеми остальными неуладицами метелица разберется.Я доволен игрой. Хоть при покупке предзаказа в сетевой игре иногда вылетало, но чего я ждал так - кампанию для одного игрока. Обещанная крутая графика, приемлемая озвучка, сделаны подвиды героев кампании(паладины, нетрезимы и т.д.), ослепительная анимация персонажей и т.д.. А со всеми остальными неуладицами метелица разберется.",
    "gameID": 0,
    "author": "Dalson"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-10T00:00:00.000Z",
    "score": 0.0,
    "comments": "Xjzjsjwjs sisjsjsjsj jsksjsnsshjsjs sijsiiwkwwisijs snsjzkzkksjw sjzjsjensnz",
    "gameID": 0,
    "author": "Borba000356"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-10T00:00:00.000Z",
    "score": 0.0,
    "comments": "I own a copy of the original WC3 + TFT and created an account here just take a huge dump on this pile of garbage. ty for your time",
    "gameID": 0,
    "author": "drabon"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-11T00:00:00.000Z",
    "score": 0.0,
    "comments": "They created this new cheap garbage version of the old game and now they took hostage the old warcraft 3.Disgusting...",
    "gameID": 0,
    "author": "xristos181"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "Played through the campaign prologue yesterday. The game looks great and the mechanics are still as I remembered them. Blizz did a great job refreshing this title rather than letting it die like WCI and WCII. After all, it is the essential setup for WoW.",
    "gameID": 0,
    "author": "jinteoh"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-11T00:00:00.000Z",
    "score": 0.0,
    "comments": "I have no idea how this got to be so bad. This couldn\u0027t have been worse if they tried. Absolute garbage.",
    "gameID": 0,
    "author": "Silkman1979"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2020-03-11T00:00:00.000Z",
    "score": 6.0,
    "comments": "I think wc3 reforged is very flawed. However with the amount of people giving this game a 0/10 i can\u0027t really take those \"reviews\" seriously. This game is NOT a 0/10 game. I personally picked it up just before it fully released. Somwhere in the beta, like many players warcraftIII was my favorite game growing up, mainly for the custom games. Contrary to what many people here claimI think wc3 reforged is very flawed. However with the amount of people giving this game a 0/10 i can\u0027t really take those \"reviews\" seriously. This game is NOT a 0/10 game. I personally picked it up just before it fully released. Somwhere in the beta, like many players warcraftIII was my favorite game growing up, mainly for the custom games. Contrary to what many people here claim the classic version of the game was borderline unplayable before reforged. small playerbase, constant crashes, ect. Since reforged i\u0027ve still had some crashes but notibally less. Most of my disconects were my internet falling off instead of the game fatal error\u0027ing on me. This for sure wasn\u0027t the case when i still played classic a year or two back. In classic i could almost never get a good game in. A lot of content got scrapped. For example reconecting to the game was promised at one point but not implemented. Just like many things were scrapped afterwards. The activision move to copyright custom maps is really terrible aswell. honestly someone should fire whoever makes these decisions. Reforged it\u0027self however has been amazing as a secondary game for me. I\u0027ve relived some of the fun i\u0027ve had in the past and for the first time really played the campaign seriously. I don\u0027t remember how it was when i played this in classic but it never felt quite the same as it did in reforged. I LOVED the campaign. for the first time in my life i really connected to the story and that\u0027s honestly quite fun. I almost never completely play a game start to end but wc3 reforged was a blast for me personally. i don\u0027t remember there being this many missions. Here\u0027s a small summary of my thoughts: Contrary to what many people here claim: -custom games performance has improved ALOT. no more automatic hosting bots and 10k ping games that were the result of cross server mergings. And way less desyncs. -Still some of the same bugs however, desyncs do still happen sometimes, reconnecting is still not added. -New models look really nice. there are a TON of them -24 player maps are pretty fun and they still fill up decently right now, eras zombie invasion with 24 players playing as denmark or morocco is amazing! -The Campaign is more fun than it ever was before. For the first time in my life i really loved playing through it. I haven\u0027t had this much of a blast playing a campaign since dishonered II. The story might still be the same but on reforged for the first time it got through to me. -Non custom PVP seems to be ruined. I personally never really played that too much but i know others do. However in all honesty before reforged only a few hundred players ever played classic pvp wc3 and most of those are way to good to have fun at it anyway. Final thoughts: It\u0027s honestly been a joy to see my favorite game of all time be playable in better graphics with newer models and so on. While the gameplay might still be most of the same warcraft 3 is a timeless game. Theres a reason we were still playing before reforged released. I am personally very happy that blizzard made this. While the execution hasn\u0027t been that great the campaign is amazing and custom games seem to function better. I hope they patch in some of the things they promised before, and maybe add some scrapped functions again. I hope blizzard isn\u0027t discouraged to keep working on this game and over time improve it. If they ditch this here this would be a \"failure\" but there is a LOT of potential to work with here. Alot of the decisions made were good. They should take that and give us some of the features they initially promised but scrapped along the way. There are a ton of people still playing. While it\u0027s currently rated as 0.6/10 it\u0027s definitely not what people are taking into account since alot of us are enjoying it alot still.… Expand",
    "gameID": 0,
    "author": "vlekje5"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 0,
    "date": "2020-03-11T00:00:00.000Z",
    "score": 10.0,
    "comments": "This review contains spoilers, click expand to view. Нормальная игра не знаю что вы ждали но мне новый варкрафт больше нравится, на старый смотреть противно… Expand",
    "gameID": 0,
    "author": "reforgedelnur"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-11T00:00:00.000Z",
    "score": 0.0,
    "comments": "This review contains spoilers, click expand to view. Warcraft 3 was my favourite game of all time and I was super hyped for Warcraft Reforged. Unfortunately Reforged turned out to be a buggy mess, several of the models look even worse than the original, a defeat screen would come up occasionally, ruining the campaign for no reason and worst of all some levels wouldn\u0027t even open up. Still this doesn\u0027t begin to describe the problems with this game. For some reason they thought it was a good idea to balance a game that was almost two decades old, the new hero models look all over the place and nothing like the original and to top it off they decided that the Wow-aesthetic was better than the original Warcraft style. Regardless, even with that it wouldn\u0027t have been that bad. But it gets Worse So much worse. The bugs for some reason prevent people from playing the original Warcraft 3 so you had to buy reforged, then they decided everyone needed to download the new reforged game and increase my just-at-few-GB game into a more than twenty Gb game. I live in a country with pretty damn poor internet so it took me almost 4 days to download the thing. And even when i did, I coulkdn\u0027t join anyones games initially, I couldn\u0027t play single player melee and I couldn\u0027t finish the campaign after randomly getting booted out of the games. And finally the worst part of all this: Custom games are dead Reforged killed almost all the custom maps so they couldn\u0027t be played. And to top it off they introduced a EULA that prevented people from making custom maps. Custom Maps are ruined. The chances of people fixing all of the lost maps (that were also deleted from my computer, thank god I kept a backup) are pretty damn abyssal, not to mention all thge fan maps, like Dragon Ball Z tribute or all those Naurto dotas. Blizzard has actually ruined my favourite game for what was merely meant to be a cash grab. All they had to do was make it so we could have Better models, instead they decided to go all out and beat Bethesda Creation club idea. Imagined if they introduced a Skyrim patch that deleted all mods and made it so all mods created are sole property of Bethesda. Blizzard killed one of the most popular RTS\u0027s on the planet so its no wonder they\u0027re getting negative reviews.… Expand",
    "gameID": 0,
    "author": "Good_Critic"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-12T00:00:00.000Z",
    "score": 0.0,
    "comments": "Screw blizzard... Screw Activision.. Still Salty over dota too.. Bring that Rating back down to 0.4!",
    "gameID": 0,
    "author": "The_Archdemon"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2020-03-12T00:00:00.000Z",
    "score": 10.0,
    "comments": "This review contains spoilers, click expand to view. Excellent game, who cry about game movie, lags and other **** - r idiot. Yes, game not like old version, but it\u0027s really Warcraft 3, the most cool RTS!… Expand",
    "gameID": 0,
    "author": "Kushelbek"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-12T00:00:00.000Z",
    "score": 0.0,
    "comments": "What can i say that hasn\u0027t already been said. This is pretty inexcusable, not only delivering a broken mess but ruining the original in the precess? What",
    "gameID": 0,
    "author": "smokingborito"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-13T00:00:00.000Z",
    "score": 0.0,
    "comments": "I was very excited, now i am totally disappointed. I am literally not refunding just to play it on \"classic mode\". Which means, I spent 30e to play game from year 2002.",
    "gameID": 0,
    "author": "Marek_svk"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-14T00:00:00.000Z",
    "score": 0.0,
    "comments": "Activision has made it clear that they will stop at nothing to kill Blizzard and prostitute its corpse for cash.",
    "gameID": 0,
    "author": "AJMans"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-14T00:00:00.000Z",
    "score": 0.0,
    "comments": "This review contains spoilers, click expand to view. Спасибо Blizzard за такую игру!!! Я любил полюбил вашу вселенную с 20-03 года. Спасибо ещё раз!!!… Expand",
    "gameID": 0,
    "author": "Sillvazavrik"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-14T00:00:00.000Z",
    "score": 0.0,
    "comments": "I had warcraft reighn of chaos and frozen throne now i have warcraft refunded wich i cant play, because for some reason it doesnt want to work. F** u too Blizzard!",
    "gameID": 0,
    "author": "Bbblly"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-15T00:00:00.000Z",
    "score": 0.0,
    "comments": "Broken promises, broken game. Blizzard lost another fan or apparently who matters to the company more: customer. Bye Blizz! We had a good run!...............",
    "gameID": 0,
    "author": "oklagija"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-15T00:00:00.000Z",
    "score": 0.0,
    "comments": "This review contains spoilers, click expand to view. thx thrashzard for killing my childhood I must pay for that texture pack with painted money.… Expand",
    "gameID": 0,
    "author": "wswsw"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-15T00:00:00.000Z",
    "score": 0.0,
    "comments": "The custom maps does not work, and no cinematics ?!? the game is so laggy!!!! WTF!!! I hope Blizzard will fix that really soon. Where are the original voices??",
    "gameID": 0,
    "author": "TimZagg"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-15T00:00:00.000Z",
    "score": 0.0,
    "comments": "RIP Activision Blizzard. I didn\u0027t bought this **** but they ruined the classic version of WarCraft 3. Not working in local games, not working the campaign, can\u0027t create and join to the custom games (rip classic dota). I hope this company will face massive layoffs and a complete reorganization of the management team.",
    "gameID": 0,
    "author": "AANGGG"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-15T00:00:00.000Z",
    "score": 6.0,
    "comments": "The game runs ok, it\u0027s just not a \"remaster\" and definitely not worth 30 euros. For 5 - 10 euros this would have been a great purchase, but with this price you can\u0027t help but feel robbed.",
    "gameID": 0,
    "author": "Tobby"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-16T00:00:00.000Z",
    "score": 0.0,
    "comments": "bad, not a proper way to make a game bad bad bad bad bad bad bad bad bad bad",
    "gameID": 0,
    "author": "harrywardy"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-16T00:00:00.000Z",
    "score": 0.0,
    "comments": "also... ich habe vorher immernoch das normale warcraft 3 gespielt, seit dem release von reforged ist das \"normale\" nicht mehr spielbar für mich, ich lagge nurnoch und fliege bei 10 spielen aus 8 raus... unspielbar, das macht mich so wütend das ich mir extra einen account mache ums mit 0 punkten zu bewerten. WTF blizzard, nicht nur das reforged kacke ist nein ihr müsst auch noch das orginalalso... ich habe vorher immernoch das normale warcraft 3 gespielt, seit dem release von reforged ist das \"normale\" nicht mehr spielbar für mich, ich lagge nurnoch und fliege bei 10 spielen aus 8 raus... unspielbar, das macht mich so wütend das ich mir extra einen account mache ums mit 0 punkten zu bewerten. WTF blizzard, nicht nur das reforged kacke ist nein ihr müsst auch noch das orginal vernichten... toll ! ich würde minus punkte vergeben wenns nur gehen würde.… Expand",
    "gameID": 0,
    "author": "Smint"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-17T00:00:00.000Z",
    "score": 0.0,
    "comments": "I create my metacritic account just to give this game 0 SCORE!!! F*UK YOU BLIZZARD!",
    "gameID": 0,
    "author": "ts113csd"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2020-03-17T00:00:00.000Z",
    "score": 0.0,
    "comments": "My disappointment is so massive I made a metacritic account just to review this. This must border on criminal with what they’ve sold to us compared to what was promised. Their silence on it is deafening. Get your refunds whilst you can because this is another Blizzard **** Dear lord, what a sad little game, Blizzard. You ruined a 17 year old game completely so you could have the money…My disappointment is so massive I made a metacritic account just to review this. This must border on criminal with what they’ve sold to us compared to what was promised. Their silence on it is deafening. Get your refunds whilst you can because this is another Blizzard **** Dear lord, what a sad little game, Blizzard. You ruined a 17 year old game completely so you could have the money… Expand… Expand",
    "gameID": 0,
    "author": "SuinoMaiale"
  }
]