[
  {
    "source": "https://wccftech.com/review/warcraft-iii-reforged-review/",
    "date": "2020-01-30T00:00:00.000Z",
    "score": 7.5,
    "comments": "Warcraft III: Reforged isn\u0027t the game that was promised, but is still a valuable reconstruction of one of the most influential titles in the history of video games. This release is, sadly, riddled with bugs as well as marred by the terrible decisions of Blizzard, particularly that of the false advertising that persists now even after launch. However, despite this, there\u0027s little doubting that Warcraft III: Reforged has a compelling story that, even eighteen years on, remains one of the most engaging in the genre. The gameplay holds strong to this day and with the tweaks and upgrades, this is an undeniable diamond in the rough.",
    "gameID": 0,
    "author": "Wccftech"
  },
  {
    "source": "https://www.digitaltrends.com/game-reviews/warcraft-3-reforged-review/",
    "date": "2020-01-30T00:00:00.000Z",
    "score": 6.0,
    "comments": "The highest praise I can give to Reforged is that it’s still Warcraft III. The stellar single-player campaign and strategic multiplayer action are all well preserved here. The updated graphics are a welcome addition, which replaces the original game’s out-of-date visuals with an expressive new look and feel. Unfortunately, the launch version of the game feels far from finished, with bugs and key missing features preventing the current build from being the definitive edition of Warcraft III. It will likely get there eventually, but it’s odd for a remaster to feel like it’s starting from scratch, not presenting an endpoint.",
    "gameID": 0,
    "author": "Digital Trends"
  },
  {
    "source": "https://www.eurogamer.it/articles/2020-01-31-warcraft-3-reforged-recensione",
    "date": "2020-01-31T00:00:00.000Z",
    "score": 7.0,
    "comments": "Warcraft 3 is such a powerful experience that simply outshines the many flaws of the Reforged operation. Some people wanted a complete remake, others called for #nochanges, and in the end we got the simplest remaster. But it still remains the remastered version of a masterpiece.",
    "gameID": 0,
    "author": "Eurogamer Italy"
  },
  {
    "source": "https://www.gamespace.com/reviews/pc-reviews/wc3-reforged-review-warcraft-with-a-fresh-coat-of-paint/",
    "date": "2020-01-31T00:00:00.000Z",
    "score": 6.0,
    "comments": "The initial plans for Warcraft 3: Reforged would have brought the community an ambitious new game, steeped in the classic gameplay and story of TFT \u0026 RoC. However, little by little the team started scaling back, starting with the story. Unfortunately, the finished product ended up being not much of an upgrade over the classic version of the game.",
    "gameID": 0,
    "author": "GameSpace"
  },
  {
    "source": "https://multiplayer.it/recensioni/warcraft-3-reforged-recensione.html",
    "date": "2020-01-31T00:00:00.000Z",
    "score": 6.0,
    "comments": "The question therefore arises: why should a Warcraft 3 player buy Reforged?",
    "gameID": 0,
    "author": "Multiplayer.it"
  },
  {
    "source": "https://www.gamer.no/artikler/anmeldelse-warcraft-iii-reforged/484038",
    "date": "2020-01-31T00:00:00.000Z",
    "score": 5.0,
    "comments": "So then we are left with Warcraft III, only with a bit nicer figure models and surroundings, and a small bunch of removed elements. If you have the old game from before, it is difficult to say that this renovation is worth the money. And when everything that\u0027s gone in Reforged is additionally removed from the old version of the game, it\u0027s hard not to scratch our heads and wonder what we\u0027re paying for. What\u0027s the point?",
    "gameID": 0,
    "author": "Gamer.no"
  },
  {
    "source": "http://www.jeuxvideo.com/test/1176981/warcraft-iii-reforged-remaster-juste-correct-pour-experience-extraordinaire.htm",
    "date": "2020-02-02T00:00:00.000Z",
    "score": 8.0,
    "comments": "Excellence demands excellence and Blizzard could have honored its great heritage in a better way. It remains one of the cornerstones of the strategy market, as well as an exceptional experience for any self-respecting video game lover.",
    "gameID": 0,
    "author": "Jeuxvideo.com"
  },
  {
    "source": "https://www.pcgames.de/Warcraft-3-Reforged-Spiel-62051/Tests/Review-Blizzard-Multiplayer-Remake-Remaster-Classic-1342496/",
    "date": "2020-02-02T00:00:00.000Z",
    "score": 7.0,
    "comments": "Yes, the original Warcraft 3 is still a great game, but it is also clear that Blizzard has missed the mark with this remaster. The singleplayer campaign and gameplay mechanics have aged astoundingly well and the visual update is mostly successful. Newcomers will most likely have a great time experiencing the story and its four distinct races, which are still a lot of fun to play. But where are the vastly improved cutscenes that Blizzard has promised? This is simply not the game that has been advertised. Multiplayer comes with its own problems, from missing features (like a ladder or custom campaigns) to small, but irritating technical issues. Most of it can be fixed, for sure, but it appears rather baffling to me that this is a game from the same studio that brought us masterpieces like Starcraft 2.",
    "gameID": 0,
    "author": "PC Games"
  },
  {
    "source": "https://metro.co.uk/2020/02/03/warcraft-3-reforged-review-a-horde-of-problems-12171291/",
    "date": "2020-02-02T00:00:00.000Z",
    "score": 6.0,
    "comments": "An inexplicably careless remaster, where none of the changes are unequivocally for the better and the experience is brought down further by numerous bugs and missing features.",
    "gameID": 0,
    "author": "Metro GameCentral"
  },
  {
    "source": "https://www.ign.com/articles/warcraft-3-reforged-review",
    "date": "2020-02-03T00:00:00.000Z",
    "score": 7.0,
    "comments": "Reforged is an uninspiring remaster, but Warcraft 3 itself is still a great game nearly two decades later.",
    "gameID": 0,
    "author": "IGN"
  },
  {
    "source": "https://www.thegamesmachine.it/warcraft-iii-reforged/warcraft-3-reforged-recensione/",
    "date": "2020-02-03T00:00:00.000Z",
    "score": 6.7,
    "comments": "Warcraft III is still one of the best RTS ever made, yet this Reforged edition is just a lazy remaster. That’s because many features are missing and the game is plagued by a significant number of technical issues.",
    "gameID": 0,
    "author": "The Games Machine"
  },
  {
    "source": "https://www.gamestar.de/artikel/warcraft-3-reforged-test,3353895.html",
    "date": "2020-02-03T00:00:00.000Z",
    "score": 6.6,
    "comments": "The remaster stays far below its possibilities and makes multiplayer worse than in the original. The single-player campaign is still great.",
    "gameID": 0,
    "author": "GameStar"
  },
  {
    "source": "https://twinfinite.net/2020/02/warcraft-3-reforged-review/",
    "date": "2020-02-03T00:00:00.000Z",
    "score": 6.0,
    "comments": "Reforged will never be the celebration of one of gaming’s most beloved IPs that it should have been, which is all rather depressing. As is the fact that despite the fun that I’ve had playing Warcraft 3: Reforged and for how it has reminded me what an incredibly influential and brilliant game it is, there’s no way I could recommend anyone outside of the absolute hardcore Warcraft fanbase to purchase it.",
    "gameID": 0,
    "author": "Twinfinite"
  },
  {
    "source": "https://screenrant.com/warcraft-3-reforged-review/",
    "date": "2020-02-03T00:00:00.000Z",
    "score": 6.0,
    "comments": "That the best parts of Warcraft 3: Reforged are ripped straight out of 2002 and the worst are the modern changes, however, does not speak highly of the total package that Blizzard has placed on offer in 2020.",
    "gameID": 0,
    "author": "Screen Rant"
  },
  {
    "source": "https://www.thegamer.com/world-of-warcraft-3-reforged-review/",
    "date": "2020-02-03T00:00:00.000Z",
    "score": 6.0,
    "comments": "Blizzard has truly shot itself in the foot with this one, as they have no doubt upset the core fan base of this amazing title. This remake should have risen from the ashes and helped Blizzard recover its reputation. In reality, it\u0027s likely purged the veterans from their fanbase and will be relying on the game\u0027s much-loved campaigns and multiplayer mode to bring in newcomers.",
    "gameID": 0,
    "author": "TheGamer"
  },
  {
    "source": "https://www.spaziogames.it/warcraft-iii-reforged-non-si-vive-solo-di-ricordi-recensione/",
    "date": "2020-02-03T00:00:00.000Z",
    "score": 5.5,
    "comments": "Warcraft III: Reforged is still one of the best RTS ever made, but it\u0027s also one of the worst remakes we have seen.",
    "gameID": 0,
    "author": "SpazioGames"
  },
  {
    "source": "https://www.4players.de/4players.php/dispbericht/PC-CDROM/Test/40155/84098/0/WarCraft_3_Reforged.html",
    "date": "2020-02-03T00:00:00.000Z",
    "score": 5.2,
    "comments": "WarCraft 3 definitely deserves better. The “revamped re-imagination\" is disappointing.",
    "gameID": 0,
    "author": "4Players.de"
  },
  {
    "source": "https://www.jeuxactu.com/test-warcraft-3-reforged-le-remaster-qui-fait-un-peu-mal-au-culte-120902.htm",
    "date": "2020-02-03T00:00:00.000Z",
    "score": 5.0,
    "comments": "Warcraft III Reforged could have been a hit remake, but in the end, it\u0027s a major disappointment with missing features, a lack of polish, and a lot of promises that failed to materialize.",
    "gameID": 0,
    "author": "JeuxActu"
  },
  {
    "source": "https://www.destructoid.com/review-warcraft-iii-reforged-579654.phtml",
    "date": "2020-02-04T00:00:00.000Z",
    "score": 6.0,
    "comments": "The old Blizzard, in fact, wouldn\u0027t have shipped the game so quickly at all. There are more sinister changes lurking below the surface, like the inexcusable choice to ruin the original Warcraft III launcher and bring it into the modern era: a cardinal sin.",
    "gameID": 0,
    "author": "Destructoid"
  },
  {
    "source": "https://vandal.elespanol.com/analisis/pc/warcraft-iii-reforged/67446#p-13",
    "date": "2020-02-04T00:00:00.000Z",
    "score": 5.7,
    "comments": "Reforged is just a new way to play the campaign of one of the best games ever made… but that’s pretty much. Blizzard has a lot of work to do to fix this and deliver the remaster the original deserves.",
    "gameID": 0,
    "author": "Vandal"
  },
  {
    "source": "https://www.criticalhit.net/review/warcraft-3-reforged-review/",
    "date": "2020-02-04T00:00:00.000Z",
    "score": 5.5,
    "comments": "While Warcraft 3 is still a phenomenal game to play today, Reforged is unfortunately a chaotic storm of failed promises, technical bugs and missed opportunities that makes a great game worse.",
    "gameID": 0,
    "author": "Critical Hit"
  },
  {
    "source": "https://www.dualshockers.com/warcraft-3-reforged-review/",
    "date": "2020-02-04T00:00:00.000Z",
    "score": 4.5,
    "comments": "This wet fart of a release that Activision-Blizzard gave us feels like they’re stepping on my childhood and then spitting in its eye even as the teacher is pulling it off me.",
    "gameID": 0,
    "author": "DualShockers"
  },
  {
    "source": "https://www.thesixthaxis.com/2020/02/05/warcraft-3-reforged-review-blizzard/",
    "date": "2020-02-05T00:00:00.000Z",
    "score": 6.0,
    "comments": "Warcraft III: Reforged is built upon such strong foundations, yet manages to be somewhat unremarkable in 2020, mired by technical hiccups and Blizzard’s clumsy messaging.",
    "gameID": 0,
    "author": "TheSixthAxis"
  },
  {
    "source": "https://www.pcgamer.com/warcraft-3-reforged-review/",
    "date": "2020-02-05T00:00:00.000Z",
    "score": 5.9,
    "comments": "An exceptional RTS let down by a very disappointing remaster.",
    "gameID": 0,
    "author": "PC Gamer"
  },
  {
    "source": "https://as.com/meristation/2020/02/05/analisis/1580873051_201659.html",
    "date": "2020-02-05T00:00:00.000Z",
    "score": 5.0,
    "comments": "What was going to be the dream of many fans of the saga ends up being a total disappointment. Only Campaign Mode is saved.",
    "gameID": 0,
    "author": "Meristation"
  },
  {
    "source": "https://www.3djuegos.com/juegos/analisis/33563/0/warcraft-iii-reforged/",
    "date": "2020-02-05T00:00:00.000Z",
    "score": 4.5,
    "comments": "An amazing RTS that deserved a better remaster. Warcraft III is still great, even moreso with the new graphics, but Reforged is a major disappointment because of the lack of polish, broken promises and missing social and multiplayer features.",
    "gameID": 0,
    "author": "3DJuegos"
  },
  {
    "source": "https://www.gameinformer.com/review/warcraft-iii-reforged/warcraft-iii-reforged-review-an-incredible-game-a-disappointing",
    "date": "2020-02-06T00:00:00.000Z",
    "score": 6.0,
    "comments": "Warcraft III: Reforged teaches the harsh lesson that sacred, legendary titles need to be revisited with only the utmost care. Core elements that made the original an absolute Earth-shaker still remain, but as a remaster meant to enhance the original experience, Reforged is greatly flawed.",
    "gameID": 0,
    "author": "Game Informer"
  },
  {
    "source": "https://www.strategygamer.com/reviews/warcraft-3-reforged-review/",
    "date": "2020-02-06T00:00:00.000Z",
    "score": 6.0,
    "comments": "This version of Warcraft III has welcome graphical updates to a great game, but it\u0027s not reforged enough to justify its price.",
    "gameID": 0,
    "author": "Strategy Gamer"
  },
  {
    "source": "https://www.everyeye.it/articoli/recensione-warcraft-3-reforged-ritorno-classico-47222.html",
    "date": "2020-02-06T00:00:00.000Z",
    "score": 6.0,
    "comments": "The difference from the version shown at the 2018 BlizzCon is indeed evident, so much so that Reforged appears as a lazy update, rather than a real \"remake\". There is no trace of the innovations that would have given an unprecedented cinematographic look to the campaign; even the new user interface has disappeared and the graphic restyling is not enough to cover up stumbling blocks and shortcomings that can only be partially covered by subsequent updating interventions.",
    "gameID": 0,
    "author": "Everyeye.it"
  },
  {
    "source": "https://pu.nl/artikelen/review/warcraft-3-reforged-review-terechte-rage-om-wacraft-reforged/",
    "date": "2020-02-06T00:00:00.000Z",
    "score": 5.0,
    "comments": "The promise of a glorious remake that everyone could have received a Resi 2-sized boner has turned out to be a nice nostalgia trip for many, but a source of frustration and misunderstanding for others. And that last time is unfortunately a little more justified than your average nerd craze.",
    "gameID": 0,
    "author": "Power Unlimited"
  },
  {
    "source": "https://www.windowscentral.com/warcraft-iii-reforged-review",
    "date": "2020-02-07T00:00:00.000Z",
    "score": 6.0,
    "comments": "Warcraft III: Reforged still delivers the same satisfying core gameplay and laudable campaigns, but Blizzard under-delivered on promises and removed features that made the original game something exceptional.",
    "gameID": 0,
    "author": "Windows Central"
  },
  {
    "source": "https://m3.idg.se/2.1022/1.730164/warcraft-3-reforged",
    "date": "2020-02-08T00:00:00.000Z",
    "score": 6.0,
    "comments": "At it\u0027s core, Warcraft 3: Reforged is as good, entertaining and addictive as ever. But that core has already turned into a teenager and feels unnecessarily outdated in many respects. This is a game that shows how difficult it can be to revive an immortal classic without stepping on toes.",
    "gameID": 0,
    "author": "M3"
  },
  {
    "source": "https://www.darkstation.com/reviews/warcraft-3-remastered-review",
    "date": "2020-02-10T00:00:00.000Z",
    "score": 7.0,
    "comments": "Had Reforged been an optional and free graphical update, undersold and understated and a gift to fans, I doubt there would be any backlash. Instead, Blizzard suggested a revolutionary re-imagining of one of gaming’s most popular titles and failed spectacularly to deliver it. Warcraft III: Reforged does not diminish the core experience that made the game great, but its relatively modest improvements are coupled with some missing features and technical issues that make it a disappointment.",
    "gameID": 0,
    "author": "DarkStation"
  },
  {
    "source": "http://www.merlininkazani.com/Warcraft_3_Reforged-oyun_inceleme-109928p1.html",
    "date": "2020-02-10T00:00:00.000Z",
    "score": 5.0,
    "comments": "It was a dream for many RTS players to enjoy Warcraft 3 with modern graphics. And it seems, it will stay as a dream.",
    "gameID": 0,
    "author": "Merlin\u0027in Kazanı (Turkey)"
  },
  {
    "source": "http://www.gameblog.fr/tests/3588-warcraft-iii-reforged-pc",
    "date": "2020-02-12T00:00:00.000Z",
    "score": 7.0,
    "comments": "Warcraft III Reforged is at least equal to itself and it is already something. Yes, its graphics engine fails to display a fluidity worthy of the finesse of its redesign. But the game mechanics, the storyboarding of the campaigns and augmented narration convince the player even more that he is facing one of the big names in the history of video games. If you are not a player who is looking to be sharp to enter esports, you will also have a great time online. Don\u0027t give in to blind bashing. Form your own opinion.",
    "gameID": 0,
    "author": "Gameblog.fr"
  },
  {
    "source": "http://www.cubed3.com/review/5794/1/warcraft-iii-reforged-pc.html",
    "date": "2020-02-12T00:00:00.000Z",
    "score": 5.0,
    "comments": "The heavy criticism towards Warcraft III: Reforged has nothing to do with the quality of the experience therein. This remains the wonderful real-time strategy that thousands of people have loved. The real problems begin when you take the changes of this remaster into consideration. The half-baked, unimpressive new engine and hit-or-miss design choices; the numerous bugs and network issues; and, finally, those mind-numbing, corporate-smelling decisions, like the fact that custom maps now belong to Blizzard, or how Reforged effectively ruins the original for those who don\u0027t even own the new game.",
    "gameID": 0,
    "author": "Cubed3"
  },
  {
    "source": "https://www.gameover.gr/reviews/40537-warcraft-iii-reforged-review",
    "date": "2020-02-14T00:00:00.000Z",
    "score": 5.0,
    "comments": "Warcrast 3 Reforged is a testament to laziness and greedy corporation mentality. Reforged implements just new animations and character models thus classifying the game as a simple remaster rather than a “reforge”. The new EULA, the mandatory usage of the new client (deleting features that existed for over 15 years) and the hefty 30 euros price tag showcase the gloomy practices behind this project.",
    "gameID": 0,
    "author": "GameOver.gr"
  },
  {
    "source": "https://www.gamewatcher.com/reviews/warcraft-iii-reforged-review/13162",
    "date": "2020-02-17T00:00:00.000Z",
    "score": 7.0,
    "comments": "A successful update of a great game’s presentation, but which removes a number of features that may leave old fans hurting.",
    "gameID": 0,
    "author": "GameWatcher"
  },
  {
    "source": "https://www.hobbyconsolas.com/reviews/analisis-warcraft-iii-reforged-pc-reimaginacion-queda-medias-582395",
    "date": "2020-02-17T00:00:00.000Z",
    "score": 5.5,
    "comments": "Warcraft III was a great RTS, and Warcraft III Reforged still is, but has a lot of issues. All races are balanced and the campaign is epic, but this remastered version has a number of issues that cannot be ignored, such as disconnecting from multiplayer or options that were in the original and gone in Reforged.",
    "gameID": 0,
    "author": "Hobby Consolas"
  },
  {
    "source": "https://www.softpedia.com/reviews/games/pc/warcraft-iii-reforged-review-529038.shtml",
    "date": "2020-02-18T00:00:00.000Z",
    "score": 7.0,
    "comments": "To put it bluntly, if you haven\u0027t played the classic yet, Warcraft III: Reforged is definitely worth your time, otherwise, wait for a deep discount. The remaster feels rushed with too many things missing or not up to par with what I had expected in terms of improvements. In this state, the best way to describe Warcraft III: Reforged is “serviceable.” Taken as a whole, just like the original, the remaster offers a great gameplay experience for newcomers, but there\u0027s not much here that would justify a purchase if you\u0027ve already played the classic.",
    "gameID": 0,
    "author": "Softpedia"
  },
  {
    "source": "",
    "date": "2020-02-18T00:00:00.000Z",
    "score": 3.0,
    "comments": "There’s nothing in Reforged that keeps me hooked in. I was sad playing it. Sad that it ultimately failed. That there are so many things that could have been done better – boldly and with more polish. [03/2020, p.48]",
    "gameID": 0,
    "author": ""
  },
  {
    "source": "https://opnoobs.com/reviews/strategy/warcraft-iii-reforged",
    "date": "2020-02-27T00:00:00.000Z",
    "score": 6.0,
    "comments": "More of a remaster than a reforge, this remains a quality RTS title, but is a letdown for long-time fans with its lack of new content and Blizzard’s creativity-stifling ownership of custom maps.",
    "gameID": 0,
    "author": "The Overpowered Noobs"
  },
  {
    "source": "https://games.tiscali.cz/recenze/warcraft-iii-reforged-recenze-339846",
    "date": "2020-02-28T00:00:00.000Z",
    "score": 5.0,
    "comments": "This new Warcraft III is still a brilliant strategy game, much prettier than before. But it’s also much more broken, full of irritating bugs and broken promises. What’s more, it murdered its older brother.",
    "gameID": 0,
    "author": "Games.cz"
  },
  {
    "source": "https://www.player2.net.au/2020/02/warcraft-3-reforged-a-nostalgia-trip-not-a-reinvention/",
    "date": "2020-03-02T00:00:00.000Z",
    "score": 5.0,
    "comments": "If you set your expectations a little lower, then Warcraft 3: Reforged is a game worth of your time and money. Sadly, for many of us out there, we were expecting a little more.",
    "gameID": 0,
    "author": "Player 2"
  },
  {
    "source": "https://www.ausgamers.com/games/warcraft-3-reforged/review/",
    "date": "2020-03-04T00:00:00.000Z",
    "score": 6.5,
    "comments": "In the end it’s worth noting that when viewing a remake or remaster what needs to be taken into consideration is the source material, how it looks, feels, and plays. That is, in addition to the work carried out to recreate moments, update visuals, and change any of the presentation. To do otherwise would be silly, a terrible game with a wonderful remaster doesn’t warrant a high score. In the case of Warcraft III, the inverse to that is also true. So, what we end up with is something in-between. A classic reborn, in a package that doesn’t warrant all that much in the way of celebration.",
    "gameID": 0,
    "author": "AusGamers"
  }
]