[
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2018-09-22T00:00:00.000Z",
    "score": 6.0,
    "comments": "fifa 19\nfifa 19 this year is fair . same gameplay since fifa 16 not big changes there is some new modes and the ucl license but players want on the pitch gameplay passing accuracy is a lot less automatic. While the resulting im... ",
    "gameID": 0,
    "author": "yipfosh"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-09-27T00:00:00.000Z",
    "score": 1.0,
    "comments": "Fifa 19 \u003d Fifa 18\nBasically the same game. No new animations, no new nothing. People continue to buy because of online gaming (if you want to continue to play with others you need to buy a new version). Pro Clubs is the same of past 2 yea... ",
    "gameID": 0,
    "author": "mauricioam74"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 4,
    "date": "2018-09-28T00:00:00.000Z",
    "score": 4.0,
    "comments": "Soccer game fall\nDisaster animations especially during the gameplay view. Disaster Physics Engine, Disaster Modeling. Disaster ball physics, career mode No big change.. Unbalanced face quality. Excellent content. Great atmosphere. Wonder... ",
    "gameID": 0,
    "author": "DATISS88"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-09-28T00:00:00.000Z",
    "score": 6.0,
    "comments": "Horrible new way gameplay specially new to shoot\nHorrible new way kick gameplay so frustrating Not much diffrent graphics got slightly We all hate new gameplay We were hoping camera option could be little bit different after 5 years same setting option and bro... ",
    "gameID": 0,
    "author": "alanzare"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2018-09-28T00:00:00.000Z",
    "score": 3.0,
    "comments": "New update not a new game,Frustrating game play, 20%graphics imporovmant\nNot fare spend alot of money for just 10to 20% imporovmant Graphics got slightly better Fan looks better Commentary is is accurate and great on UEFA New shooting mode is make gameplay sick For full price gam... ",
    "gameID": 0,
    "author": "alanzare"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2018-10-13T00:00:00.000Z",
    "score": 9.0,
    "comments": "FIFA 19 simple review\nFIFA 19 is the new version of the EA SPORTS products. more reality than least versions.Cover of the game for Cristiano Ronaldo.control of the game is being more conflict, it\u0027s really like reals game.FIFA 19 very enjoyabl... ",
    "gameID": 0,
    "author": "abdullahkm"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2018-11-03T00:00:00.000Z",
    "score": 1.0,
    "comments": "BUYER BEWARE. EA Script 19, IF YOU FEEL LIKE GOING TO TEATHER BUY AND PLAY THIS GAME.\n\"STATE THEY REMOVED THE SAVING FEATURE OF REPLAYS AND REPLAYS AFTER TIMES COMPLETLY, BUYER BEWARE.\"Took me playing (bought unfortunatly) fifa 19 to finally decide on creating an acount and reviewi a game.Where to start d... ",
    "gameID": 0,
    "author": "elouco"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2018-12-17T00:00:00.000Z",
    "score": 1.0,
    "comments": "Dangerous for mental health\nThis \"game\" literally gives more headaches than fun. 17 days playing and already unistalled it. The IA just doesn\u0027t play football. It just scores when it wants.The most common game is something like:You: 27 shots18 to go... ",
    "gameID": 0,
    "author": "bugisoff"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2018-12-22T00:00:00.000Z",
    "score": 4.0,
    "comments": "If you want a good football game, play fifa 14.\nThe first thing that hits me when I playing fifa 19, is the feeling that you have seen this before. And we all have, for the last 5 years. Nothing in this game resembles football, besides 11 players on each team, a refer... ",
    "gameID": 0,
    "author": "ks_86"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2018-12-28T00:00:00.000Z",
    "score": 8.0,
    "comments": "FIFA 19\nI used to purchase FIFA each year but eventually lost the passion for the franchise. The gameplay started to feel the same each year, and the computer seemed to cheat (suddenly became extremely difficult in the final min... ",
    "gameID": 0,
    "author": "Ignition_jammy"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-01-19T00:00:00.000Z",
    "score": 4.0,
    "comments": "EA just can\u0027t seem to get it right\nFirstly, I\u0027ve been playing fifa since the 2010 edition, and remember clearly some very good years like 2012,2013,2014. But boy has it gone downhill..the AI is just all over the place and at times dominates, no proper flu... ",
    "gameID": 0,
    "author": "chrisc7"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2019-01-28T00:00:00.000Z",
    "score": 1.0,
    "comments": "EA has absolutely shit the bed. Once again.\nNow, I own the digital version of the game, not once have I wanted to own a disc so badly for the sole reason of being able to burn the game and remove its absurdly wasteful $60 existence from my home. After trying to gi... ",
    "gameID": 0,
    "author": "naaabs916"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2019-02-23T00:00:00.000Z",
    "score": 1.0,
    "comments": "The worst of its series\nMany reasons I would consider it the worst FIFA ever, but here are some:- kickoff-glitch still not fixed- 45th/90th-minute-glitch not fixed- no chance to get anywhere without paying an extra 100$ for Icons or other super... ",
    "gameID": 0,
    "author": "dny333"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2019-02-27T00:00:00.000Z",
    "score": 1.0,
    "comments": "Worst sports game ever\nThis version is the worst of all time. If you want a shitty,static,stupid,pay to win game buy it. But if you want to enjoy the game or just want a realistic football simulator,don\u0027t buy this shit.Pls!BOYCOTT EASPORTS!!!... ",
    "gameID": 0,
    "author": "bruno91"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2019-02-28T00:00:00.000Z",
    "score": 2.0,
    "comments": "Scripted as f*ck\nFifa 19 is just a copy of fifa 18/19 with slight increased graphics but the gameplay is fake as hell. This game is just a waist of time. I get crazy of the game constantly trying to let me lose in all sort of ways. Gamep... ",
    "gameID": 0,
    "author": "jennik"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2019-03-12T00:00:00.000Z",
    "score": 1.0,
    "comments": "By far the worst fifa ever\nTotally embarrassing.Nothing more than a failure of football games.from every side of it you can easily spot mistakes.No physics of the ball, a non-existent defending system,this game literally makes me think that the de... ",
    "gameID": 0,
    "author": "marakovic1"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2019-03-14T00:00:00.000Z",
    "score": 1.0,
    "comments": "Herpes on a disk\nWould rather dip my testicles in steak sauce and walk into a Lion\u0027s den , swear my alliegance to the Ugandan gay community and attend their \"festivals\" and get fiddled with \u0027round the back of a Chinese in Sunderland than... ",
    "gameID": 0,
    "author": "neppoisbumder"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2019-03-17T00:00:00.000Z",
    "score": 1.0,
    "comments": "FUCK THIS FUCKING GAME\nTHIS IS A FUCKING SHITTY GAME, AT FIRST YOU THINK ITS GOOD BUT IN THE END ITS A FUCKING A DICK OF A GAME, THIS GAME IS A FUCKING TRASH DONT PLAY IS **** EA THOSE MOTHERFUCKERS THAT ARE NOT DOING ANYTHING TO IMPROVE THEIR... ",
    "gameID": 0,
    "author": "tfspikes"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 3,
    "date": "2019-04-07T00:00:00.000Z",
    "score": 1.0,
    "comments": "Don\u0027t buy this game\nGameplay is terrible. Passes don\u0027t go where you direct. Manual defending and jockeying is terrible. AI interefence in this game is op, this game requires no skill to play as it is was designed to put everybody on the sam... ",
    "gameID": 0,
    "author": "nuel99fc"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2019-04-18T00:00:00.000Z",
    "score": 4.0,
    "comments": "Game is ok.. too many bs\nI always loved playing fifa mostly ultimate team. This one i highly dislike. If you have poor internet and you are winning they take your points and coins. I emailed them about it but no help at all. Ultimate team is als... ",
    "gameID": 0,
    "author": "legend_killer14"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-04-19T00:00:00.000Z",
    "score": 1.0,
    "comments": "Worst is not enough for this game.\nThis game is suicide. You can\u0027t have fun playing this game. Every game mode is stressfull. Online Connection is awful, It\u0027s like watching a video in a very slow internet connection. Al defending is very overpowered. Manu... ",
    "gameID": 0,
    "author": "shirbavikar"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-05-10T00:00:00.000Z",
    "score": 2.0,
    "comments": "Mistakes after mistakes..\nThe consistency of this game is so poor. Every game you play something you didn\u0027t control a player to do, will happen and probably end up in conceding a goal. The insane amount of CPU error on this game is incredible. St... ",
    "gameID": 0,
    "author": "tomclunie23"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-05-18T00:00:00.000Z",
    "score": 1.0,
    "comments": "FIFA 19 is the WORST FIFA GAME EVER (SO DISSAPOINTED)\nThis fifa 19 game is the most frustrating game I have ever played. Passes never go in the right direction, shots never go in the right direction, the CPU is way too OP, Defenders always grab you and then get the ball, cr... ",
    "gameID": 0,
    "author": "bb140"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-06-30T00:00:00.000Z",
    "score": 1.0,
    "comments": "An insult to football itself\nThis game is absolutely horrific. Servers are that bad, out of 18 games I played in the last 24 hours I got disconnected 3 times while I was winning the game and got a loss for each game and not a win. Game is extremely ... ",
    "gameID": 0,
    "author": "benniz27"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-07-29T00:00:00.000Z",
    "score": 2.0,
    "comments": "Scripted game\nFifa 19 was a nightmare to me...as a new player i kina got the mechanics of the game...over a year i witnessed a lot of players...starting from the legit player to the toxic one to the scripted one...the scripted one is ... ",
    "gameID": 0,
    "author": "da_bruh"
  }
]