[
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-08-21T00:00:00.000Z",
    "score": 9.0,
    "comments": "A Polished Classic - Beautifully Re-mastered and Familiar.\nKeeping it Short and Sweet: This is a \u0027re-master\u0027 of the classic shooter that you\u0027ve grown to love. The game remains largely unchanged at its core, as it moves and feels no different than CS 1.6/CS Source when mech... ",
    "gameID": 0,
    "author": "nikocoast"
  },
  {
    "helpfulCount": 7,
    "helpfulScore": 2,
    "date": "2012-08-22T00:00:00.000Z",
    "score": 7.0,
    "comments": "CSGO is a CSS mod. There aren\u0027t enough improvements to make this game worth your time. Good thing the price tag was low.\nIf you\u0027ve played CSS then you\u0027ve played CSGO. The new features in CSGO aren\u0027t impressive enough to really consider it an entirely new game. Most of what the creators have added to this game have already been done my CS1.... ",
    "gameID": 0,
    "author": "blacksaibot"
  },
  {
    "helpfulCount": 8,
    "helpfulScore": 4,
    "date": "2012-08-22T00:00:00.000Z",
    "score": 6.0,
    "comments": "Disappointing. Feel like I\u0027ve been ripped off by Valve.\nFor the record, long ago when the grass was green and the sky was blue, I played the piss out of CounterStrike and then CounterStrike Source on the PC. I thought Source, with its abundance of free, great, user-made maps ... ",
    "gameID": 0,
    "author": "d_parker"
  },
  {
    "helpfulCount": 5,
    "helpfulScore": 1,
    "date": "2012-08-22T00:00:00.000Z",
    "score": 9.0,
    "comments": "A great remake of the Counter Strike classic\nCounter Strike G.O is the 4th remake of the Counter Strike franchise. Its basically a intense first person shooter game. Its mostly a multiplayer game with no story line however players can play offline with player contr... ",
    "gameID": 0,
    "author": "Deadskull102"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2012-08-24T00:00:00.000Z",
    "score": 8.5,
    "comments": "Good challege, some gameplay changes from pc to console (360) .\nThe first time I\u0027ve take controls I thought that game-play gonna be like Halo or left 4 dead, but is close like crysis 2 or CoD, aim is difficult, I spend a long time making a good control experience. If you are one of ... ",
    "gameID": 0,
    "author": "Maelsthur"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2012-08-25T00:00:00.000Z",
    "score": 9.0,
    "comments": "CS on the 360 is almost as fun as playing on my PC 10 years ago and really is well worht the 15.00\nCounter Strike redone for the xbox 360 is almost as fun as playing on my PC 10 years ago and really is well worht the 15.00. The game looks good plays well and is a blast with a party. It pulls you in and that is what a... ",
    "gameID": 0,
    "author": "Rincon"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 2,
    "date": "2012-08-25T00:00:00.000Z",
    "score": 7.5,
    "comments": "Pretty good but is it worth getting?\nI downloaded the game a few days ago and I think it\u0027s pretty good. When I first started playing it, it took me a few minutes to say \"hey this isn\u0027t bad\". I wouldn\u0027t consider this the best FPS but it\u0027s good. When it ... ",
    "gameID": 0,
    "author": "coolkid93"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 1,
    "date": "2012-08-25T00:00:00.000Z",
    "score": 9.0,
    "comments": "CS:GO seems to have polarized Gamingdom! I think I see why one side (Haters of course!) seems to be shouting the loudest\nIf you have done any research into what gamers think of the latest Counter Strike release, you are most likely going to come away with the impression that the game is garbage. This would be a good time for me to remind y... ",
    "gameID": 0,
    "author": "JTisTrue"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2012-08-28T00:00:00.000Z",
    "score": 9.0,
    "comments": "Old School Counter-Strike with a fresh coat of paint!\nI used to play Counter-Strike a lot back in the day when it was all the rage. It has been YEARS since I played the game so when I heard it was coming out for the PS3 I was very excited. Luckily, this game does not disapp... ",
    "gameID": 0,
    "author": "Jrfanfreak88"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-09-01T00:00:00.000Z",
    "score": 9.0,
    "comments": "I just started with CS 1.1...and iam happy that valve has recreate the feeling from older cs with new graphics and style\nI just started with CS 1.1...and iam happy that valve has recreate the feeling from older cs with new graphics and style. the graphics arent the best from this time, but the feeling of the game and the engine is more com... ",
    "gameID": 0,
    "author": "Marule"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-09-04T00:00:00.000Z",
    "score": 8.0,
    "comments": "CS:GO is like the name says: good to go (at least if you are familiarized with the older versions).\nSo you played Counter Strike (who doesn\u0027t) and you want a new installment with enough changes (to make the game interesting again) but you don\u0027t want too many changes (to make it a really new game): here it is: CS:GO. 80... ",
    "gameID": 0,
    "author": "0danan"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2012-09-05T00:00:00.000Z",
    "score": 9.0,
    "comments": "Just as immersible as before ....\nJust as immersible as before ... smooth fast to learn. Maps are now more balanced and 2 new modes \"Arms Race\" and \"Demolition\" are the ones I find myself playing the most. These 2 new modes are also a very good way of im... ",
    "gameID": 0,
    "author": "shamsnaved"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 2,
    "date": "2012-09-08T00:00:00.000Z",
    "score": 9.0,
    "comments": "For all the CS lovers! A game we\u0027ve been ALL waiting for. New graphics and mechanisms, and much more in the review below\n1 - Graphics : The graphics have greatly changed since its predecessor. A huge forward leap in lighting, shadows, specular mappings, and HDR / Bloom effects. Lighting has become great. You can notice the new reflection ... ",
    "gameID": 0,
    "author": "volc-123"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-09-17T00:00:00.000Z",
    "score": 10.0,
    "comments": "I never thought that Valve could improve Counter Strike, but they have improved. The game has stunning graphics!\nI never thought that Valve could improve Counter Strike, but they have improved. The game has stunning graphics, interactivity with objects and the same gameplay that has always been the strong point of the game. We no l... ",
    "gameID": 0,
    "author": "edervalois"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-09-27T00:00:00.000Z",
    "score": 7.5,
    "comments": "This game never made it big on consoles. It\u0027s OK but nothing compared to the PC version.\nEverybody knows the good ol\u0027 days Counterstrike. And if you didn\u0027t you missed out on an era of balanced online shooting at it\u0027s finest. But that was for the PC. Wish i still had a decent computer to run this! 360 vers... ",
    "gameID": 0,
    "author": "Romayo83"
  },
  {
    "helpfulCount": 3,
    "helpfulScore": 0,
    "date": "2012-09-29T00:00:00.000Z",
    "score": 6.5,
    "comments": "cs go is not good to go,,there are many things about this game that are just wrong ,,here is reviewfor pc\u0026xbox,,both\nbest parts is graphics and sound,,but thats just about it ;p ;) ,, wrong,,weird and broken ,,its still solid but not nearly as it once was,,rather the opposite,,and can get boring fast,,which are not a good th... ",
    "gameID": 0,
    "author": "gamespot2DBOne"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-10-15T00:00:00.000Z",
    "score": 8.0,
    "comments": "Counter Strike Was The King Of Shooters To Many Back In The Day, But How Does It Fair With Other Shooters Now?\nI got myself a PSN card a good month or two ago, and for one purpose, to purchase the new downloadable Counter Strike. I always enjoyed Counter Strike on PC what seemed like nearly a decade ago (oh wait) the same way ... ",
    "gameID": 0,
    "author": "Arbalon"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-11-02T00:00:00.000Z",
    "score": 9.0,
    "comments": "Incredibly surprised and impressed with the final \"Fit and finish\" of the latest rendition in this hardcore FPS-series.\nIf Counter Strike: Source was a step up, this title meets and exceeds any expectation that one could have had. Note that Gearbox Entertainment developed this title, but it should be fair to assume that Valve had more tha... ",
    "gameID": 0,
    "author": "HannesFury"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 0,
    "date": "2012-11-04T00:00:00.000Z",
    "score": 7.0,
    "comments": "Not for everyone\nHad the opportunity to play CS: Global Offensive this weekend, Source offered free play of the full version of this game and here is my take on the PC version. CS: Global Offensive is more of a meh kinda game. First off ... ",
    "gameID": 0,
    "author": "youngzen69"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2012-11-18T00:00:00.000Z",
    "score": 4.0,
    "comments": "With great graphics but bad gameplay, the game struggles to get a decent review from me.\nWell, let\u0027s start off. This game looks absolutely fantastic. The graphical part of the game is fantastic, and I love the absolute look. But here\u0027s the bad bit: Gameplay. I can\u0027t put loads in this review because the gamep... ",
    "gameID": 0,
    "author": "UKSavage"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-11-29T00:00:00.000Z",
    "score": 8.5,
    "comments": "Counter Strike: Global Offensive - A new step in the future?\nThe Game Counter Strike: Global Offensive is another fun Game published by Valve in it\u0027s Counter Strike \u0027Episodes\u0027. I really enjoyed the two new side missions or \u0027mods\u0027: Arms Race and Demolitions. They were and are still... ",
    "gameID": 0,
    "author": "sniperboyz"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-12-27T00:00:00.000Z",
    "score": 7.0,
    "comments": "Counter Strike: Globe Offensive is a great competitive FPS but its better played on PC.\nJust made from a mod out of Half Life came Counter Strike, a tactical first person shooter with an simple yet, interesting concept. Before Call of duty had Search and Destroy game types, Counter Strike had defuse game ty... ",
    "gameID": 0,
    "author": "princevalvick"
  },
  {
    "helpfulCount": 2,
    "helpfulScore": 1,
    "date": "2012-12-27T00:00:00.000Z",
    "score": 5.5,
    "comments": "Counter Strike just doesn\u0027t work on consoles\nIt\u0027s counter strike, it\u0027s one of the greatest FPS shooters of all time on the PC, it requires speed, precision and teamwork. And it isn\u0027t just a twitch shooter. Those of you who are familiar with counterstrike will be pl... ",
    "gameID": 0,
    "author": "Macklemore"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2012-12-28T00:00:00.000Z",
    "score": 9.5,
    "comments": "The franchise that started multiplayer FPS stays true to the classic and is now even more polished!\nI must have played over a thousand hours of the original Counter-Strike game, since 2000, which is why I had doubts when I bought CS:GO. I must say that I\u0027m very pleased with what they\u0027ve done! First, they greatly imp... ",
    "gameID": 0,
    "author": "sarkaos"
  },
  {
    "helpfulCount": 4,
    "helpfulScore": 3,
    "date": "2012-12-29T00:00:00.000Z",
    "score": 9.0,
    "comments": "Still hardcore as hell.\nThis is the 3rd big remake of Counter-Strike released publicly. It even got a 2D version that works much the same way with multiplayer and all. Counter-Strike 1.6 (along with its previous versions) was the one game that ... ",
    "gameID": 0,
    "author": "Junior_AIN"
  },
  {
    "helpfulCount": 28,
    "helpfulScore": 12,
    "date": "2013-02-11T00:00:00.000Z",
    "score": 3.0,
    "comments": "This is by far a huge rip off and shameless money grab.\nThis is just a cheap way of milking money out of fans of cs. I bought 2 versions of this thinking this was really gonna expand the cs world n what not. It does nothing but add a few guns, that you will notice NO ONE USES... ",
    "gameID": 0,
    "author": "davidsworld3"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-02-17T00:00:00.000Z",
    "score": 9.0,
    "comments": "Highly Addictive! Really!\nCounter Strike: Global Offensive is Highly Addictive, so i advice to all 8-10 years of age to stay out of this game. So now for the review. CS:GO is an online first-person shooter developed by Valve Corporation and Hidde... ",
    "gameID": 0,
    "author": "Xtian10cruz"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-05-01T00:00:00.000Z",
    "score": 4.0,
    "comments": "If you\u0027re considering buying Global Offensive via XBLA, I\u0027d really save your money... for now.\nI\u0027ve been a fan of the Counter Strike series for a long time now, and not one has come to disappoint me, and are among one of the most balanced, hardcore and fun multiplayer shooters I have ever played. However, I stuck ... ",
    "gameID": 0,
    "author": "deactivated-57d8862626cff"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-05-02T00:00:00.000Z",
    "score": 8.5,
    "comments": "One of my all-time favorite online FPS comes back to consoles.\nPlaying this new \u0027Counter-Strike\u0027 reminds me of my days on my PC, playing version 1.6 for more hours than I would like to admit. It still brings me joy, endless anger, and frustration at the same time. It still pains me ... ",
    "gameID": 0,
    "author": "Godsire-"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-05-18T00:00:00.000Z",
    "score": 7.5,
    "comments": "Good matchmaking; good graphics; but $15 might be too cheap to deter people from hacking, getting banned, and re-buying.\nAs an avid cs player (I\u0027ve played CS since 1.5- which includes 1.5, 1.6, CZ, Source, and also the original xbox version I have to say this is a great \"update\" to the game. Basically, take any cs game, add new visuals and... ",
    "gameID": 0,
    "author": "ninedot"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-06-30T00:00:00.000Z",
    "score": 8.5,
    "comments": "It\u0027s just nice.\nThis game is just 15 dollars and it\u0027s 100% worth it, it has new menu to buy guns,more maps, and more graphics, it\u0027s has more game modes but the one i enjoy most is the \"Classic Competitive\" it\u0027s a rank system with Counte... ",
    "gameID": 0,
    "author": "Gameadd1cts"
  },
  {
    "helpfulCount": 0,
    "helpfulScore": 0,
    "date": "2013-09-11T00:00:00.000Z",
    "score": 9.0,
    "comments": "Counter strike is back to his own deserved place\nFirst of all, I\u0027ve been a CS player for a long time, so probably my review will be a llitle biased to cs community. I say this because I\u0027ve been reading some users reviews and I gotta say, this game is certainly NOT for ... ",
    "gameID": 0,
    "author": "TeePoz0r"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2013-10-27T00:00:00.000Z",
    "score": 9.0,
    "comments": "Couter Strike GO\nIn my recent years of PC gaming I played the Counter Strike Franchise. Played in the beta for GO and it turned out just to be what you would want. A better, newer, and updated version of Counter Strike Source. The compet... ",
    "gameID": 0,
    "author": "xROCEMx"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-02-22T00:00:00.000Z",
    "score": 10.0,
    "comments": "The best fps-game.\nIn the Counter-Strike-series you (normally) play rounds and if you get fragged you have to wait until next round, which can take minutes. This differs from many other fps-games where you re-spawn after a couple of second... ",
    "gameID": 0,
    "author": "Fotboll10"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2014-04-23T00:00:00.000Z",
    "score": 8.0,
    "comments": "Better then expected!\nI came into this game with very little expectation for its success, after playing years of CS from the days of 1.3 up until its final release of 1.6 at a competitive level. Its hard to convince someone like me that Coun... ",
    "gameID": 0,
    "author": "marketnag"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2015-06-20T00:00:00.000Z",
    "score": 8.0,
    "comments": "cs go is the best game for esports\nIn Greece we love the Counter Strike. And some people now trying to do the Greek communicate more popular. We have so many good players and very god teams... The Counter Strike is a very good game with strategy and more... ",
    "gameID": 0,
    "author": "hi_am_kostas"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2016-02-25T00:00:00.000Z",
    "score": 9.0,
    "comments": "CSGO Review\nWith over 100 hours put into this game, and not even beginning to feel burned out. There are, however a few flaws that I\u0027m sure will be ironed out with the frequent updates.The game offers an immersive team-based experie... ",
    "gameID": 0,
    "author": "jabba"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2017-02-28T00:00:00.000Z",
    "score": 8.0,
    "comments": "CSGO play it again and again\nCounter Strike Global Offensive is a concrete follow up to CS Source. With constant updates and smooth gameplay it is near the perfect online shooter. But lets start with the bad points, first of all the game is riddled ... ",
    "gameID": 0,
    "author": "adamoggy"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2017-04-01T00:00:00.000Z",
    "score": 10.0,
    "comments": "Valve Never Disappoint Us\nReally great FPS game and best for multiplayer and compitions from my point of view.. exelent graphics improvement smooth gameplay well optimized... I was a big fan of CS 1.6 and now this.. few gamers says that they are ... ",
    "gameID": 0,
    "author": "scroveon"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-06-16T00:00:00.000Z",
    "score": 9.0,
    "comments": "still good game\nits a wonderful game but got down buy the free csgo that make so many cheaters. but overral i love this game (if you have prime). regular competitive mode should have knife round at the beginings to choose your side when... ",
    "gameID": 0,
    "author": "slamgavin"
  },
  {
    "helpfulCount": 1,
    "helpfulScore": 1,
    "date": "2019-07-24T00:00:00.000Z",
    "score": 9.0,
    "comments": "I still enjoy this game!\nDon\u0027t write something dumb!Your review must be at least 100 words long.Use clear, easy-to-follow language whenever possible.Remember: Your words may be the words that sway a reader into buying or avoiding this product. S... ",
    "gameID": 0,
    "author": "anothergstest"
  }
]
